----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 314, 314]          10,400
       BatchNorm2d-2         [-1, 32, 314, 314]              64
            Conv2d-3         [-1, 64, 157, 157]          18,496
       BatchNorm2d-4         [-1, 64, 157, 157]             128
         MaxPool2d-5           [-1, 64, 78, 78]               0
            Conv2d-6          [-1, 128, 78, 78]          73,856
       BatchNorm2d-7          [-1, 128, 78, 78]             256
              ReLU-8          [-1, 128, 78, 78]               0
 AdaptiveAvgPool2d-9            [-1, 128, 1, 1]               0
           Conv1d-10               [-1, 1, 128]               5
          Sigmoid-11            [-1, 128, 1, 1]               0
        eca_block-12          [-1, 128, 78, 78]               0
           Conv2d-13          [-1, 128, 78, 78]           8,192
      BatchNorm2d-14          [-1, 128, 78, 78]             256
      double_conv-15          [-1, 128, 78, 78]               0
             down-16          [-1, 128, 78, 78]               0
        MaxPool2d-17          [-1, 128, 39, 39]               0
           Conv2d-18          [-1, 256, 39, 39]         295,168
      BatchNorm2d-19          [-1, 256, 39, 39]             512
             ReLU-20          [-1, 256, 39, 39]               0
AdaptiveAvgPool2d-21            [-1, 256, 1, 1]               0
           Conv1d-22               [-1, 1, 256]               5
          Sigmoid-23            [-1, 256, 1, 1]               0
        eca_block-24          [-1, 256, 39, 39]               0
           Conv2d-25          [-1, 256, 39, 39]          32,768
      BatchNorm2d-26          [-1, 256, 39, 39]             512
      double_conv-27          [-1, 256, 39, 39]               0
             down-28          [-1, 256, 39, 39]               0
        MaxPool2d-29          [-1, 256, 19, 19]               0
           Conv2d-30          [-1, 512, 19, 19]       1,180,160
      BatchNorm2d-31          [-1, 512, 19, 19]           1,024
             ReLU-32          [-1, 512, 19, 19]               0
AdaptiveAvgPool2d-33            [-1, 512, 1, 1]               0
           Conv1d-34               [-1, 1, 512]               5
          Sigmoid-35            [-1, 512, 1, 1]               0
        eca_block-36          [-1, 512, 19, 19]               0
           Conv2d-37          [-1, 512, 19, 19]         131,072
      BatchNorm2d-38          [-1, 512, 19, 19]           1,024
      double_conv-39          [-1, 512, 19, 19]               0
             down-40          [-1, 512, 19, 19]               0
        MaxPool2d-41            [-1, 512, 9, 9]               0
           Conv2d-42            [-1, 512, 9, 9]       2,359,808
      BatchNorm2d-43            [-1, 512, 9, 9]           1,024
             ReLU-44            [-1, 512, 9, 9]               0
AdaptiveAvgPool2d-45            [-1, 512, 1, 1]               0
           Conv1d-46               [-1, 1, 512]               5
          Sigmoid-47            [-1, 512, 1, 1]               0
        eca_block-48            [-1, 512, 9, 9]               0
      double_conv-49            [-1, 512, 9, 9]               0
             down-50            [-1, 512, 9, 9]               0
  ConvTranspose2d-51          [-1, 512, 18, 18]       1,049,088
           Conv2d-52          [-1, 256, 19, 19]       2,359,552
      BatchNorm2d-53          [-1, 256, 19, 19]             512
             ReLU-54          [-1, 256, 19, 19]               0
AdaptiveAvgPool2d-55            [-1, 256, 1, 1]               0
           Conv1d-56               [-1, 1, 256]               5
          Sigmoid-57            [-1, 256, 1, 1]               0
        eca_block-58          [-1, 256, 19, 19]               0
           Conv2d-59          [-1, 256, 19, 19]         262,144
      BatchNorm2d-60          [-1, 256, 19, 19]             512
      double_conv-61          [-1, 256, 19, 19]               0
               up-62          [-1, 256, 19, 19]               0
  ConvTranspose2d-63          [-1, 256, 38, 38]         262,400
           Conv2d-64          [-1, 128, 39, 39]         589,952
      BatchNorm2d-65          [-1, 128, 39, 39]             256
             ReLU-66          [-1, 128, 39, 39]               0
AdaptiveAvgPool2d-67            [-1, 128, 1, 1]               0
           Conv1d-68               [-1, 1, 128]               5
          Sigmoid-69            [-1, 128, 1, 1]               0
        eca_block-70          [-1, 128, 39, 39]               0
           Conv2d-71          [-1, 128, 39, 39]          65,536
      BatchNorm2d-72          [-1, 128, 39, 39]             256
      double_conv-73          [-1, 128, 39, 39]               0
               up-74          [-1, 128, 39, 39]               0
  ConvTranspose2d-75          [-1, 128, 78, 78]          65,664
           Conv2d-76           [-1, 64, 78, 78]         147,520
      BatchNorm2d-77           [-1, 64, 78, 78]             128
             ReLU-78           [-1, 64, 78, 78]               0
AdaptiveAvgPool2d-79             [-1, 64, 1, 1]               0
           Conv1d-80                [-1, 1, 64]               3
          Sigmoid-81             [-1, 64, 1, 1]               0
        eca_block-82           [-1, 64, 78, 78]               0
           Conv2d-83           [-1, 64, 78, 78]          16,384
      BatchNorm2d-84           [-1, 64, 78, 78]             128
      double_conv-85           [-1, 64, 78, 78]               0
               up-86           [-1, 64, 78, 78]               0
  ConvTranspose2d-87         [-1, 64, 156, 156]          16,448
           Conv2d-88         [-1, 64, 157, 157]          73,792
      BatchNorm2d-89         [-1, 64, 157, 157]             128
             ReLU-90         [-1, 64, 157, 157]               0
AdaptiveAvgPool2d-91             [-1, 64, 1, 1]               0
           Conv1d-92                [-1, 1, 64]               3
          Sigmoid-93             [-1, 64, 1, 1]               0
        eca_block-94         [-1, 64, 157, 157]               0
           Conv2d-95         [-1, 64, 157, 157]           8,192
      BatchNorm2d-96         [-1, 64, 157, 157]             128
      double_conv-97         [-1, 64, 157, 157]               0
               up-98         [-1, 64, 157, 157]               0
         Upsample-99         [-1, 64, 314, 314]               0
 ConvTranspose2d-100         [-1, 32, 320, 320]         165,920
     BatchNorm2d-101         [-1, 32, 320, 320]              64
          Conv2d-102          [-1, 1, 320, 320]              33
          Conv2d-103          [-1, 1, 320, 320]              33
          Conv2d-104          [-1, 1, 320, 320]              33
          Conv2d-105          [-1, 1, 320, 320]              33
================================================================
Total params: 9,199,592
Trainable params: 9,199,592
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.56
Forward/backward pass size (MB): 422.96
Params size (MB): 35.09
Estimated Total Size (MB): 459.62
----------------------------------------------------------------
