----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]          10,400
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 32, 112, 112]             288
       BatchNorm2d-4         [-1, 32, 112, 112]              64
         Hardswish-5         [-1, 32, 112, 112]               0
       ConvBNLayer-6         [-1, 32, 112, 112]               0
            Conv2d-7         [-1, 64, 112, 112]           2,048
       BatchNorm2d-8         [-1, 64, 112, 112]             128
         Hardswish-9         [-1, 64, 112, 112]               0
      ConvBNLayer-10         [-1, 64, 112, 112]               0
DepthwiseSeparable-11         [-1, 64, 112, 112]               0
           Conv2d-12           [-1, 64, 56, 56]             576
      BatchNorm2d-13           [-1, 64, 56, 56]             128
        Hardswish-14           [-1, 64, 56, 56]               0
      ConvBNLayer-15           [-1, 64, 56, 56]               0
           Conv2d-16          [-1, 128, 56, 56]           8,192
      BatchNorm2d-17          [-1, 128, 56, 56]             256
        Hardswish-18          [-1, 128, 56, 56]               0
      ConvBNLayer-19          [-1, 128, 56, 56]               0
DepthwiseSeparable-20          [-1, 128, 56, 56]               0
           Conv2d-21          [-1, 128, 56, 56]         147,584
      BatchNorm2d-22          [-1, 128, 56, 56]             256
           Conv2d-23          [-1, 128, 56, 56]         147,584
      BatchNorm2d-24          [-1, 128, 56, 56]             256
AdaptiveAvgPool2d-25            [-1, 128, 1, 1]               0
           Conv1d-26               [-1, 1, 128]               5
          Sigmoid-27            [-1, 128, 1, 1]               0
        eca_block-28          [-1, 128, 56, 56]               0
    ResidualBlock-29          [-1, 128, 56, 56]               0
           Conv2d-30          [-1, 128, 56, 56]         147,584
      BatchNorm2d-31          [-1, 128, 56, 56]             256
           Conv2d-32          [-1, 128, 56, 56]         147,584
      BatchNorm2d-33          [-1, 128, 56, 56]             256
AdaptiveAvgPool2d-34            [-1, 128, 1, 1]               0
           Conv1d-35               [-1, 1, 128]               5
          Sigmoid-36            [-1, 128, 1, 1]               0
        eca_block-37          [-1, 128, 56, 56]               0
    ResidualBlock-38          [-1, 128, 56, 56]               0
           Conv2d-39          [-1, 128, 56, 56]         147,584
      BatchNorm2d-40          [-1, 128, 56, 56]             256
           Conv2d-41          [-1, 128, 56, 56]         147,584
      BatchNorm2d-42          [-1, 128, 56, 56]             256
AdaptiveAvgPool2d-43            [-1, 128, 1, 1]               0
           Conv1d-44               [-1, 1, 128]               5
          Sigmoid-45            [-1, 128, 1, 1]               0
        eca_block-46          [-1, 128, 56, 56]               0
    ResidualBlock-47          [-1, 128, 56, 56]               0
           Conv2d-48          [-1, 128, 56, 56]         147,584
      BatchNorm2d-49          [-1, 128, 56, 56]             256
           Conv2d-50          [-1, 128, 56, 56]         147,584
      BatchNorm2d-51          [-1, 128, 56, 56]             256
AdaptiveAvgPool2d-52            [-1, 128, 1, 1]               0
           Conv1d-53               [-1, 1, 128]               5
          Sigmoid-54            [-1, 128, 1, 1]               0
        eca_block-55          [-1, 128, 56, 56]               0
    ResidualBlock-56          [-1, 128, 56, 56]               0
           Conv2d-57          [-1, 128, 56, 56]         147,584
      BatchNorm2d-58          [-1, 128, 56, 56]             256
           Conv2d-59          [-1, 128, 56, 56]         147,584
      BatchNorm2d-60          [-1, 128, 56, 56]             256
AdaptiveAvgPool2d-61            [-1, 128, 1, 1]               0
           Conv1d-62               [-1, 1, 128]               5
          Sigmoid-63            [-1, 128, 1, 1]               0
        eca_block-64          [-1, 128, 56, 56]               0
    ResidualBlock-65          [-1, 128, 56, 56]               0
           Conv2d-66           [-1, 64, 56, 56]          16,384
      BatchNorm2d-67           [-1, 64, 56, 56]             128
      ConvBNLayer-68           [-1, 64, 56, 56]               0
           Conv2d-69           [-1, 64, 56, 56]          16,384
      BatchNorm2d-70           [-1, 64, 56, 56]             128
      ConvBNLayer-71           [-1, 64, 56, 56]               0
           Conv2d-72           [-1, 64, 56, 56]           4,096
      BatchNorm2d-73           [-1, 64, 56, 56]             128
      ConvBNLayer-74           [-1, 64, 56, 56]               0
           Conv2d-75           [-1, 64, 56, 56]          36,864
      BatchNorm2d-76           [-1, 64, 56, 56]             128
      ConvBNLayer-77           [-1, 64, 56, 56]               0
DarknetBottleneck-78           [-1, 64, 56, 56]               0
           Conv2d-79          [-1, 128, 56, 56]          16,384
      BatchNorm2d-80          [-1, 128, 56, 56]             256
      ConvBNLayer-81          [-1, 128, 56, 56]               0
         CSPLayer-82          [-1, 128, 56, 56]               0
  ConvTranspose2d-83         [-1, 64, 112, 112]         131,136
      BatchNorm2d-84         [-1, 64, 112, 112]             128
           Conv2d-85         [-1, 32, 112, 112]           4,096
      BatchNorm2d-86         [-1, 32, 112, 112]              64
      ConvBNLayer-87         [-1, 32, 112, 112]               0
           Conv2d-88         [-1, 32, 112, 112]           4,096
      BatchNorm2d-89         [-1, 32, 112, 112]              64
      ConvBNLayer-90         [-1, 32, 112, 112]               0
           Conv2d-91         [-1, 32, 112, 112]           1,024
      BatchNorm2d-92         [-1, 32, 112, 112]              64
      ConvBNLayer-93         [-1, 32, 112, 112]               0
           Conv2d-94         [-1, 32, 112, 112]           9,216
      BatchNorm2d-95         [-1, 32, 112, 112]              64
      ConvBNLayer-96         [-1, 32, 112, 112]               0
DarknetBottleneck-97         [-1, 32, 112, 112]               0
           Conv2d-98         [-1, 64, 112, 112]           4,096
      BatchNorm2d-99         [-1, 64, 112, 112]             128
     ConvBNLayer-100         [-1, 64, 112, 112]               0
        CSPLayer-101         [-1, 64, 112, 112]               0
 ConvTranspose2d-102         [-1, 32, 224, 224]          32,800
     BatchNorm2d-103         [-1, 32, 224, 224]              64
          Conv2d-104         [-1, 16, 224, 224]           1,024
     BatchNorm2d-105         [-1, 16, 224, 224]              32
     ConvBNLayer-106         [-1, 16, 224, 224]               0
          Conv2d-107         [-1, 16, 224, 224]           1,024
     BatchNorm2d-108         [-1, 16, 224, 224]              32
     ConvBNLayer-109         [-1, 16, 224, 224]               0
          Conv2d-110         [-1, 16, 224, 224]             256
     BatchNorm2d-111         [-1, 16, 224, 224]              32
     ConvBNLayer-112         [-1, 16, 224, 224]               0
          Conv2d-113         [-1, 16, 224, 224]           2,304
     BatchNorm2d-114         [-1, 16, 224, 224]              32
     ConvBNLayer-115         [-1, 16, 224, 224]               0
DarknetBottleneck-116         [-1, 16, 224, 224]               0
          Conv2d-117         [-1, 32, 224, 224]           1,024
     BatchNorm2d-118         [-1, 32, 224, 224]              64
     ConvBNLayer-119         [-1, 32, 224, 224]               0
        CSPLayer-120         [-1, 32, 224, 224]               0
 ConvTranspose2d-121         [-1, 32, 224, 224]          82,976
         Dropout-122         [-1, 32, 224, 224]               0
          Conv2d-123          [-1, 1, 224, 224]              33
         Dropout-124         [-1, 32, 224, 224]               0
          Conv2d-125          [-1, 1, 224, 224]              33
         Dropout-126         [-1, 32, 224, 224]               0
          Conv2d-127          [-1, 1, 224, 224]              33
         Dropout-128         [-1, 32, 224, 224]               0
          Conv2d-129          [-1, 1, 224, 224]              33
================================================================
Total params: 1,867,421
Trainable params: 1,867,421
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 505.33
Params size (MB): 7.12
Estimated Total Size (MB): 513.22
----------------------------------------------------------------
