----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 320, 320]             640
       BatchNorm2d-2         [-1, 64, 320, 320]             128
              ReLU-3         [-1, 64, 320, 320]               0
            Conv2d-4         [-1, 64, 320, 320]          36,928
       BatchNorm2d-5         [-1, 64, 320, 320]             128
              ReLU-6         [-1, 64, 320, 320]               0
        DoubleConv-7         [-1, 64, 320, 320]               0
         MaxPool2d-8         [-1, 64, 160, 160]               0
            Conv2d-9        [-1, 128, 160, 160]          73,856
      BatchNorm2d-10        [-1, 128, 160, 160]             256
             ReLU-11        [-1, 128, 160, 160]               0
           Conv2d-12        [-1, 128, 160, 160]         147,584
      BatchNorm2d-13        [-1, 128, 160, 160]             256
             ReLU-14        [-1, 128, 160, 160]               0
       DoubleConv-15        [-1, 128, 160, 160]               0
             Down-16        [-1, 128, 160, 160]               0
        MaxPool2d-17          [-1, 128, 80, 80]               0
           Conv2d-18          [-1, 256, 80, 80]         295,168
      BatchNorm2d-19          [-1, 256, 80, 80]             512
             ReLU-20          [-1, 256, 80, 80]               0
           Conv2d-21          [-1, 256, 80, 80]         590,080
      BatchNorm2d-22          [-1, 256, 80, 80]             512
             ReLU-23          [-1, 256, 80, 80]               0
       DoubleConv-24          [-1, 256, 80, 80]               0
             Down-25          [-1, 256, 80, 80]               0
        MaxPool2d-26          [-1, 256, 40, 40]               0
           Conv2d-27          [-1, 512, 40, 40]       1,180,160
      BatchNorm2d-28          [-1, 512, 40, 40]           1,024
             ReLU-29          [-1, 512, 40, 40]               0
           Conv2d-30          [-1, 512, 40, 40]       2,359,808
      BatchNorm2d-31          [-1, 512, 40, 40]           1,024
             ReLU-32          [-1, 512, 40, 40]               0
       DoubleConv-33          [-1, 512, 40, 40]               0
             Down-34          [-1, 512, 40, 40]               0
        MaxPool2d-35          [-1, 512, 20, 20]               0
           Conv2d-36          [-1, 512, 20, 20]       2,359,808
      BatchNorm2d-37          [-1, 512, 20, 20]           1,024
             ReLU-38          [-1, 512, 20, 20]               0
           Conv2d-39          [-1, 512, 20, 20]       2,359,808
      BatchNorm2d-40          [-1, 512, 20, 20]           1,024
             ReLU-41          [-1, 512, 20, 20]               0
       DoubleConv-42          [-1, 512, 20, 20]               0
             Down-43          [-1, 512, 20, 20]               0
  ConvTranspose2d-44          [-1, 512, 40, 40]       1,049,088
           Conv2d-45          [-1, 256, 40, 40]       2,359,552
      BatchNorm2d-46          [-1, 256, 40, 40]             512
             ReLU-47          [-1, 256, 40, 40]               0
           Conv2d-48          [-1, 256, 40, 40]         590,080
      BatchNorm2d-49          [-1, 256, 40, 40]             512
             ReLU-50          [-1, 256, 40, 40]               0
       DoubleConv-51          [-1, 256, 40, 40]               0
               Up-52          [-1, 256, 40, 40]               0
  ConvTranspose2d-53          [-1, 256, 80, 80]         262,400
           Conv2d-54          [-1, 128, 80, 80]         589,952
      BatchNorm2d-55          [-1, 128, 80, 80]             256
             ReLU-56          [-1, 128, 80, 80]               0
           Conv2d-57          [-1, 128, 80, 80]         147,584
      BatchNorm2d-58          [-1, 128, 80, 80]             256
             ReLU-59          [-1, 128, 80, 80]               0
       DoubleConv-60          [-1, 128, 80, 80]               0
               Up-61          [-1, 128, 80, 80]               0
  ConvTranspose2d-62        [-1, 128, 160, 160]          65,664
           Conv2d-63         [-1, 64, 160, 160]         147,520
      BatchNorm2d-64         [-1, 64, 160, 160]             128
             ReLU-65         [-1, 64, 160, 160]               0
           Conv2d-66         [-1, 64, 160, 160]          36,928
      BatchNorm2d-67         [-1, 64, 160, 160]             128
             ReLU-68         [-1, 64, 160, 160]               0
       DoubleConv-69         [-1, 64, 160, 160]               0
               Up-70         [-1, 64, 160, 160]               0
  ConvTranspose2d-71         [-1, 64, 320, 320]          16,448
           Conv2d-72         [-1, 64, 320, 320]          73,792
      BatchNorm2d-73         [-1, 64, 320, 320]             128
             ReLU-74         [-1, 64, 320, 320]               0
           Conv2d-75         [-1, 64, 320, 320]          36,928
      BatchNorm2d-76         [-1, 64, 320, 320]             128
             ReLU-77         [-1, 64, 320, 320]               0
       DoubleConv-78         [-1, 64, 320, 320]               0
               Up-79         [-1, 64, 320, 320]               0
           Conv2d-80          [-1, 1, 320, 320]              65
           Conv2d-81          [-1, 1, 320, 320]              65
           Conv2d-82          [-1, 1, 320, 320]              65
           Conv2d-83          [-1, 1, 320, 320]              65
================================================================
Total params: 14,787,972
Trainable params: 14,787,972
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.39
Forward/backward pass size (MB): 1407.81
Params size (MB): 56.41
Estimated Total Size (MB): 1464.61
----------------------------------------------------------------
