cbr1_x.shape  torch.Size([2, 32, 400, 400])
mp1_x.shape  torch.Size([2, 32, 200, 200])
cbr2_x.shape  torch.Size([2, 32, 200, 200])
mp2_x.shape  torch.Size([2, 32, 100, 100])
cbr3_x.shape  torch.Size([2, 32, 100, 100])
resx.shape  torch.Size([2, 32, 100, 100])
rfbx.shape  torch.Size([2, 32, 100, 100])
attx.shape  torch.Size([2, 32, 100, 100])
up1x.shape  torch.Size([2, 32, 200, 200])
up2x.shape  torch.Size([2, 32, 400, 400])
x.shape  torch.Size([2, 32, 400, 400])
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 400, 400]             288
       BatchNorm2d-2         [-1, 32, 400, 400]              64
              ReLU-3         [-1, 32, 400, 400]               0
            Conv2d-4         [-1, 32, 400, 400]           9,216
       BatchNorm2d-5         [-1, 32, 400, 400]              64
              ReLU-6         [-1, 32, 400, 400]               0
            Conv2d-7         [-1, 32, 400, 400]           9,216
       BatchNorm2d-8         [-1, 32, 400, 400]              64
              ReLU-9         [-1, 32, 400, 400]               0
           Conv2d-10         [-1, 32, 400, 400]           9,216
      BatchNorm2d-11         [-1, 32, 400, 400]              64
             ReLU-12         [-1, 32, 400, 400]               0
        MaxPool2d-13         [-1, 32, 200, 200]               0
           Conv2d-14         [-1, 32, 200, 200]           9,216
      BatchNorm2d-15         [-1, 32, 200, 200]              64
             ReLU-16         [-1, 32, 200, 200]               0
           Conv2d-17         [-1, 32, 200, 200]           9,216
      BatchNorm2d-18         [-1, 32, 200, 200]              64
             ReLU-19         [-1, 32, 200, 200]               0
        MaxPool2d-20         [-1, 32, 100, 100]               0
           Conv2d-21         [-1, 32, 100, 100]           9,216
      BatchNorm2d-22         [-1, 32, 100, 100]              64
             ReLU-23         [-1, 32, 100, 100]               0
           Conv2d-24         [-1, 32, 100, 100]           9,216
      BatchNorm2d-25         [-1, 32, 100, 100]              64
             ReLU-26         [-1, 32, 100, 100]               0
           Conv2d-27         [-1, 32, 100, 100]           9,248
      BatchNorm2d-28         [-1, 32, 100, 100]              64
           Conv2d-29         [-1, 32, 100, 100]           9,248
      BatchNorm2d-30         [-1, 32, 100, 100]              64
    ResidualBlock-31         [-1, 32, 100, 100]               0
           Conv2d-32         [-1, 32, 100, 100]           9,248
      BatchNorm2d-33         [-1, 32, 100, 100]              64
           Conv2d-34         [-1, 32, 100, 100]           9,248
      BatchNorm2d-35         [-1, 32, 100, 100]              64
    ResidualBlock-36         [-1, 32, 100, 100]               0
           Conv2d-37         [-1, 32, 100, 100]           9,248
      BatchNorm2d-38         [-1, 32, 100, 100]              64
           Conv2d-39         [-1, 32, 100, 100]           9,248
      BatchNorm2d-40         [-1, 32, 100, 100]              64
    ResidualBlock-41         [-1, 32, 100, 100]               0
           Conv2d-42          [-1, 8, 100, 100]             256
      BatchNorm2d-43          [-1, 8, 100, 100]              16
             ReLU-44          [-1, 8, 100, 100]               0
        BasicConv-45          [-1, 8, 100, 100]               0
           Conv2d-46          [-1, 8, 100, 100]             576
      BatchNorm2d-47          [-1, 8, 100, 100]              16
        BasicConv-48          [-1, 8, 100, 100]               0
           Conv2d-49          [-1, 4, 100, 100]             128
      BatchNorm2d-50          [-1, 4, 100, 100]               8
             ReLU-51          [-1, 4, 100, 100]               0
        BasicConv-52          [-1, 4, 100, 100]               0
           Conv2d-53          [-1, 8, 100, 100]             288
      BatchNorm2d-54          [-1, 8, 100, 100]              16
             ReLU-55          [-1, 8, 100, 100]               0
        BasicConv-56          [-1, 8, 100, 100]               0
           Conv2d-57          [-1, 8, 100, 100]             576
      BatchNorm2d-58          [-1, 8, 100, 100]              16
        BasicConv-59          [-1, 8, 100, 100]               0
           Conv2d-60          [-1, 4, 100, 100]             128
      BatchNorm2d-61          [-1, 4, 100, 100]               8
             ReLU-62          [-1, 4, 100, 100]               0
        BasicConv-63          [-1, 4, 100, 100]               0
           Conv2d-64          [-1, 6, 100, 100]             216
      BatchNorm2d-65          [-1, 6, 100, 100]              12
             ReLU-66          [-1, 6, 100, 100]               0
        BasicConv-67          [-1, 6, 100, 100]               0
           Conv2d-68          [-1, 8, 100, 100]             432
      BatchNorm2d-69          [-1, 8, 100, 100]              16
             ReLU-70          [-1, 8, 100, 100]               0
        BasicConv-71          [-1, 8, 100, 100]               0
           Conv2d-72          [-1, 8, 100, 100]             576
      BatchNorm2d-73          [-1, 8, 100, 100]              16
        BasicConv-74          [-1, 8, 100, 100]               0
           Conv2d-75          [-1, 4, 100, 100]             128
      BatchNorm2d-76          [-1, 4, 100, 100]               8
             ReLU-77          [-1, 4, 100, 100]               0
        BasicConv-78          [-1, 4, 100, 100]               0
           Conv2d-79          [-1, 6, 100, 100]             168
      BatchNorm2d-80          [-1, 6, 100, 100]              12
             ReLU-81          [-1, 6, 100, 100]               0
        BasicConv-82          [-1, 6, 100, 100]               0
           Conv2d-83          [-1, 8, 100, 100]             336
      BatchNorm2d-84          [-1, 8, 100, 100]              16
             ReLU-85          [-1, 8, 100, 100]               0
        BasicConv-86          [-1, 8, 100, 100]               0
           Conv2d-87          [-1, 8, 100, 100]             576
      BatchNorm2d-88          [-1, 8, 100, 100]              16
        BasicConv-89          [-1, 8, 100, 100]               0
           Conv2d-90         [-1, 32, 100, 100]           1,024
      BatchNorm2d-91         [-1, 32, 100, 100]              64
        BasicConv-92         [-1, 32, 100, 100]               0
           Conv2d-93         [-1, 32, 100, 100]           1,024
      BatchNorm2d-94         [-1, 32, 100, 100]              64
        BasicConv-95         [-1, 32, 100, 100]               0
             ReLU-96         [-1, 32, 100, 100]               0
         BasicRFB-97         [-1, 32, 100, 100]               0
AdaptiveAvgPool2d-98           [-1, 32, 100, 1]               0
AdaptiveAvgPool2d-99           [-1, 32, 1, 100]               0
          Conv2d-100            [-1, 8, 200, 1]             264
     BatchNorm2d-101            [-1, 8, 200, 1]              16
           ReLU6-102            [-1, 8, 200, 1]               0
       h_sigmoid-103            [-1, 8, 200, 1]               0
         h_swish-104            [-1, 8, 200, 1]               0
          Conv2d-105           [-1, 32, 100, 1]             288
          Conv2d-106           [-1, 32, 1, 100]             288
        CoordAtt-107         [-1, 32, 100, 100]               0
AdaptiveAvgPool2d-108             [-1, 64, 1, 1]               0
          Conv1d-109                [-1, 1, 64]               3
         Sigmoid-110             [-1, 64, 1, 1]               0
       eca_block-111         [-1, 64, 100, 100]               0
          Conv2d-112        [-1, 128, 100, 100]          73,856
     BatchNorm2d-113        [-1, 128, 100, 100]             256
            ReLU-114        [-1, 128, 100, 100]               0
    PixelShuffle-115         [-1, 32, 200, 200]               0
DenseUpsamplingConvolution-116         [-1, 32, 200, 200]               0
          up_att-117         [-1, 32, 200, 200]               0
AdaptiveAvgPool2d-118             [-1, 64, 1, 1]               0
          Conv1d-119                [-1, 1, 64]               3
         Sigmoid-120             [-1, 64, 1, 1]               0
       eca_block-121         [-1, 64, 200, 200]               0
          Conv2d-122        [-1, 128, 200, 200]          73,856
     BatchNorm2d-123        [-1, 128, 200, 200]             256
            ReLU-124        [-1, 128, 200, 200]               0
    PixelShuffle-125         [-1, 32, 400, 400]               0
DenseUpsamplingConvolution-126         [-1, 32, 400, 400]               0
          up_att-127         [-1, 32, 400, 400]               0
          Conv2d-128          [-1, 1, 400, 400]             289
          Conv2d-129          [-1, 1, 400, 400]             289
          Conv2d-130          [-1, 1, 400, 400]             289
          Conv2d-131          [-1, 1, 400, 400]             289
================================================================
Total params: 278,162
Trainable params: 278,162
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.61
Forward/backward pass size (MB): 959.63
Params size (MB): 1.06
Estimated Total Size (MB): 961.31
----------------------------------------------------------------
