----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]             288
       BatchNorm2d-2         [-1, 32, 224, 224]              64
       ConvBNLayer-3         [-1, 32, 224, 224]               0
            Conv2d-4         [-1, 32, 224, 224]             288
       BatchNorm2d-5         [-1, 32, 224, 224]              64
       ConvBNLayer-6         [-1, 32, 224, 224]               0
 AdaptiveAvgPool2d-7           [-1, 32, 224, 1]               0
 AdaptiveAvgPool2d-8           [-1, 32, 1, 224]               0
            Conv2d-9            [-1, 8, 448, 1]             264
      BatchNorm2d-10            [-1, 8, 448, 1]              16
            ReLU6-11            [-1, 8, 448, 1]               0
        h_sigmoid-12            [-1, 8, 448, 1]               0
          h_swish-13            [-1, 8, 448, 1]               0
           Conv2d-14           [-1, 32, 224, 1]             288
           Conv2d-15           [-1, 32, 1, 224]             288
         CoordAtt-16         [-1, 32, 224, 224]               0
           Conv2d-17         [-1, 32, 224, 224]           1,024
      BatchNorm2d-18         [-1, 32, 224, 224]              64
      ConvBNLayer-19         [-1, 32, 224, 224]               0
DepthwiseSeparable-20         [-1, 32, 224, 224]               0
           Conv2d-21         [-1, 32, 112, 112]             288
      BatchNorm2d-22         [-1, 32, 112, 112]              64
      ConvBNLayer-23         [-1, 32, 112, 112]               0
AdaptiveAvgPool2d-24           [-1, 32, 112, 1]               0
AdaptiveAvgPool2d-25           [-1, 32, 1, 112]               0
           Conv2d-26            [-1, 8, 224, 1]             264
      BatchNorm2d-27            [-1, 8, 224, 1]              16
            ReLU6-28            [-1, 8, 224, 1]               0
        h_sigmoid-29            [-1, 8, 224, 1]               0
          h_swish-30            [-1, 8, 224, 1]               0
           Conv2d-31           [-1, 32, 112, 1]             288
           Conv2d-32           [-1, 32, 1, 112]             288
         CoordAtt-33         [-1, 32, 112, 112]               0
           Conv2d-34         [-1, 64, 112, 112]           2,048
      BatchNorm2d-35         [-1, 64, 112, 112]             128
      ConvBNLayer-36         [-1, 64, 112, 112]               0
DepthwiseSeparable-37         [-1, 64, 112, 112]               0
           Conv2d-38         [-1, 64, 112, 112]             576
      BatchNorm2d-39         [-1, 64, 112, 112]             128
      ConvBNLayer-40         [-1, 64, 112, 112]               0
AdaptiveAvgPool2d-41           [-1, 64, 112, 1]               0
AdaptiveAvgPool2d-42           [-1, 64, 1, 112]               0
           Conv2d-43            [-1, 8, 224, 1]             520
      BatchNorm2d-44            [-1, 8, 224, 1]              16
            ReLU6-45            [-1, 8, 224, 1]               0
        h_sigmoid-46            [-1, 8, 224, 1]               0
          h_swish-47            [-1, 8, 224, 1]               0
           Conv2d-48           [-1, 64, 112, 1]             576
           Conv2d-49           [-1, 64, 1, 112]             576
         CoordAtt-50         [-1, 64, 112, 112]               0
           Conv2d-51         [-1, 64, 112, 112]           4,096
      BatchNorm2d-52         [-1, 64, 112, 112]             128
      ConvBNLayer-53         [-1, 64, 112, 112]               0
DepthwiseSeparable-54         [-1, 64, 112, 112]               0
           Conv2d-55           [-1, 64, 56, 56]             576
      BatchNorm2d-56           [-1, 64, 56, 56]             128
      ConvBNLayer-57           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-58            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-59            [-1, 64, 1, 56]               0
           Conv2d-60            [-1, 8, 112, 1]             520
      BatchNorm2d-61            [-1, 8, 112, 1]              16
            ReLU6-62            [-1, 8, 112, 1]               0
        h_sigmoid-63            [-1, 8, 112, 1]               0
          h_swish-64            [-1, 8, 112, 1]               0
           Conv2d-65            [-1, 64, 56, 1]             576
           Conv2d-66            [-1, 64, 1, 56]             576
         CoordAtt-67           [-1, 64, 56, 56]               0
           Conv2d-68          [-1, 128, 56, 56]           8,192
      BatchNorm2d-69          [-1, 128, 56, 56]             256
      ConvBNLayer-70          [-1, 128, 56, 56]               0
DepthwiseSeparable-71          [-1, 128, 56, 56]               0
           Conv2d-72          [-1, 128, 56, 56]           1,152
      BatchNorm2d-73          [-1, 128, 56, 56]             256
      ConvBNLayer-74          [-1, 128, 56, 56]               0
AdaptiveAvgPool2d-75           [-1, 128, 56, 1]               0
AdaptiveAvgPool2d-76           [-1, 128, 1, 56]               0
           Conv2d-77            [-1, 8, 112, 1]           1,032
      BatchNorm2d-78            [-1, 8, 112, 1]              16
            ReLU6-79            [-1, 8, 112, 1]               0
        h_sigmoid-80            [-1, 8, 112, 1]               0
          h_swish-81            [-1, 8, 112, 1]               0
           Conv2d-82           [-1, 128, 56, 1]           1,152
           Conv2d-83           [-1, 128, 1, 56]           1,152
         CoordAtt-84          [-1, 128, 56, 56]               0
           Conv2d-85          [-1, 128, 56, 56]          16,384
      BatchNorm2d-86          [-1, 128, 56, 56]             256
      ConvBNLayer-87          [-1, 128, 56, 56]               0
DepthwiseSeparable-88          [-1, 128, 56, 56]               0
           Conv2d-89          [-1, 128, 28, 28]           1,152
      BatchNorm2d-90          [-1, 128, 28, 28]             256
      ConvBNLayer-91          [-1, 128, 28, 28]               0
AdaptiveAvgPool2d-92           [-1, 128, 28, 1]               0
AdaptiveAvgPool2d-93           [-1, 128, 1, 28]               0
           Conv2d-94             [-1, 8, 56, 1]           1,032
      BatchNorm2d-95             [-1, 8, 56, 1]              16
            ReLU6-96             [-1, 8, 56, 1]               0
        h_sigmoid-97             [-1, 8, 56, 1]               0
          h_swish-98             [-1, 8, 56, 1]               0
           Conv2d-99           [-1, 128, 28, 1]           1,152
          Conv2d-100           [-1, 128, 1, 28]           1,152
        CoordAtt-101          [-1, 128, 28, 28]               0
          Conv2d-102          [-1, 256, 28, 28]          32,768
     BatchNorm2d-103          [-1, 256, 28, 28]             512
     ConvBNLayer-104          [-1, 256, 28, 28]               0
DepthwiseSeparable-105          [-1, 256, 28, 28]               0
          Conv2d-106          [-1, 256, 28, 28]           6,400
     BatchNorm2d-107          [-1, 256, 28, 28]             512
     ConvBNLayer-108          [-1, 256, 28, 28]               0
AdaptiveAvgPool2d-109           [-1, 256, 28, 1]               0
AdaptiveAvgPool2d-110           [-1, 256, 1, 28]               0
          Conv2d-111             [-1, 8, 56, 1]           2,056
     BatchNorm2d-112             [-1, 8, 56, 1]              16
           ReLU6-113             [-1, 8, 56, 1]               0
       h_sigmoid-114             [-1, 8, 56, 1]               0
         h_swish-115             [-1, 8, 56, 1]               0
          Conv2d-116           [-1, 256, 28, 1]           2,304
          Conv2d-117           [-1, 256, 1, 28]           2,304
        CoordAtt-118          [-1, 256, 28, 28]               0
          Conv2d-119          [-1, 256, 28, 28]          65,536
     BatchNorm2d-120          [-1, 256, 28, 28]             512
     ConvBNLayer-121          [-1, 256, 28, 28]               0
DepthwiseSeparable-122          [-1, 256, 28, 28]               0
          Conv2d-123          [-1, 256, 28, 28]           6,400
     BatchNorm2d-124          [-1, 256, 28, 28]             512
     ConvBNLayer-125          [-1, 256, 28, 28]               0
AdaptiveAvgPool2d-126           [-1, 256, 28, 1]               0
AdaptiveAvgPool2d-127           [-1, 256, 1, 28]               0
          Conv2d-128             [-1, 8, 56, 1]           2,056
     BatchNorm2d-129             [-1, 8, 56, 1]              16
           ReLU6-130             [-1, 8, 56, 1]               0
       h_sigmoid-131             [-1, 8, 56, 1]               0
         h_swish-132             [-1, 8, 56, 1]               0
          Conv2d-133           [-1, 256, 28, 1]           2,304
          Conv2d-134           [-1, 256, 1, 28]           2,304
        CoordAtt-135          [-1, 256, 28, 28]               0
          Conv2d-136          [-1, 256, 28, 28]          65,536
     BatchNorm2d-137          [-1, 256, 28, 28]             512
     ConvBNLayer-138          [-1, 256, 28, 28]               0
DepthwiseSeparable-139          [-1, 256, 28, 28]               0
          Conv2d-140          [-1, 256, 28, 28]           6,400
     BatchNorm2d-141          [-1, 256, 28, 28]             512
     ConvBNLayer-142          [-1, 256, 28, 28]               0
AdaptiveAvgPool2d-143           [-1, 256, 28, 1]               0
AdaptiveAvgPool2d-144           [-1, 256, 1, 28]               0
          Conv2d-145             [-1, 8, 56, 1]           2,056
     BatchNorm2d-146             [-1, 8, 56, 1]              16
           ReLU6-147             [-1, 8, 56, 1]               0
       h_sigmoid-148             [-1, 8, 56, 1]               0
         h_swish-149             [-1, 8, 56, 1]               0
          Conv2d-150           [-1, 256, 28, 1]           2,304
          Conv2d-151           [-1, 256, 1, 28]           2,304
        CoordAtt-152          [-1, 256, 28, 28]               0
          Conv2d-153          [-1, 256, 28, 28]          65,536
     BatchNorm2d-154          [-1, 256, 28, 28]             512
     ConvBNLayer-155          [-1, 256, 28, 28]               0
DepthwiseSeparable-156          [-1, 256, 28, 28]               0
          Conv2d-157          [-1, 256, 28, 28]           6,400
     BatchNorm2d-158          [-1, 256, 28, 28]             512
     ConvBNLayer-159          [-1, 256, 28, 28]               0
AdaptiveAvgPool2d-160           [-1, 256, 28, 1]               0
AdaptiveAvgPool2d-161           [-1, 256, 1, 28]               0
          Conv2d-162             [-1, 8, 56, 1]           2,056
     BatchNorm2d-163             [-1, 8, 56, 1]              16
           ReLU6-164             [-1, 8, 56, 1]               0
       h_sigmoid-165             [-1, 8, 56, 1]               0
         h_swish-166             [-1, 8, 56, 1]               0
          Conv2d-167           [-1, 256, 28, 1]           2,304
          Conv2d-168           [-1, 256, 1, 28]           2,304
        CoordAtt-169          [-1, 256, 28, 28]               0
          Conv2d-170          [-1, 256, 28, 28]          65,536
     BatchNorm2d-171          [-1, 256, 28, 28]             512
     ConvBNLayer-172          [-1, 256, 28, 28]               0
DepthwiseSeparable-173          [-1, 256, 28, 28]               0
          Conv2d-174          [-1, 256, 28, 28]           6,400
     BatchNorm2d-175          [-1, 256, 28, 28]             512
     ConvBNLayer-176          [-1, 256, 28, 28]               0
AdaptiveAvgPool2d-177           [-1, 256, 28, 1]               0
AdaptiveAvgPool2d-178           [-1, 256, 1, 28]               0
          Conv2d-179             [-1, 8, 56, 1]           2,056
     BatchNorm2d-180             [-1, 8, 56, 1]              16
           ReLU6-181             [-1, 8, 56, 1]               0
       h_sigmoid-182             [-1, 8, 56, 1]               0
         h_swish-183             [-1, 8, 56, 1]               0
          Conv2d-184           [-1, 256, 28, 1]           2,304
          Conv2d-185           [-1, 256, 1, 28]           2,304
        CoordAtt-186          [-1, 256, 28, 28]               0
          Conv2d-187          [-1, 256, 28, 28]          65,536
     BatchNorm2d-188          [-1, 256, 28, 28]             512
     ConvBNLayer-189          [-1, 256, 28, 28]               0
DepthwiseSeparable-190          [-1, 256, 28, 28]               0
          Conv2d-191           [-1, 64, 28, 28]          32,768
     BatchNorm2d-192           [-1, 64, 28, 28]             128
     ConvBNLayer-193           [-1, 64, 28, 28]               0
          Conv2d-194           [-1, 64, 28, 28]          32,768
     BatchNorm2d-195           [-1, 64, 28, 28]             128
     ConvBNLayer-196           [-1, 64, 28, 28]               0
          Conv2d-197           [-1, 64, 28, 28]           4,096
     BatchNorm2d-198           [-1, 64, 28, 28]             128
     ConvBNLayer-199           [-1, 64, 28, 28]               0
          Conv2d-200           [-1, 64, 28, 28]          36,864
     BatchNorm2d-201           [-1, 64, 28, 28]             128
     ConvBNLayer-202           [-1, 64, 28, 28]               0
DarknetBottleneck-203           [-1, 64, 28, 28]               0
          Conv2d-204          [-1, 128, 28, 28]          16,384
     BatchNorm2d-205          [-1, 128, 28, 28]             256
     ConvBNLayer-206          [-1, 128, 28, 28]               0
        CSPLayer-207          [-1, 128, 28, 28]               0
 ConvTranspose2d-208          [-1, 128, 56, 56]         262,272
              up-209          [-1, 128, 56, 56]               0
          Conv2d-210           [-1, 32, 56, 56]           8,192
     BatchNorm2d-211           [-1, 32, 56, 56]              64
     ConvBNLayer-212           [-1, 32, 56, 56]               0
          Conv2d-213           [-1, 32, 56, 56]           8,192
     BatchNorm2d-214           [-1, 32, 56, 56]              64
     ConvBNLayer-215           [-1, 32, 56, 56]               0
          Conv2d-216           [-1, 32, 56, 56]           1,024
     BatchNorm2d-217           [-1, 32, 56, 56]              64
     ConvBNLayer-218           [-1, 32, 56, 56]               0
          Conv2d-219           [-1, 32, 56, 56]           9,216
     BatchNorm2d-220           [-1, 32, 56, 56]              64
     ConvBNLayer-221           [-1, 32, 56, 56]               0
DarknetBottleneck-222           [-1, 32, 56, 56]               0
          Conv2d-223           [-1, 64, 56, 56]           4,096
     BatchNorm2d-224           [-1, 64, 56, 56]             128
     ConvBNLayer-225           [-1, 64, 56, 56]               0
        CSPLayer-226           [-1, 64, 56, 56]               0
 ConvTranspose2d-227         [-1, 64, 112, 112]          65,600
              up-228         [-1, 64, 112, 112]               0
          Conv2d-229         [-1, 16, 112, 112]           2,048
     BatchNorm2d-230         [-1, 16, 112, 112]              32
     ConvBNLayer-231         [-1, 16, 112, 112]               0
          Conv2d-232         [-1, 16, 112, 112]           2,048
     BatchNorm2d-233         [-1, 16, 112, 112]              32
     ConvBNLayer-234         [-1, 16, 112, 112]               0
          Conv2d-235         [-1, 16, 112, 112]             256
     BatchNorm2d-236         [-1, 16, 112, 112]              32
     ConvBNLayer-237         [-1, 16, 112, 112]               0
          Conv2d-238         [-1, 16, 112, 112]           2,304
     BatchNorm2d-239         [-1, 16, 112, 112]              32
     ConvBNLayer-240         [-1, 16, 112, 112]               0
DarknetBottleneck-241         [-1, 16, 112, 112]               0
          Conv2d-242         [-1, 32, 112, 112]           1,024
     BatchNorm2d-243         [-1, 32, 112, 112]              64
     ConvBNLayer-244         [-1, 32, 112, 112]               0
        CSPLayer-245         [-1, 32, 112, 112]               0
 ConvTranspose2d-246         [-1, 32, 224, 224]          16,416
              up-247         [-1, 32, 224, 224]               0
         Dropout-248         [-1, 32, 224, 224]               0
          Conv2d-249          [-1, 1, 224, 224]              33
         Dropout-250         [-1, 32, 224, 224]               0
          Conv2d-251          [-1, 1, 224, 224]              33
         Dropout-252         [-1, 32, 224, 224]               0
          Conv2d-253          [-1, 1, 224, 224]              33
         Dropout-254         [-1, 32, 224, 224]               0
          Conv2d-255          [-1, 1, 224, 224]              33
================================================================
Total params: 988,172
Trainable params: 988,172
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 486.01
Params size (MB): 3.77
Estimated Total Size (MB): 489.98
----------------------------------------------------------------
