----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 1, 224, 224]               9
       BatchNorm2d-2          [-1, 1, 224, 224]               2
              ReLU-3          [-1, 1, 224, 224]               0
            Conv2d-4         [-1, 32, 224, 224]              32
       BatchNorm2d-5         [-1, 32, 224, 224]              64
         Hardswish-6         [-1, 32, 224, 224]               0
            Conv2d-7         [-1, 32, 224, 224]             288
       BatchNorm2d-8         [-1, 32, 224, 224]              64
         Hardswish-9         [-1, 32, 224, 224]               0
      ConvBNLayer-10         [-1, 32, 224, 224]               0
           Conv2d-11         [-1, 32, 224, 224]           1,024
      BatchNorm2d-12         [-1, 32, 224, 224]              64
        Hardswish-13         [-1, 32, 224, 224]               0
      ConvBNLayer-14         [-1, 32, 224, 224]               0
DepthwiseSeparable-15         [-1, 32, 224, 224]               0
           Conv2d-16         [-1, 32, 224, 224]             288
      BatchNorm2d-17         [-1, 32, 224, 224]              64
        Hardswish-18         [-1, 32, 224, 224]               0
      ConvBNLayer-19         [-1, 32, 224, 224]               0
           Conv2d-20         [-1, 32, 224, 224]           1,024
      BatchNorm2d-21         [-1, 32, 224, 224]              64
        Hardswish-22         [-1, 32, 224, 224]               0
      ConvBNLayer-23         [-1, 32, 224, 224]               0
DepthwiseSeparable-24         [-1, 32, 224, 224]               0
           Conv2d-25         [-1, 32, 112, 112]             288
      BatchNorm2d-26         [-1, 32, 112, 112]              64
        Hardswish-27         [-1, 32, 112, 112]               0
      ConvBNLayer-28         [-1, 32, 112, 112]               0
           Conv2d-29         [-1, 64, 112, 112]           2,048
      BatchNorm2d-30         [-1, 64, 112, 112]             128
        Hardswish-31         [-1, 64, 112, 112]               0
      ConvBNLayer-32         [-1, 64, 112, 112]               0
DepthwiseSeparable-33         [-1, 64, 112, 112]               0
             down-34         [-1, 64, 112, 112]               0
           Conv2d-35         [-1, 64, 112, 112]             576
      BatchNorm2d-36         [-1, 64, 112, 112]             128
        Hardswish-37         [-1, 64, 112, 112]               0
      ConvBNLayer-38         [-1, 64, 112, 112]               0
           Conv2d-39         [-1, 64, 112, 112]           4,096
      BatchNorm2d-40         [-1, 64, 112, 112]             128
        Hardswish-41         [-1, 64, 112, 112]               0
      ConvBNLayer-42         [-1, 64, 112, 112]               0
DepthwiseSeparable-43         [-1, 64, 112, 112]               0
           Conv2d-44           [-1, 64, 56, 56]             576
      BatchNorm2d-45           [-1, 64, 56, 56]             128
        Hardswish-46           [-1, 64, 56, 56]               0
      ConvBNLayer-47           [-1, 64, 56, 56]               0
           Conv2d-48          [-1, 128, 56, 56]           8,192
      BatchNorm2d-49          [-1, 128, 56, 56]             256
        Hardswish-50          [-1, 128, 56, 56]               0
      ConvBNLayer-51          [-1, 128, 56, 56]               0
DepthwiseSeparable-52          [-1, 128, 56, 56]               0
             down-53          [-1, 128, 56, 56]               0
           Conv2d-54          [-1, 128, 56, 56]           1,152
      BatchNorm2d-55          [-1, 128, 56, 56]             256
        Hardswish-56          [-1, 128, 56, 56]               0
      ConvBNLayer-57          [-1, 128, 56, 56]               0
           Conv2d-58          [-1, 128, 56, 56]          16,384
      BatchNorm2d-59          [-1, 128, 56, 56]             256
        Hardswish-60          [-1, 128, 56, 56]               0
      ConvBNLayer-61          [-1, 128, 56, 56]               0
DepthwiseSeparable-62          [-1, 128, 56, 56]               0
           Conv2d-63          [-1, 128, 56, 56]           1,152
      BatchNorm2d-64          [-1, 128, 56, 56]             256
        Hardswish-65          [-1, 128, 56, 56]               0
      ConvBNLayer-66          [-1, 128, 56, 56]               0
           Conv2d-67          [-1, 128, 56, 56]          16,384
      BatchNorm2d-68          [-1, 128, 56, 56]             256
        Hardswish-69          [-1, 128, 56, 56]               0
      ConvBNLayer-70          [-1, 128, 56, 56]               0
DepthwiseSeparable-71          [-1, 128, 56, 56]               0
           Conv2d-72          [-1, 128, 56, 56]           1,152
      BatchNorm2d-73          [-1, 128, 56, 56]             256
        Hardswish-74          [-1, 128, 56, 56]               0
      ConvBNLayer-75          [-1, 128, 56, 56]               0
           Conv2d-76          [-1, 128, 56, 56]          16,384
      BatchNorm2d-77          [-1, 128, 56, 56]             256
        Hardswish-78          [-1, 128, 56, 56]               0
      ConvBNLayer-79          [-1, 128, 56, 56]               0
DepthwiseSeparable-80          [-1, 128, 56, 56]               0
           Conv2d-81          [-1, 128, 56, 56]           1,152
      BatchNorm2d-82          [-1, 128, 56, 56]             256
        Hardswish-83          [-1, 128, 56, 56]               0
      ConvBNLayer-84          [-1, 128, 56, 56]               0
           Conv2d-85          [-1, 128, 56, 56]          16,384
      BatchNorm2d-86          [-1, 128, 56, 56]             256
        Hardswish-87          [-1, 128, 56, 56]               0
      ConvBNLayer-88          [-1, 128, 56, 56]               0
DepthwiseSeparable-89          [-1, 128, 56, 56]               0
           Conv2d-90          [-1, 128, 56, 56]           1,152
      BatchNorm2d-91          [-1, 128, 56, 56]             256
        Hardswish-92          [-1, 128, 56, 56]               0
      ConvBNLayer-93          [-1, 128, 56, 56]               0
           Conv2d-94          [-1, 128, 56, 56]          16,384
      BatchNorm2d-95          [-1, 128, 56, 56]             256
        Hardswish-96          [-1, 128, 56, 56]               0
      ConvBNLayer-97          [-1, 128, 56, 56]               0
DepthwiseSeparable-98          [-1, 128, 56, 56]               0
           Conv2d-99           [-1, 64, 56, 56]           8,192
     BatchNorm2d-100           [-1, 64, 56, 56]             128
     ConvBNLayer-101           [-1, 64, 56, 56]               0
          Conv2d-102           [-1, 64, 56, 56]           8,192
     BatchNorm2d-103           [-1, 64, 56, 56]             128
     ConvBNLayer-104           [-1, 64, 56, 56]               0
          Conv2d-105           [-1, 64, 56, 56]           4,096
     BatchNorm2d-106           [-1, 64, 56, 56]             128
     ConvBNLayer-107           [-1, 64, 56, 56]               0
          Conv2d-108           [-1, 64, 56, 56]          36,864
     BatchNorm2d-109           [-1, 64, 56, 56]             128
     ConvBNLayer-110           [-1, 64, 56, 56]               0
DarknetBottleneck-111           [-1, 64, 56, 56]               0
          Conv2d-112          [-1, 128, 56, 56]          16,384
     BatchNorm2d-113          [-1, 128, 56, 56]             256
     ConvBNLayer-114          [-1, 128, 56, 56]               0
        CSPLayer-115          [-1, 128, 56, 56]               0
          Conv2d-116           [-1, 32, 56, 56]           8,192
     BatchNorm2d-117           [-1, 32, 56, 56]              64
     ConvBNLayer-118           [-1, 32, 56, 56]               0
          Conv2d-119           [-1, 32, 56, 56]           8,192
     BatchNorm2d-120           [-1, 32, 56, 56]              64
     ConvBNLayer-121           [-1, 32, 56, 56]               0
          Conv2d-122           [-1, 32, 56, 56]           1,024
     BatchNorm2d-123           [-1, 32, 56, 56]              64
     ConvBNLayer-124           [-1, 32, 56, 56]               0
          Conv2d-125           [-1, 32, 56, 56]           9,216
     BatchNorm2d-126           [-1, 32, 56, 56]              64
     ConvBNLayer-127           [-1, 32, 56, 56]               0
DarknetBottleneck-128           [-1, 32, 56, 56]               0
          Conv2d-129           [-1, 64, 56, 56]           4,096
     BatchNorm2d-130           [-1, 64, 56, 56]             128
     ConvBNLayer-131           [-1, 64, 56, 56]               0
        CSPLayer-132           [-1, 64, 56, 56]               0
        Upsample-133         [-1, 64, 112, 112]               0
              up-134         [-1, 64, 112, 112]               0
          Conv2d-135         [-1, 16, 112, 112]           2,048
     BatchNorm2d-136         [-1, 16, 112, 112]              32
     ConvBNLayer-137         [-1, 16, 112, 112]               0
          Conv2d-138         [-1, 16, 112, 112]           2,048
     BatchNorm2d-139         [-1, 16, 112, 112]              32
     ConvBNLayer-140         [-1, 16, 112, 112]               0
          Conv2d-141         [-1, 16, 112, 112]             256
     BatchNorm2d-142         [-1, 16, 112, 112]              32
     ConvBNLayer-143         [-1, 16, 112, 112]               0
          Conv2d-144         [-1, 16, 112, 112]           2,304
     BatchNorm2d-145         [-1, 16, 112, 112]              32
     ConvBNLayer-146         [-1, 16, 112, 112]               0
DarknetBottleneck-147         [-1, 16, 112, 112]               0
          Conv2d-148         [-1, 32, 112, 112]           1,024
     BatchNorm2d-149         [-1, 32, 112, 112]              64
     ConvBNLayer-150         [-1, 32, 112, 112]               0
        CSPLayer-151         [-1, 32, 112, 112]               0
        Upsample-152         [-1, 32, 224, 224]               0
              up-153         [-1, 32, 224, 224]               0
          Conv2d-154         [-1, 32, 224, 224]           1,024
     BatchNorm2d-155         [-1, 32, 224, 224]              64
            ReLU-156         [-1, 32, 224, 224]               0
          Conv2d-157          [-1, 1, 224, 224]              33
          Conv2d-158          [-1, 1, 224, 224]              33
          Conv2d-159          [-1, 1, 224, 224]              33
          Conv2d-160          [-1, 1, 224, 224]              33
================================================================
Total params: 224,527
Trainable params: 224,527
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 680.26
Params size (MB): 0.86
Estimated Total Size (MB): 681.31
----------------------------------------------------------------
