----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 320, 320]             320
       BatchNorm2d-2         [-1, 32, 320, 320]              64
              ReLU-3         [-1, 32, 320, 320]               0
            Conv2d-4         [-1, 64, 160, 160]          18,496
       BatchNorm2d-5         [-1, 64, 160, 160]             128
              ReLU-6         [-1, 64, 160, 160]               0
 AdaptiveAvgPool2d-7             [-1, 64, 1, 1]               0
            Conv1d-8                [-1, 1, 64]               3
           Sigmoid-9             [-1, 64, 1, 1]               0
        eca_block-10         [-1, 64, 160, 160]               0
           inconv-11         [-1, 64, 160, 160]               0
        MaxPool2d-12           [-1, 64, 80, 80]               0
           Conv2d-13          [-1, 128, 80, 80]          73,856
      BatchNorm2d-14          [-1, 128, 80, 80]             256
             ReLU-15          [-1, 128, 80, 80]               0
AdaptiveAvgPool2d-16            [-1, 128, 1, 1]               0
           Conv1d-17               [-1, 1, 128]               3
          Sigmoid-18            [-1, 128, 1, 1]               0
        eca_block-19          [-1, 128, 80, 80]               0
           Conv2d-20          [-1, 128, 80, 80]           8,192
      BatchNorm2d-21          [-1, 128, 80, 80]             256
         conv_att-22          [-1, 128, 80, 80]               0
             down-23          [-1, 128, 80, 80]               0
        MaxPool2d-24          [-1, 128, 40, 40]               0
           Conv2d-25          [-1, 256, 40, 40]         295,168
      BatchNorm2d-26          [-1, 256, 40, 40]             512
             ReLU-27          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-28            [-1, 256, 1, 1]               0
           Conv1d-29               [-1, 1, 256]               5
          Sigmoid-30            [-1, 256, 1, 1]               0
        eca_block-31          [-1, 256, 40, 40]               0
           Conv2d-32          [-1, 256, 40, 40]          32,768
      BatchNorm2d-33          [-1, 256, 40, 40]             512
         conv_att-34          [-1, 256, 40, 40]               0
             down-35          [-1, 256, 40, 40]               0
        MaxPool2d-36          [-1, 256, 20, 20]               0
           Conv2d-37          [-1, 512, 20, 20]       1,180,160
      BatchNorm2d-38          [-1, 512, 20, 20]           1,024
             ReLU-39          [-1, 512, 20, 20]               0
AdaptiveAvgPool2d-40            [-1, 512, 1, 1]               0
           Conv1d-41               [-1, 1, 512]               5
          Sigmoid-42            [-1, 512, 1, 1]               0
        eca_block-43          [-1, 512, 20, 20]               0
           Conv2d-44          [-1, 512, 20, 20]         131,072
      BatchNorm2d-45          [-1, 512, 20, 20]           1,024
         conv_att-46          [-1, 512, 20, 20]               0
             down-47          [-1, 512, 20, 20]               0
        MaxPool2d-48          [-1, 512, 10, 10]               0
           Conv2d-49          [-1, 512, 10, 10]       2,359,808
      BatchNorm2d-50          [-1, 512, 10, 10]           1,024
             ReLU-51          [-1, 512, 10, 10]               0
AdaptiveAvgPool2d-52            [-1, 512, 1, 1]               0
           Conv1d-53               [-1, 1, 512]               5
          Sigmoid-54            [-1, 512, 1, 1]               0
        eca_block-55          [-1, 512, 10, 10]               0
         conv_att-56          [-1, 512, 10, 10]               0
             down-57          [-1, 512, 10, 10]               0
  ConvTranspose2d-58          [-1, 512, 20, 20]       1,049,088
           Conv2d-59          [-1, 256, 20, 20]       2,359,552
      BatchNorm2d-60          [-1, 256, 20, 20]             512
             ReLU-61          [-1, 256, 20, 20]               0
AdaptiveAvgPool2d-62            [-1, 256, 1, 1]               0
           Conv1d-63               [-1, 1, 256]               5
          Sigmoid-64            [-1, 256, 1, 1]               0
        eca_block-65          [-1, 256, 20, 20]               0
           Conv2d-66          [-1, 256, 20, 20]         262,144
      BatchNorm2d-67          [-1, 256, 20, 20]             512
         conv_att-68          [-1, 256, 20, 20]               0
               up-69          [-1, 256, 20, 20]               0
  ConvTranspose2d-70          [-1, 256, 40, 40]         262,400
           Conv2d-71          [-1, 128, 40, 40]         589,952
      BatchNorm2d-72          [-1, 128, 40, 40]             256
             ReLU-73          [-1, 128, 40, 40]               0
AdaptiveAvgPool2d-74            [-1, 128, 1, 1]               0
           Conv1d-75               [-1, 1, 128]               5
          Sigmoid-76            [-1, 128, 1, 1]               0
        eca_block-77          [-1, 128, 40, 40]               0
           Conv2d-78          [-1, 128, 40, 40]          65,536
      BatchNorm2d-79          [-1, 128, 40, 40]             256
         conv_att-80          [-1, 128, 40, 40]               0
               up-81          [-1, 128, 40, 40]               0
  ConvTranspose2d-82          [-1, 128, 80, 80]          65,664
           Conv2d-83           [-1, 64, 80, 80]         147,520
      BatchNorm2d-84           [-1, 64, 80, 80]             128
             ReLU-85           [-1, 64, 80, 80]               0
AdaptiveAvgPool2d-86             [-1, 64, 1, 1]               0
           Conv1d-87                [-1, 1, 64]               5
          Sigmoid-88             [-1, 64, 1, 1]               0
        eca_block-89           [-1, 64, 80, 80]               0
           Conv2d-90           [-1, 64, 80, 80]          16,384
      BatchNorm2d-91           [-1, 64, 80, 80]             128
         conv_att-92           [-1, 64, 80, 80]               0
               up-93           [-1, 64, 80, 80]               0
  ConvTranspose2d-94         [-1, 64, 160, 160]          16,448
           Conv2d-95         [-1, 64, 160, 160]          73,792
      BatchNorm2d-96         [-1, 64, 160, 160]             128
             ReLU-97         [-1, 64, 160, 160]               0
AdaptiveAvgPool2d-98             [-1, 64, 1, 1]               0
           Conv1d-99                [-1, 1, 64]               5
         Sigmoid-100             [-1, 64, 1, 1]               0
       eca_block-101         [-1, 64, 160, 160]               0
          Conv2d-102         [-1, 64, 160, 160]           8,192
     BatchNorm2d-103         [-1, 64, 160, 160]             128
        conv_att-104         [-1, 64, 160, 160]               0
              up-105         [-1, 64, 160, 160]               0
 ConvTranspose2d-106         [-1, 32, 320, 320]           8,224
     BatchNorm2d-107         [-1, 32, 320, 320]              64
            ReLU-108         [-1, 32, 320, 320]               0
        up_final-109         [-1, 32, 320, 320]               0
         Dropout-110         [-1, 32, 320, 320]               0
          Conv2d-111          [-1, 1, 320, 320]              33
         Dropout-112         [-1, 32, 320, 320]               0
          Conv2d-113          [-1, 1, 320, 320]              33
         Dropout-114         [-1, 32, 320, 320]               0
          Conv2d-115          [-1, 1, 320, 320]              33
         Dropout-116         [-1, 32, 320, 320]               0
          Conv2d-117          [-1, 1, 320, 320]              33
================================================================
Total params: 9,031,821
Trainable params: 9,031,821
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.39
Forward/backward pass size (MB): 603.56
Params size (MB): 34.45
Estimated Total Size (MB): 638.41
----------------------------------------------------------------
