----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]             320
       BatchNorm2d-2         [-1, 32, 224, 224]              64
              Mish-3         [-1, 32, 224, 224]               0
            Conv2d-4         [-1, 64, 112, 112]          18,496
       BatchNorm2d-5         [-1, 64, 112, 112]             128
              Mish-6         [-1, 64, 112, 112]               0
            inconv-7         [-1, 64, 112, 112]               0
            Conv2d-8         [-1, 64, 112, 112]             576
       BatchNorm2d-9         [-1, 64, 112, 112]             128
        Hardswish-10         [-1, 64, 112, 112]               0
      ConvBNLayer-11         [-1, 64, 112, 112]               0
           Conv2d-12         [-1, 64, 112, 112]           4,096
      BatchNorm2d-13         [-1, 64, 112, 112]             128
        Hardswish-14         [-1, 64, 112, 112]               0
      ConvBNLayer-15         [-1, 64, 112, 112]               0
DepthwiseSeparable-16         [-1, 64, 112, 112]               0
           Conv2d-17           [-1, 64, 56, 56]             576
      BatchNorm2d-18           [-1, 64, 56, 56]             128
        Hardswish-19           [-1, 64, 56, 56]               0
      ConvBNLayer-20           [-1, 64, 56, 56]               0
           Conv2d-21          [-1, 128, 56, 56]           8,192
      BatchNorm2d-22          [-1, 128, 56, 56]             256
        Hardswish-23          [-1, 128, 56, 56]               0
      ConvBNLayer-24          [-1, 128, 56, 56]               0
DepthwiseSeparable-25          [-1, 128, 56, 56]               0
     dsc_conv_att-26          [-1, 128, 56, 56]               0
             down-27          [-1, 128, 56, 56]               0
           Conv2d-28          [-1, 128, 56, 56]           1,152
      BatchNorm2d-29          [-1, 128, 56, 56]             256
        Hardswish-30          [-1, 128, 56, 56]               0
      ConvBNLayer-31          [-1, 128, 56, 56]               0
           Conv2d-32          [-1, 128, 56, 56]          16,384
      BatchNorm2d-33          [-1, 128, 56, 56]             256
        Hardswish-34          [-1, 128, 56, 56]               0
      ConvBNLayer-35          [-1, 128, 56, 56]               0
DepthwiseSeparable-36          [-1, 128, 56, 56]               0
           Conv2d-37          [-1, 128, 28, 28]           1,152
      BatchNorm2d-38          [-1, 128, 28, 28]             256
        Hardswish-39          [-1, 128, 28, 28]               0
      ConvBNLayer-40          [-1, 128, 28, 28]               0
           Conv2d-41          [-1, 256, 28, 28]          32,768
      BatchNorm2d-42          [-1, 256, 28, 28]             512
        Hardswish-43          [-1, 256, 28, 28]               0
      ConvBNLayer-44          [-1, 256, 28, 28]               0
DepthwiseSeparable-45          [-1, 256, 28, 28]               0
     dsc_conv_att-46          [-1, 256, 28, 28]               0
             down-47          [-1, 256, 28, 28]               0
           Conv2d-48          [-1, 256, 28, 28]           2,304
      BatchNorm2d-49          [-1, 256, 28, 28]             512
        Hardswish-50          [-1, 256, 28, 28]               0
      ConvBNLayer-51          [-1, 256, 28, 28]               0
           Conv2d-52          [-1, 256, 28, 28]          65,536
      BatchNorm2d-53          [-1, 256, 28, 28]             512
        Hardswish-54          [-1, 256, 28, 28]               0
      ConvBNLayer-55          [-1, 256, 28, 28]               0
DepthwiseSeparable-56          [-1, 256, 28, 28]               0
           Conv2d-57          [-1, 256, 14, 14]           2,304
      BatchNorm2d-58          [-1, 256, 14, 14]             512
        Hardswish-59          [-1, 256, 14, 14]               0
      ConvBNLayer-60          [-1, 256, 14, 14]               0
           Conv2d-61          [-1, 512, 14, 14]         131,072
      BatchNorm2d-62          [-1, 512, 14, 14]           1,024
        Hardswish-63          [-1, 512, 14, 14]               0
      ConvBNLayer-64          [-1, 512, 14, 14]               0
DepthwiseSeparable-65          [-1, 512, 14, 14]               0
     dsc_conv_att-66          [-1, 512, 14, 14]               0
             down-67          [-1, 512, 14, 14]               0
           Conv2d-68          [-1, 512, 14, 14]           4,608
      BatchNorm2d-69          [-1, 512, 14, 14]           1,024
        Hardswish-70          [-1, 512, 14, 14]               0
      ConvBNLayer-71          [-1, 512, 14, 14]               0
           Conv2d-72          [-1, 512, 14, 14]         262,144
      BatchNorm2d-73          [-1, 512, 14, 14]           1,024
        Hardswish-74          [-1, 512, 14, 14]               0
      ConvBNLayer-75          [-1, 512, 14, 14]               0
DepthwiseSeparable-76          [-1, 512, 14, 14]               0
           Conv2d-77            [-1, 512, 7, 7]           4,608
      BatchNorm2d-78            [-1, 512, 7, 7]           1,024
        Hardswish-79            [-1, 512, 7, 7]               0
      ConvBNLayer-80            [-1, 512, 7, 7]               0
           Conv2d-81            [-1, 512, 7, 7]         262,144
      BatchNorm2d-82            [-1, 512, 7, 7]           1,024
        Hardswish-83            [-1, 512, 7, 7]               0
      ConvBNLayer-84            [-1, 512, 7, 7]               0
DepthwiseSeparable-85            [-1, 512, 7, 7]               0
     dsc_conv_att-86            [-1, 512, 7, 7]               0
             down-87            [-1, 512, 7, 7]               0
         Upsample-88          [-1, 512, 14, 14]               0
           Conv2d-89         [-1, 1024, 14, 14]           9,216
      BatchNorm2d-90         [-1, 1024, 14, 14]           2,048
        Hardswish-91         [-1, 1024, 14, 14]               0
      ConvBNLayer-92         [-1, 1024, 14, 14]               0
           Conv2d-93         [-1, 1024, 14, 14]       1,048,576
      BatchNorm2d-94         [-1, 1024, 14, 14]           2,048
        Hardswish-95         [-1, 1024, 14, 14]               0
      ConvBNLayer-96         [-1, 1024, 14, 14]               0
DepthwiseSeparable-97         [-1, 1024, 14, 14]               0
           Conv2d-98         [-1, 1024, 14, 14]           9,216
      BatchNorm2d-99         [-1, 1024, 14, 14]           2,048
       Hardswish-100         [-1, 1024, 14, 14]               0
     ConvBNLayer-101         [-1, 1024, 14, 14]               0
          Conv2d-102          [-1, 256, 14, 14]         262,144
     BatchNorm2d-103          [-1, 256, 14, 14]             512
       Hardswish-104          [-1, 256, 14, 14]               0
     ConvBNLayer-105          [-1, 256, 14, 14]               0
DepthwiseSeparable-106          [-1, 256, 14, 14]               0
    dsc_conv_att-107          [-1, 256, 14, 14]               0
              up-108          [-1, 256, 14, 14]               0
        Upsample-109          [-1, 256, 28, 28]               0
          Conv2d-110          [-1, 512, 28, 28]           4,608
     BatchNorm2d-111          [-1, 512, 28, 28]           1,024
       Hardswish-112          [-1, 512, 28, 28]               0
     ConvBNLayer-113          [-1, 512, 28, 28]               0
          Conv2d-114          [-1, 512, 28, 28]         262,144
     BatchNorm2d-115          [-1, 512, 28, 28]           1,024
       Hardswish-116          [-1, 512, 28, 28]               0
     ConvBNLayer-117          [-1, 512, 28, 28]               0
DepthwiseSeparable-118          [-1, 512, 28, 28]               0
          Conv2d-119          [-1, 512, 28, 28]           4,608
     BatchNorm2d-120          [-1, 512, 28, 28]           1,024
       Hardswish-121          [-1, 512, 28, 28]               0
     ConvBNLayer-122          [-1, 512, 28, 28]               0
          Conv2d-123          [-1, 128, 28, 28]          65,536
     BatchNorm2d-124          [-1, 128, 28, 28]             256
       Hardswish-125          [-1, 128, 28, 28]               0
     ConvBNLayer-126          [-1, 128, 28, 28]               0
DepthwiseSeparable-127          [-1, 128, 28, 28]               0
    dsc_conv_att-128          [-1, 128, 28, 28]               0
              up-129          [-1, 128, 28, 28]               0
        Upsample-130          [-1, 128, 56, 56]               0
          Conv2d-131          [-1, 256, 56, 56]           2,304
     BatchNorm2d-132          [-1, 256, 56, 56]             512
       Hardswish-133          [-1, 256, 56, 56]               0
     ConvBNLayer-134          [-1, 256, 56, 56]               0
          Conv2d-135          [-1, 256, 56, 56]          65,536
     BatchNorm2d-136          [-1, 256, 56, 56]             512
       Hardswish-137          [-1, 256, 56, 56]               0
     ConvBNLayer-138          [-1, 256, 56, 56]               0
DepthwiseSeparable-139          [-1, 256, 56, 56]               0
          Conv2d-140          [-1, 256, 56, 56]           2,304
     BatchNorm2d-141          [-1, 256, 56, 56]             512
       Hardswish-142          [-1, 256, 56, 56]               0
     ConvBNLayer-143          [-1, 256, 56, 56]               0
          Conv2d-144           [-1, 64, 56, 56]          16,384
     BatchNorm2d-145           [-1, 64, 56, 56]             128
       Hardswish-146           [-1, 64, 56, 56]               0
     ConvBNLayer-147           [-1, 64, 56, 56]               0
DepthwiseSeparable-148           [-1, 64, 56, 56]               0
    dsc_conv_att-149           [-1, 64, 56, 56]               0
              up-150           [-1, 64, 56, 56]               0
        Upsample-151         [-1, 64, 112, 112]               0
          Conv2d-152        [-1, 128, 112, 112]           1,152
     BatchNorm2d-153        [-1, 128, 112, 112]             256
       Hardswish-154        [-1, 128, 112, 112]               0
     ConvBNLayer-155        [-1, 128, 112, 112]               0
          Conv2d-156        [-1, 128, 112, 112]          16,384
     BatchNorm2d-157        [-1, 128, 112, 112]             256
       Hardswish-158        [-1, 128, 112, 112]               0
     ConvBNLayer-159        [-1, 128, 112, 112]               0
DepthwiseSeparable-160        [-1, 128, 112, 112]               0
          Conv2d-161        [-1, 128, 112, 112]           1,152
     BatchNorm2d-162        [-1, 128, 112, 112]             256
       Hardswish-163        [-1, 128, 112, 112]               0
     ConvBNLayer-164        [-1, 128, 112, 112]               0
          Conv2d-165         [-1, 64, 112, 112]           8,192
     BatchNorm2d-166         [-1, 64, 112, 112]             128
       Hardswish-167         [-1, 64, 112, 112]               0
     ConvBNLayer-168         [-1, 64, 112, 112]               0
DepthwiseSeparable-169         [-1, 64, 112, 112]               0
    dsc_conv_att-170         [-1, 64, 112, 112]               0
              up-171         [-1, 64, 112, 112]               0
 ConvTranspose2d-172         [-1, 32, 224, 224]           8,224
     BatchNorm2d-173         [-1, 32, 224, 224]              64
            ReLU-174         [-1, 32, 224, 224]               0
        up_final-175         [-1, 32, 224, 224]               0
          Conv2d-176          [-1, 1, 224, 224]              33
          Conv2d-177          [-1, 1, 224, 224]              33
          Conv2d-178          [-1, 1, 224, 224]              33
          Conv2d-179          [-1, 1, 224, 224]              33
================================================================
Total params: 2,627,620
Trainable params: 2,627,620
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 637.19
Params size (MB): 10.02
Estimated Total Size (MB): 647.41
----------------------------------------------------------------
