x_in shapetorch.Size([2, 4, 224, 224])
x shapetorch.Size([2, 32, 218, 218])
x shapetorch.Size([2, 64, 109, 109])
x2 shapetorch.Size([2, 128, 54, 54])
x3 shapetorch.Size([2, 256, 27, 27])
x4 shapetorch.Size([2, 512, 13, 13])
x5 shapetorch.Size([2, 512, 6, 6])
x44 shapetorch.Size([2, 256, 13, 13])
x33 shapetorch.Size([2, 128, 27, 27])
x22 shapetorch.Size([2, 64, 54, 54])
x11 shapetorch.Size([2, 64, 109, 109])
x shapetorch.Size([2, 32, 224, 224])
width_output shapetorch.Size([2, 1, 224, 224])
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 218, 218]          10,400
       BatchNorm2d-2         [-1, 32, 218, 218]              64
            Conv2d-3         [-1, 64, 109, 109]          18,496
       BatchNorm2d-4         [-1, 64, 109, 109]             128
         MaxPool2d-5           [-1, 64, 54, 54]               0
            Conv2d-6          [-1, 128, 54, 54]          73,856
       BatchNorm2d-7          [-1, 128, 54, 54]             256
              ReLU-8          [-1, 128, 54, 54]               0
 AdaptiveAvgPool2d-9            [-1, 128, 1, 1]               0
           Conv1d-10               [-1, 1, 128]               5
          Sigmoid-11            [-1, 128, 1, 1]               0
        eca_block-12          [-1, 128, 54, 54]               0
           Conv2d-13          [-1, 128, 54, 54]           8,192
      BatchNorm2d-14          [-1, 128, 54, 54]             256
      double_conv-15          [-1, 128, 54, 54]               0
             down-16          [-1, 128, 54, 54]               0
        MaxPool2d-17          [-1, 128, 27, 27]               0
           Conv2d-18          [-1, 256, 27, 27]         295,168
      BatchNorm2d-19          [-1, 256, 27, 27]             512
             ReLU-20          [-1, 256, 27, 27]               0
AdaptiveAvgPool2d-21            [-1, 256, 1, 1]               0
           Conv1d-22               [-1, 1, 256]               5
          Sigmoid-23            [-1, 256, 1, 1]               0
        eca_block-24          [-1, 256, 27, 27]               0
           Conv2d-25          [-1, 256, 27, 27]          32,768
      BatchNorm2d-26          [-1, 256, 27, 27]             512
      double_conv-27          [-1, 256, 27, 27]               0
             down-28          [-1, 256, 27, 27]               0
        MaxPool2d-29          [-1, 256, 13, 13]               0
           Conv2d-30          [-1, 512, 13, 13]       1,180,160
      BatchNorm2d-31          [-1, 512, 13, 13]           1,024
             ReLU-32          [-1, 512, 13, 13]               0
AdaptiveAvgPool2d-33            [-1, 512, 1, 1]               0
           Conv1d-34               [-1, 1, 512]               5
          Sigmoid-35            [-1, 512, 1, 1]               0
        eca_block-36          [-1, 512, 13, 13]               0
           Conv2d-37          [-1, 512, 13, 13]         131,072
      BatchNorm2d-38          [-1, 512, 13, 13]           1,024
      double_conv-39          [-1, 512, 13, 13]               0
             down-40          [-1, 512, 13, 13]               0
        MaxPool2d-41            [-1, 512, 6, 6]               0
           Conv2d-42            [-1, 512, 6, 6]       2,359,808
      BatchNorm2d-43            [-1, 512, 6, 6]           1,024
             ReLU-44            [-1, 512, 6, 6]               0
AdaptiveAvgPool2d-45            [-1, 512, 1, 1]               0
           Conv1d-46               [-1, 1, 512]               5
          Sigmoid-47            [-1, 512, 1, 1]               0
        eca_block-48            [-1, 512, 6, 6]               0
      double_conv-49            [-1, 512, 6, 6]               0
             down-50            [-1, 512, 6, 6]               0
  ConvTranspose2d-51          [-1, 512, 12, 12]       1,049,088
           Conv2d-52          [-1, 256, 13, 13]       2,359,552
      BatchNorm2d-53          [-1, 256, 13, 13]             512
             ReLU-54          [-1, 256, 13, 13]               0
AdaptiveAvgPool2d-55            [-1, 256, 1, 1]               0
           Conv1d-56               [-1, 1, 256]               5
          Sigmoid-57            [-1, 256, 1, 1]               0
        eca_block-58          [-1, 256, 13, 13]               0
           Conv2d-59          [-1, 256, 13, 13]         262,144
      BatchNorm2d-60          [-1, 256, 13, 13]             512
      double_conv-61          [-1, 256, 13, 13]               0
               up-62          [-1, 256, 13, 13]               0
  ConvTranspose2d-63          [-1, 256, 26, 26]         262,400
           Conv2d-64          [-1, 128, 27, 27]         589,952
      BatchNorm2d-65          [-1, 128, 27, 27]             256
             ReLU-66          [-1, 128, 27, 27]               0
AdaptiveAvgPool2d-67            [-1, 128, 1, 1]               0
           Conv1d-68               [-1, 1, 128]               5
          Sigmoid-69            [-1, 128, 1, 1]               0
        eca_block-70          [-1, 128, 27, 27]               0
           Conv2d-71          [-1, 128, 27, 27]          65,536
      BatchNorm2d-72          [-1, 128, 27, 27]             256
      double_conv-73          [-1, 128, 27, 27]               0
               up-74          [-1, 128, 27, 27]               0
  ConvTranspose2d-75          [-1, 128, 54, 54]          65,664
           Conv2d-76           [-1, 64, 54, 54]         147,520
      BatchNorm2d-77           [-1, 64, 54, 54]             128
             ReLU-78           [-1, 64, 54, 54]               0
AdaptiveAvgPool2d-79             [-1, 64, 1, 1]               0
           Conv1d-80                [-1, 1, 64]               3
          Sigmoid-81             [-1, 64, 1, 1]               0
        eca_block-82           [-1, 64, 54, 54]               0
           Conv2d-83           [-1, 64, 54, 54]          16,384
      BatchNorm2d-84           [-1, 64, 54, 54]             128
      double_conv-85           [-1, 64, 54, 54]               0
               up-86           [-1, 64, 54, 54]               0
  ConvTranspose2d-87         [-1, 64, 108, 108]          16,448
           Conv2d-88         [-1, 64, 109, 109]          73,792
      BatchNorm2d-89         [-1, 64, 109, 109]             128
             ReLU-90         [-1, 64, 109, 109]               0
AdaptiveAvgPool2d-91             [-1, 64, 1, 1]               0
           Conv1d-92                [-1, 1, 64]               3
          Sigmoid-93             [-1, 64, 1, 1]               0
        eca_block-94         [-1, 64, 109, 109]               0
           Conv2d-95         [-1, 64, 109, 109]           8,192
      BatchNorm2d-96         [-1, 64, 109, 109]             128
      double_conv-97         [-1, 64, 109, 109]               0
               up-98         [-1, 64, 109, 109]               0
         Upsample-99         [-1, 64, 218, 218]               0
 ConvTranspose2d-100         [-1, 32, 224, 224]         165,920
     BatchNorm2d-101         [-1, 32, 224, 224]              64
         Dropout-102         [-1, 32, 224, 224]               0
          Conv2d-103          [-1, 1, 224, 224]              33
         Dropout-104         [-1, 32, 224, 224]               0
          Conv2d-105          [-1, 1, 224, 224]              33
         Dropout-106         [-1, 32, 224, 224]               0
          Conv2d-107          [-1, 1, 224, 224]              33
         Dropout-108         [-1, 32, 224, 224]               0
          Conv2d-109          [-1, 1, 224, 224]              33
================================================================
Total params: 9,199,592
Trainable params: 9,199,592
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 252.55
Params size (MB): 35.09
Estimated Total Size (MB): 288.41
----------------------------------------------------------------
