----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]             288
       BatchNorm2d-2         [-1, 32, 224, 224]              64
         Hardswish-3         [-1, 32, 224, 224]               0
            Conv2d-4         [-1, 32, 224, 224]             288
       BatchNorm2d-5         [-1, 32, 224, 224]              64
         Hardswish-6         [-1, 32, 224, 224]               0
       ConvBNLayer-7         [-1, 32, 224, 224]               0
            Conv2d-8         [-1, 32, 224, 224]           1,024
       BatchNorm2d-9         [-1, 32, 224, 224]              64
        Hardswish-10         [-1, 32, 224, 224]               0
      ConvBNLayer-11         [-1, 32, 224, 224]               0
DepthwiseSeparable-12         [-1, 32, 224, 224]               0
           Conv2d-13         [-1, 32, 112, 112]             288
      BatchNorm2d-14         [-1, 32, 112, 112]              64
        Hardswish-15         [-1, 32, 112, 112]               0
      ConvBNLayer-16         [-1, 32, 112, 112]               0
           Conv2d-17         [-1, 64, 112, 112]           2,048
      BatchNorm2d-18         [-1, 64, 112, 112]             128
        Hardswish-19         [-1, 64, 112, 112]               0
      ConvBNLayer-20         [-1, 64, 112, 112]               0
DepthwiseSeparable-21         [-1, 64, 112, 112]               0
           Conv2d-22         [-1, 64, 112, 112]             576
      BatchNorm2d-23         [-1, 64, 112, 112]             128
        Hardswish-24         [-1, 64, 112, 112]               0
      ConvBNLayer-25         [-1, 64, 112, 112]               0
           Conv2d-26         [-1, 64, 112, 112]           4,096
      BatchNorm2d-27         [-1, 64, 112, 112]             128
        Hardswish-28         [-1, 64, 112, 112]               0
      ConvBNLayer-29         [-1, 64, 112, 112]               0
DepthwiseSeparable-30         [-1, 64, 112, 112]               0
           Conv2d-31           [-1, 64, 56, 56]             576
      BatchNorm2d-32           [-1, 64, 56, 56]             128
        Hardswish-33           [-1, 64, 56, 56]               0
      ConvBNLayer-34           [-1, 64, 56, 56]               0
           Conv2d-35          [-1, 128, 56, 56]           8,192
      BatchNorm2d-36          [-1, 128, 56, 56]             256
        Hardswish-37          [-1, 128, 56, 56]               0
      ConvBNLayer-38          [-1, 128, 56, 56]               0
DepthwiseSeparable-39          [-1, 128, 56, 56]               0
           Conv2d-40          [-1, 128, 56, 56]           1,152
      BatchNorm2d-41          [-1, 128, 56, 56]             256
        Hardswish-42          [-1, 128, 56, 56]               0
      ConvBNLayer-43          [-1, 128, 56, 56]               0
           Conv2d-44          [-1, 128, 56, 56]          16,384
      BatchNorm2d-45          [-1, 128, 56, 56]             256
        Hardswish-46          [-1, 128, 56, 56]               0
      ConvBNLayer-47          [-1, 128, 56, 56]               0
DepthwiseSeparable-48          [-1, 128, 56, 56]               0
           Conv2d-49          [-1, 128, 28, 28]           1,152
      BatchNorm2d-50          [-1, 128, 28, 28]             256
        Hardswish-51          [-1, 128, 28, 28]               0
      ConvBNLayer-52          [-1, 128, 28, 28]               0
           Conv2d-53          [-1, 256, 28, 28]          32,768
      BatchNorm2d-54          [-1, 256, 28, 28]             512
        Hardswish-55          [-1, 256, 28, 28]               0
      ConvBNLayer-56          [-1, 256, 28, 28]               0
DepthwiseSeparable-57          [-1, 256, 28, 28]               0
           Conv2d-58          [-1, 256, 28, 28]           6,400
      BatchNorm2d-59          [-1, 256, 28, 28]             512
        Hardswish-60          [-1, 256, 28, 28]               0
      ConvBNLayer-61          [-1, 256, 28, 28]               0
           Conv2d-62          [-1, 256, 28, 28]          65,536
      BatchNorm2d-63          [-1, 256, 28, 28]             512
        Hardswish-64          [-1, 256, 28, 28]               0
      ConvBNLayer-65          [-1, 256, 28, 28]               0
DepthwiseSeparable-66          [-1, 256, 28, 28]               0
           Conv2d-67          [-1, 256, 28, 28]           6,400
      BatchNorm2d-68          [-1, 256, 28, 28]             512
        Hardswish-69          [-1, 256, 28, 28]               0
      ConvBNLayer-70          [-1, 256, 28, 28]               0
           Conv2d-71          [-1, 256, 28, 28]          65,536
      BatchNorm2d-72          [-1, 256, 28, 28]             512
        Hardswish-73          [-1, 256, 28, 28]               0
      ConvBNLayer-74          [-1, 256, 28, 28]               0
DepthwiseSeparable-75          [-1, 256, 28, 28]               0
           Conv2d-76          [-1, 256, 28, 28]           6,400
      BatchNorm2d-77          [-1, 256, 28, 28]             512
        Hardswish-78          [-1, 256, 28, 28]               0
      ConvBNLayer-79          [-1, 256, 28, 28]               0
           Conv2d-80          [-1, 256, 28, 28]          65,536
      BatchNorm2d-81          [-1, 256, 28, 28]             512
        Hardswish-82          [-1, 256, 28, 28]               0
      ConvBNLayer-83          [-1, 256, 28, 28]               0
DepthwiseSeparable-84          [-1, 256, 28, 28]               0
           Conv2d-85          [-1, 256, 28, 28]           6,400
      BatchNorm2d-86          [-1, 256, 28, 28]             512
        Hardswish-87          [-1, 256, 28, 28]               0
      ConvBNLayer-88          [-1, 256, 28, 28]               0
AdaptiveAvgPool2d-89            [-1, 256, 1, 1]               0
           Conv2d-90             [-1, 64, 1, 1]          16,448
             ReLU-91             [-1, 64, 1, 1]               0
           Conv2d-92            [-1, 256, 1, 1]          16,640
      Hardsigmoid-93            [-1, 256, 1, 1]               0
         SEModule-94          [-1, 256, 28, 28]               0
           Conv2d-95          [-1, 256, 28, 28]          65,536
      BatchNorm2d-96          [-1, 256, 28, 28]             512
        Hardswish-97          [-1, 256, 28, 28]               0
      ConvBNLayer-98          [-1, 256, 28, 28]               0
DepthwiseSeparable-99          [-1, 256, 28, 28]               0
          Conv2d-100          [-1, 256, 28, 28]           6,400
     BatchNorm2d-101          [-1, 256, 28, 28]             512
       Hardswish-102          [-1, 256, 28, 28]               0
     ConvBNLayer-103          [-1, 256, 28, 28]               0
AdaptiveAvgPool2d-104            [-1, 256, 1, 1]               0
          Conv2d-105             [-1, 64, 1, 1]          16,448
            ReLU-106             [-1, 64, 1, 1]               0
          Conv2d-107            [-1, 256, 1, 1]          16,640
     Hardsigmoid-108            [-1, 256, 1, 1]               0
        SEModule-109          [-1, 256, 28, 28]               0
          Conv2d-110          [-1, 256, 28, 28]          65,536
     BatchNorm2d-111          [-1, 256, 28, 28]             512
       Hardswish-112          [-1, 256, 28, 28]               0
     ConvBNLayer-113          [-1, 256, 28, 28]               0
DepthwiseSeparable-114          [-1, 256, 28, 28]               0
          Conv2d-115           [-1, 64, 28, 28]          32,768
     BatchNorm2d-116           [-1, 64, 28, 28]             128
     ConvBNLayer-117           [-1, 64, 28, 28]               0
          Conv2d-118           [-1, 64, 28, 28]          32,768
     BatchNorm2d-119           [-1, 64, 28, 28]             128
     ConvBNLayer-120           [-1, 64, 28, 28]               0
          Conv2d-121           [-1, 64, 28, 28]           4,096
     BatchNorm2d-122           [-1, 64, 28, 28]             128
     ConvBNLayer-123           [-1, 64, 28, 28]               0
          Conv2d-124           [-1, 64, 28, 28]          36,864
     BatchNorm2d-125           [-1, 64, 28, 28]             128
     ConvBNLayer-126           [-1, 64, 28, 28]               0
DarknetBottleneck-127           [-1, 64, 28, 28]               0
          Conv2d-128          [-1, 128, 28, 28]          16,384
     BatchNorm2d-129          [-1, 128, 28, 28]             256
     ConvBNLayer-130          [-1, 128, 28, 28]               0
        CSPLayer-131          [-1, 128, 28, 28]               0
        Upsample-132          [-1, 128, 56, 56]               0
              up-133          [-1, 128, 56, 56]               0
          Conv2d-134           [-1, 32, 56, 56]           8,192
     BatchNorm2d-135           [-1, 32, 56, 56]              64
     ConvBNLayer-136           [-1, 32, 56, 56]               0
          Conv2d-137           [-1, 32, 56, 56]           8,192
     BatchNorm2d-138           [-1, 32, 56, 56]              64
     ConvBNLayer-139           [-1, 32, 56, 56]               0
          Conv2d-140           [-1, 32, 56, 56]           1,024
     BatchNorm2d-141           [-1, 32, 56, 56]              64
     ConvBNLayer-142           [-1, 32, 56, 56]               0
          Conv2d-143           [-1, 32, 56, 56]           9,216
     BatchNorm2d-144           [-1, 32, 56, 56]              64
     ConvBNLayer-145           [-1, 32, 56, 56]               0
DarknetBottleneck-146           [-1, 32, 56, 56]               0
          Conv2d-147           [-1, 64, 56, 56]           4,096
     BatchNorm2d-148           [-1, 64, 56, 56]             128
     ConvBNLayer-149           [-1, 64, 56, 56]               0
        CSPLayer-150           [-1, 64, 56, 56]               0
        Upsample-151         [-1, 64, 112, 112]               0
              up-152         [-1, 64, 112, 112]               0
          Conv2d-153         [-1, 16, 112, 112]           2,048
     BatchNorm2d-154         [-1, 16, 112, 112]              32
     ConvBNLayer-155         [-1, 16, 112, 112]               0
          Conv2d-156         [-1, 16, 112, 112]           2,048
     BatchNorm2d-157         [-1, 16, 112, 112]              32
     ConvBNLayer-158         [-1, 16, 112, 112]               0
          Conv2d-159         [-1, 16, 112, 112]             256
     BatchNorm2d-160         [-1, 16, 112, 112]              32
     ConvBNLayer-161         [-1, 16, 112, 112]               0
          Conv2d-162         [-1, 16, 112, 112]           2,304
     BatchNorm2d-163         [-1, 16, 112, 112]              32
     ConvBNLayer-164         [-1, 16, 112, 112]               0
DarknetBottleneck-165         [-1, 16, 112, 112]               0
          Conv2d-166         [-1, 32, 112, 112]           1,024
     BatchNorm2d-167         [-1, 32, 112, 112]              64
     ConvBNLayer-168         [-1, 32, 112, 112]               0
        CSPLayer-169         [-1, 32, 112, 112]               0
        Upsample-170         [-1, 32, 224, 224]               0
              up-171         [-1, 32, 224, 224]               0
          Conv2d-172         [-1, 32, 224, 224]           1,024
     BatchNorm2d-173         [-1, 32, 224, 224]              64
            ReLU-174         [-1, 32, 224, 224]               0
          Conv2d-175          [-1, 1, 224, 224]              33
          Conv2d-176          [-1, 1, 224, 224]              33
          Conv2d-177          [-1, 1, 224, 224]              33
          Conv2d-178          [-1, 1, 224, 224]              33
================================================================
Total params: 665,956
Trainable params: 665,956
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 514.13
Params size (MB): 2.54
Estimated Total Size (MB): 516.86
----------------------------------------------------------------
