----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 320, 320]             288
       BatchNorm2d-2         [-1, 32, 320, 320]              64
       ConvBNLayer-3         [-1, 32, 320, 320]               0
            Conv2d-4         [-1, 32, 320, 320]             288
       BatchNorm2d-5         [-1, 32, 320, 320]              64
       ConvBNLayer-6         [-1, 32, 320, 320]               0
 AdaptiveAvgPool2d-7             [-1, 32, 1, 1]               0
            Conv2d-8              [-1, 8, 1, 1]             256
            Conv2d-9             [-1, 32, 1, 1]             256
         SEModule-10         [-1, 32, 320, 320]               0
           Conv2d-11         [-1, 32, 320, 320]           1,024
      BatchNorm2d-12         [-1, 32, 320, 320]              64
      ConvBNLayer-13         [-1, 32, 320, 320]               0
DepthwiseSeparable-14         [-1, 32, 320, 320]               0
           Conv2d-15         [-1, 32, 160, 160]             288
      BatchNorm2d-16         [-1, 32, 160, 160]              64
      ConvBNLayer-17         [-1, 32, 160, 160]               0
AdaptiveAvgPool2d-18             [-1, 32, 1, 1]               0
           Conv2d-19              [-1, 8, 1, 1]             256
           Conv2d-20             [-1, 32, 1, 1]             256
         SEModule-21         [-1, 32, 160, 160]               0
           Conv2d-22         [-1, 64, 160, 160]           2,048
      BatchNorm2d-23         [-1, 64, 160, 160]             128
      ConvBNLayer-24         [-1, 64, 160, 160]               0
DepthwiseSeparable-25         [-1, 64, 160, 160]               0
           Conv2d-26         [-1, 64, 160, 160]             576
      BatchNorm2d-27         [-1, 64, 160, 160]             128
      ConvBNLayer-28         [-1, 64, 160, 160]               0
AdaptiveAvgPool2d-29             [-1, 64, 1, 1]               0
           Conv2d-30             [-1, 16, 1, 1]           1,024
           Conv2d-31             [-1, 64, 1, 1]           1,024
         SEModule-32         [-1, 64, 160, 160]               0
           Conv2d-33         [-1, 64, 160, 160]           4,096
      BatchNorm2d-34         [-1, 64, 160, 160]             128
      ConvBNLayer-35         [-1, 64, 160, 160]               0
DepthwiseSeparable-36         [-1, 64, 160, 160]               0
           Conv2d-37           [-1, 64, 80, 80]             576
      BatchNorm2d-38           [-1, 64, 80, 80]             128
      ConvBNLayer-39           [-1, 64, 80, 80]               0
AdaptiveAvgPool2d-40             [-1, 64, 1, 1]               0
           Conv2d-41             [-1, 16, 1, 1]           1,024
           Conv2d-42             [-1, 64, 1, 1]           1,024
         SEModule-43           [-1, 64, 80, 80]               0
           Conv2d-44          [-1, 128, 80, 80]           8,192
      BatchNorm2d-45          [-1, 128, 80, 80]             256
      ConvBNLayer-46          [-1, 128, 80, 80]               0
DepthwiseSeparable-47          [-1, 128, 80, 80]               0
           Conv2d-48          [-1, 128, 80, 80]           1,152
      BatchNorm2d-49          [-1, 128, 80, 80]             256
      ConvBNLayer-50          [-1, 128, 80, 80]               0
AdaptiveAvgPool2d-51            [-1, 128, 1, 1]               0
           Conv2d-52             [-1, 32, 1, 1]           4,096
           Conv2d-53            [-1, 128, 1, 1]           4,096
         SEModule-54          [-1, 128, 80, 80]               0
           Conv2d-55          [-1, 128, 80, 80]          16,384
      BatchNorm2d-56          [-1, 128, 80, 80]             256
      ConvBNLayer-57          [-1, 128, 80, 80]               0
DepthwiseSeparable-58          [-1, 128, 80, 80]               0
           Conv2d-59          [-1, 128, 40, 40]           1,152
      BatchNorm2d-60          [-1, 128, 40, 40]             256
      ConvBNLayer-61          [-1, 128, 40, 40]               0
AdaptiveAvgPool2d-62            [-1, 128, 1, 1]               0
           Conv2d-63             [-1, 32, 1, 1]           4,096
           Conv2d-64            [-1, 128, 1, 1]           4,096
         SEModule-65          [-1, 128, 40, 40]               0
           Conv2d-66          [-1, 256, 40, 40]          32,768
      BatchNorm2d-67          [-1, 256, 40, 40]             512
      ConvBNLayer-68          [-1, 256, 40, 40]               0
DepthwiseSeparable-69          [-1, 256, 40, 40]               0
           Conv2d-70          [-1, 256, 40, 40]           6,400
      BatchNorm2d-71          [-1, 256, 40, 40]             512
      ConvBNLayer-72          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-73            [-1, 256, 1, 1]               0
           Conv2d-74             [-1, 64, 1, 1]          16,384
           Conv2d-75            [-1, 256, 1, 1]          16,384
         SEModule-76          [-1, 256, 40, 40]               0
           Conv2d-77          [-1, 256, 40, 40]          65,536
      BatchNorm2d-78          [-1, 256, 40, 40]             512
      ConvBNLayer-79          [-1, 256, 40, 40]               0
DepthwiseSeparable-80          [-1, 256, 40, 40]               0
           Conv2d-81          [-1, 256, 40, 40]           6,400
      BatchNorm2d-82          [-1, 256, 40, 40]             512
      ConvBNLayer-83          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-84            [-1, 256, 1, 1]               0
           Conv2d-85             [-1, 64, 1, 1]          16,384
           Conv2d-86            [-1, 256, 1, 1]          16,384
         SEModule-87          [-1, 256, 40, 40]               0
           Conv2d-88          [-1, 256, 40, 40]          65,536
      BatchNorm2d-89          [-1, 256, 40, 40]             512
      ConvBNLayer-90          [-1, 256, 40, 40]               0
DepthwiseSeparable-91          [-1, 256, 40, 40]               0
           Conv2d-92          [-1, 256, 40, 40]           6,400
      BatchNorm2d-93          [-1, 256, 40, 40]             512
      ConvBNLayer-94          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-95            [-1, 256, 1, 1]               0
           Conv2d-96             [-1, 64, 1, 1]          16,384
           Conv2d-97            [-1, 256, 1, 1]          16,384
         SEModule-98          [-1, 256, 40, 40]               0
           Conv2d-99          [-1, 256, 40, 40]          65,536
     BatchNorm2d-100          [-1, 256, 40, 40]             512
     ConvBNLayer-101          [-1, 256, 40, 40]               0
DepthwiseSeparable-102          [-1, 256, 40, 40]               0
          Conv2d-103          [-1, 256, 40, 40]           6,400
     BatchNorm2d-104          [-1, 256, 40, 40]             512
     ConvBNLayer-105          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-106            [-1, 256, 1, 1]               0
          Conv2d-107             [-1, 64, 1, 1]          16,384
          Conv2d-108            [-1, 256, 1, 1]          16,384
        SEModule-109          [-1, 256, 40, 40]               0
          Conv2d-110          [-1, 256, 40, 40]          65,536
     BatchNorm2d-111          [-1, 256, 40, 40]             512
     ConvBNLayer-112          [-1, 256, 40, 40]               0
DepthwiseSeparable-113          [-1, 256, 40, 40]               0
          Conv2d-114          [-1, 256, 40, 40]           6,400
     BatchNorm2d-115          [-1, 256, 40, 40]             512
     ConvBNLayer-116          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-117            [-1, 256, 1, 1]               0
          Conv2d-118             [-1, 64, 1, 1]          16,384
          Conv2d-119            [-1, 256, 1, 1]          16,384
        SEModule-120          [-1, 256, 40, 40]               0
          Conv2d-121          [-1, 256, 40, 40]          65,536
     BatchNorm2d-122          [-1, 256, 40, 40]             512
     ConvBNLayer-123          [-1, 256, 40, 40]               0
DepthwiseSeparable-124          [-1, 256, 40, 40]               0
          Conv2d-125           [-1, 64, 40, 40]          16,384
     BatchNorm2d-126           [-1, 64, 40, 40]             128
            ReLU-127           [-1, 64, 40, 40]               0
       BasicConv-128           [-1, 64, 40, 40]               0
          Conv2d-129           [-1, 64, 40, 40]          36,864
     BatchNorm2d-130           [-1, 64, 40, 40]             128
       BasicConv-131           [-1, 64, 40, 40]               0
          Conv2d-132           [-1, 32, 40, 40]           8,192
     BatchNorm2d-133           [-1, 32, 40, 40]              64
            ReLU-134           [-1, 32, 40, 40]               0
       BasicConv-135           [-1, 32, 40, 40]               0
          Conv2d-136           [-1, 64, 40, 40]          18,432
     BatchNorm2d-137           [-1, 64, 40, 40]             128
            ReLU-138           [-1, 64, 40, 40]               0
       BasicConv-139           [-1, 64, 40, 40]               0
          Conv2d-140           [-1, 64, 40, 40]          36,864
     BatchNorm2d-141           [-1, 64, 40, 40]             128
       BasicConv-142           [-1, 64, 40, 40]               0
          Conv2d-143           [-1, 32, 40, 40]           8,192
     BatchNorm2d-144           [-1, 32, 40, 40]              64
            ReLU-145           [-1, 32, 40, 40]               0
       BasicConv-146           [-1, 32, 40, 40]               0
          Conv2d-147           [-1, 48, 40, 40]          13,824
     BatchNorm2d-148           [-1, 48, 40, 40]              96
            ReLU-149           [-1, 48, 40, 40]               0
       BasicConv-150           [-1, 48, 40, 40]               0
          Conv2d-151           [-1, 64, 40, 40]          27,648
     BatchNorm2d-152           [-1, 64, 40, 40]             128
            ReLU-153           [-1, 64, 40, 40]               0
       BasicConv-154           [-1, 64, 40, 40]               0
          Conv2d-155           [-1, 64, 40, 40]          36,864
     BatchNorm2d-156           [-1, 64, 40, 40]             128
       BasicConv-157           [-1, 64, 40, 40]               0
          Conv2d-158           [-1, 32, 40, 40]           8,192
     BatchNorm2d-159           [-1, 32, 40, 40]              64
            ReLU-160           [-1, 32, 40, 40]               0
       BasicConv-161           [-1, 32, 40, 40]               0
          Conv2d-162           [-1, 48, 40, 40]          10,752
     BatchNorm2d-163           [-1, 48, 40, 40]              96
            ReLU-164           [-1, 48, 40, 40]               0
       BasicConv-165           [-1, 48, 40, 40]               0
          Conv2d-166           [-1, 64, 40, 40]          21,504
     BatchNorm2d-167           [-1, 64, 40, 40]             128
            ReLU-168           [-1, 64, 40, 40]               0
       BasicConv-169           [-1, 64, 40, 40]               0
          Conv2d-170           [-1, 64, 40, 40]          36,864
     BatchNorm2d-171           [-1, 64, 40, 40]             128
       BasicConv-172           [-1, 64, 40, 40]               0
          Conv2d-173          [-1, 256, 40, 40]          65,536
     BatchNorm2d-174          [-1, 256, 40, 40]             512
       BasicConv-175          [-1, 256, 40, 40]               0
          Conv2d-176          [-1, 256, 40, 40]          65,536
     BatchNorm2d-177          [-1, 256, 40, 40]             512
       BasicConv-178          [-1, 256, 40, 40]               0
            ReLU-179          [-1, 256, 40, 40]               0
        BasicRFB-180          [-1, 256, 40, 40]               0
          Conv2d-181           [-1, 64, 40, 40]          32,768
     BatchNorm2d-182           [-1, 64, 40, 40]             128
     ConvBNLayer-183           [-1, 64, 40, 40]               0
          Conv2d-184           [-1, 64, 40, 40]          32,768
     BatchNorm2d-185           [-1, 64, 40, 40]             128
     ConvBNLayer-186           [-1, 64, 40, 40]               0
          Conv2d-187           [-1, 64, 40, 40]           4,096
     BatchNorm2d-188           [-1, 64, 40, 40]             128
     ConvBNLayer-189           [-1, 64, 40, 40]               0
          Conv2d-190           [-1, 64, 40, 40]          36,864
     BatchNorm2d-191           [-1, 64, 40, 40]             128
     ConvBNLayer-192           [-1, 64, 40, 40]               0
DarknetBottleneck-193           [-1, 64, 40, 40]               0
          Conv2d-194          [-1, 128, 40, 40]          16,384
     BatchNorm2d-195          [-1, 128, 40, 40]             256
     ConvBNLayer-196          [-1, 128, 40, 40]               0
        CSPLayer-197          [-1, 128, 40, 40]               0
        Upsample-198          [-1, 128, 80, 80]               0
              up-199          [-1, 128, 80, 80]               0
          Conv2d-200           [-1, 32, 80, 80]           4,096
     BatchNorm2d-201           [-1, 32, 80, 80]              64
            ReLU-202           [-1, 32, 80, 80]               0
       BasicConv-203           [-1, 32, 80, 80]               0
          Conv2d-204           [-1, 32, 80, 80]           9,216
     BatchNorm2d-205           [-1, 32, 80, 80]              64
       BasicConv-206           [-1, 32, 80, 80]               0
          Conv2d-207           [-1, 16, 80, 80]           2,048
     BatchNorm2d-208           [-1, 16, 80, 80]              32
            ReLU-209           [-1, 16, 80, 80]               0
       BasicConv-210           [-1, 16, 80, 80]               0
          Conv2d-211           [-1, 32, 80, 80]           4,608
     BatchNorm2d-212           [-1, 32, 80, 80]              64
            ReLU-213           [-1, 32, 80, 80]               0
       BasicConv-214           [-1, 32, 80, 80]               0
          Conv2d-215           [-1, 32, 80, 80]           9,216
     BatchNorm2d-216           [-1, 32, 80, 80]              64
       BasicConv-217           [-1, 32, 80, 80]               0
          Conv2d-218           [-1, 16, 80, 80]           2,048
     BatchNorm2d-219           [-1, 16, 80, 80]              32
            ReLU-220           [-1, 16, 80, 80]               0
       BasicConv-221           [-1, 16, 80, 80]               0
          Conv2d-222           [-1, 24, 80, 80]           3,456
     BatchNorm2d-223           [-1, 24, 80, 80]              48
            ReLU-224           [-1, 24, 80, 80]               0
       BasicConv-225           [-1, 24, 80, 80]               0
          Conv2d-226           [-1, 32, 80, 80]           6,912
     BatchNorm2d-227           [-1, 32, 80, 80]              64
            ReLU-228           [-1, 32, 80, 80]               0
       BasicConv-229           [-1, 32, 80, 80]               0
          Conv2d-230           [-1, 32, 80, 80]           9,216
     BatchNorm2d-231           [-1, 32, 80, 80]              64
       BasicConv-232           [-1, 32, 80, 80]               0
          Conv2d-233           [-1, 16, 80, 80]           2,048
     BatchNorm2d-234           [-1, 16, 80, 80]              32
            ReLU-235           [-1, 16, 80, 80]               0
       BasicConv-236           [-1, 16, 80, 80]               0
          Conv2d-237           [-1, 24, 80, 80]           2,688
     BatchNorm2d-238           [-1, 24, 80, 80]              48
            ReLU-239           [-1, 24, 80, 80]               0
       BasicConv-240           [-1, 24, 80, 80]               0
          Conv2d-241           [-1, 32, 80, 80]           5,376
     BatchNorm2d-242           [-1, 32, 80, 80]              64
            ReLU-243           [-1, 32, 80, 80]               0
       BasicConv-244           [-1, 32, 80, 80]               0
          Conv2d-245           [-1, 32, 80, 80]           9,216
     BatchNorm2d-246           [-1, 32, 80, 80]              64
       BasicConv-247           [-1, 32, 80, 80]               0
          Conv2d-248          [-1, 128, 80, 80]          16,384
     BatchNorm2d-249          [-1, 128, 80, 80]             256
       BasicConv-250          [-1, 128, 80, 80]               0
          Conv2d-251          [-1, 128, 80, 80]          16,384
     BatchNorm2d-252          [-1, 128, 80, 80]             256
       BasicConv-253          [-1, 128, 80, 80]               0
            ReLU-254          [-1, 128, 80, 80]               0
        BasicRFB-255          [-1, 128, 80, 80]               0
          Conv2d-256           [-1, 32, 80, 80]           8,192
     BatchNorm2d-257           [-1, 32, 80, 80]              64
     ConvBNLayer-258           [-1, 32, 80, 80]               0
          Conv2d-259           [-1, 32, 80, 80]           8,192
     BatchNorm2d-260           [-1, 32, 80, 80]              64
     ConvBNLayer-261           [-1, 32, 80, 80]               0
          Conv2d-262           [-1, 32, 80, 80]           1,024
     BatchNorm2d-263           [-1, 32, 80, 80]              64
     ConvBNLayer-264           [-1, 32, 80, 80]               0
          Conv2d-265           [-1, 32, 80, 80]           9,216
     BatchNorm2d-266           [-1, 32, 80, 80]              64
     ConvBNLayer-267           [-1, 32, 80, 80]               0
DarknetBottleneck-268           [-1, 32, 80, 80]               0
          Conv2d-269           [-1, 64, 80, 80]           4,096
     BatchNorm2d-270           [-1, 64, 80, 80]             128
     ConvBNLayer-271           [-1, 64, 80, 80]               0
        CSPLayer-272           [-1, 64, 80, 80]               0
        Upsample-273         [-1, 64, 160, 160]               0
              up-274         [-1, 64, 160, 160]               0
          Conv2d-275         [-1, 16, 160, 160]           1,024
     BatchNorm2d-276         [-1, 16, 160, 160]              32
            ReLU-277         [-1, 16, 160, 160]               0
       BasicConv-278         [-1, 16, 160, 160]               0
          Conv2d-279         [-1, 16, 160, 160]           2,304
     BatchNorm2d-280         [-1, 16, 160, 160]              32
       BasicConv-281         [-1, 16, 160, 160]               0
          Conv2d-282          [-1, 8, 160, 160]             512
     BatchNorm2d-283          [-1, 8, 160, 160]              16
            ReLU-284          [-1, 8, 160, 160]               0
       BasicConv-285          [-1, 8, 160, 160]               0
          Conv2d-286         [-1, 16, 160, 160]           1,152
     BatchNorm2d-287         [-1, 16, 160, 160]              32
            ReLU-288         [-1, 16, 160, 160]               0
       BasicConv-289         [-1, 16, 160, 160]               0
          Conv2d-290         [-1, 16, 160, 160]           2,304
     BatchNorm2d-291         [-1, 16, 160, 160]              32
       BasicConv-292         [-1, 16, 160, 160]               0
          Conv2d-293          [-1, 8, 160, 160]             512
     BatchNorm2d-294          [-1, 8, 160, 160]              16
            ReLU-295          [-1, 8, 160, 160]               0
       BasicConv-296          [-1, 8, 160, 160]               0
          Conv2d-297         [-1, 12, 160, 160]             864
     BatchNorm2d-298         [-1, 12, 160, 160]              24
            ReLU-299         [-1, 12, 160, 160]               0
       BasicConv-300         [-1, 12, 160, 160]               0
          Conv2d-301         [-1, 16, 160, 160]           1,728
     BatchNorm2d-302         [-1, 16, 160, 160]              32
            ReLU-303         [-1, 16, 160, 160]               0
       BasicConv-304         [-1, 16, 160, 160]               0
          Conv2d-305         [-1, 16, 160, 160]           2,304
     BatchNorm2d-306         [-1, 16, 160, 160]              32
       BasicConv-307         [-1, 16, 160, 160]               0
          Conv2d-308          [-1, 8, 160, 160]             512
     BatchNorm2d-309          [-1, 8, 160, 160]              16
            ReLU-310          [-1, 8, 160, 160]               0
       BasicConv-311          [-1, 8, 160, 160]               0
          Conv2d-312         [-1, 12, 160, 160]             672
     BatchNorm2d-313         [-1, 12, 160, 160]              24
            ReLU-314         [-1, 12, 160, 160]               0
       BasicConv-315         [-1, 12, 160, 160]               0
          Conv2d-316         [-1, 16, 160, 160]           1,344
     BatchNorm2d-317         [-1, 16, 160, 160]              32
            ReLU-318         [-1, 16, 160, 160]               0
       BasicConv-319         [-1, 16, 160, 160]               0
          Conv2d-320         [-1, 16, 160, 160]           2,304
     BatchNorm2d-321         [-1, 16, 160, 160]              32
       BasicConv-322         [-1, 16, 160, 160]               0
          Conv2d-323         [-1, 64, 160, 160]           4,096
     BatchNorm2d-324         [-1, 64, 160, 160]             128
       BasicConv-325         [-1, 64, 160, 160]               0
          Conv2d-326         [-1, 64, 160, 160]           4,096
     BatchNorm2d-327         [-1, 64, 160, 160]             128
       BasicConv-328         [-1, 64, 160, 160]               0
            ReLU-329         [-1, 64, 160, 160]               0
        BasicRFB-330         [-1, 64, 160, 160]               0
          Conv2d-331         [-1, 16, 160, 160]           2,048
     BatchNorm2d-332         [-1, 16, 160, 160]              32
     ConvBNLayer-333         [-1, 16, 160, 160]               0
          Conv2d-334         [-1, 16, 160, 160]           2,048
     BatchNorm2d-335         [-1, 16, 160, 160]              32
     ConvBNLayer-336         [-1, 16, 160, 160]               0
          Conv2d-337         [-1, 16, 160, 160]             256
     BatchNorm2d-338         [-1, 16, 160, 160]              32
     ConvBNLayer-339         [-1, 16, 160, 160]               0
          Conv2d-340         [-1, 16, 160, 160]           2,304
     BatchNorm2d-341         [-1, 16, 160, 160]              32
     ConvBNLayer-342         [-1, 16, 160, 160]               0
DarknetBottleneck-343         [-1, 16, 160, 160]               0
          Conv2d-344         [-1, 32, 160, 160]           1,024
     BatchNorm2d-345         [-1, 32, 160, 160]              64
     ConvBNLayer-346         [-1, 32, 160, 160]               0
        CSPLayer-347         [-1, 32, 160, 160]               0
        Upsample-348         [-1, 32, 320, 320]               0
              up-349         [-1, 32, 320, 320]               0
         Dropout-350         [-1, 32, 320, 320]               0
          Conv2d-351          [-1, 1, 320, 320]              33
         Dropout-352         [-1, 32, 320, 320]               0
          Conv2d-353          [-1, 1, 320, 320]              33
         Dropout-354         [-1, 32, 320, 320]               0
          Conv2d-355          [-1, 1, 320, 320]              33
         Dropout-356         [-1, 32, 320, 320]               0
          Conv2d-357          [-1, 1, 320, 320]              33
================================================================
Total params: 1,328,580
Trainable params: 1,328,580
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.39
Forward/backward pass size (MB): 1380.50
Params size (MB): 5.07
Estimated Total Size (MB): 1385.96
----------------------------------------------------------------
