----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 400, 400]             288
       BatchNorm2d-2         [-1, 32, 400, 400]              64
         Hardswish-3         [-1, 32, 400, 400]               0
            Conv2d-4         [-1, 32, 400, 400]             288
       BatchNorm2d-5         [-1, 32, 400, 400]              64
         Hardswish-6         [-1, 32, 400, 400]               0
       ConvBNLayer-7         [-1, 32, 400, 400]               0
            Conv2d-8         [-1, 32, 400, 400]           1,024
       BatchNorm2d-9         [-1, 32, 400, 400]              64
        Hardswish-10         [-1, 32, 400, 400]               0
      ConvBNLayer-11         [-1, 32, 400, 400]               0
DepthwiseSeparable-12         [-1, 32, 400, 400]               0
           Conv2d-13         [-1, 32, 200, 200]             288
      BatchNorm2d-14         [-1, 32, 200, 200]              64
        Hardswish-15         [-1, 32, 200, 200]               0
      ConvBNLayer-16         [-1, 32, 200, 200]               0
           Conv2d-17         [-1, 64, 200, 200]           2,048
      BatchNorm2d-18         [-1, 64, 200, 200]             128
        Hardswish-19         [-1, 64, 200, 200]               0
      ConvBNLayer-20         [-1, 64, 200, 200]               0
DepthwiseSeparable-21         [-1, 64, 200, 200]               0
           Conv2d-22         [-1, 64, 200, 200]             576
      BatchNorm2d-23         [-1, 64, 200, 200]             128
        Hardswish-24         [-1, 64, 200, 200]               0
      ConvBNLayer-25         [-1, 64, 200, 200]               0
           Conv2d-26         [-1, 64, 200, 200]           4,096
      BatchNorm2d-27         [-1, 64, 200, 200]             128
        Hardswish-28         [-1, 64, 200, 200]               0
      ConvBNLayer-29         [-1, 64, 200, 200]               0
DepthwiseSeparable-30         [-1, 64, 200, 200]               0
           Conv2d-31         [-1, 64, 100, 100]             576
      BatchNorm2d-32         [-1, 64, 100, 100]             128
        Hardswish-33         [-1, 64, 100, 100]               0
      ConvBNLayer-34         [-1, 64, 100, 100]               0
           Conv2d-35        [-1, 128, 100, 100]           8,192
      BatchNorm2d-36        [-1, 128, 100, 100]             256
        Hardswish-37        [-1, 128, 100, 100]               0
      ConvBNLayer-38        [-1, 128, 100, 100]               0
DepthwiseSeparable-39        [-1, 128, 100, 100]               0
           Conv2d-40        [-1, 128, 100, 100]           1,152
      BatchNorm2d-41        [-1, 128, 100, 100]             256
        Hardswish-42        [-1, 128, 100, 100]               0
      ConvBNLayer-43        [-1, 128, 100, 100]               0
           Conv2d-44        [-1, 128, 100, 100]          16,384
      BatchNorm2d-45        [-1, 128, 100, 100]             256
        Hardswish-46        [-1, 128, 100, 100]               0
      ConvBNLayer-47        [-1, 128, 100, 100]               0
DepthwiseSeparable-48        [-1, 128, 100, 100]               0
           Conv2d-49          [-1, 128, 50, 50]           1,152
      BatchNorm2d-50          [-1, 128, 50, 50]             256
        Hardswish-51          [-1, 128, 50, 50]               0
      ConvBNLayer-52          [-1, 128, 50, 50]               0
           Conv2d-53          [-1, 256, 50, 50]          32,768
      BatchNorm2d-54          [-1, 256, 50, 50]             512
        Hardswish-55          [-1, 256, 50, 50]               0
      ConvBNLayer-56          [-1, 256, 50, 50]               0
DepthwiseSeparable-57          [-1, 256, 50, 50]               0
           Conv2d-58          [-1, 256, 50, 50]           6,400
      BatchNorm2d-59          [-1, 256, 50, 50]             512
        Hardswish-60          [-1, 256, 50, 50]               0
      ConvBNLayer-61          [-1, 256, 50, 50]               0
           Conv2d-62          [-1, 256, 50, 50]          65,536
      BatchNorm2d-63          [-1, 256, 50, 50]             512
        Hardswish-64          [-1, 256, 50, 50]               0
      ConvBNLayer-65          [-1, 256, 50, 50]               0
DepthwiseSeparable-66          [-1, 256, 50, 50]               0
           Conv2d-67          [-1, 256, 50, 50]           6,400
      BatchNorm2d-68          [-1, 256, 50, 50]             512
        Hardswish-69          [-1, 256, 50, 50]               0
      ConvBNLayer-70          [-1, 256, 50, 50]               0
           Conv2d-71          [-1, 256, 50, 50]          65,536
      BatchNorm2d-72          [-1, 256, 50, 50]             512
        Hardswish-73          [-1, 256, 50, 50]               0
      ConvBNLayer-74          [-1, 256, 50, 50]               0
DepthwiseSeparable-75          [-1, 256, 50, 50]               0
           Conv2d-76          [-1, 256, 50, 50]           6,400
      BatchNorm2d-77          [-1, 256, 50, 50]             512
        Hardswish-78          [-1, 256, 50, 50]               0
      ConvBNLayer-79          [-1, 256, 50, 50]               0
           Conv2d-80          [-1, 256, 50, 50]          65,536
      BatchNorm2d-81          [-1, 256, 50, 50]             512
        Hardswish-82          [-1, 256, 50, 50]               0
      ConvBNLayer-83          [-1, 256, 50, 50]               0
DepthwiseSeparable-84          [-1, 256, 50, 50]               0
           Conv2d-85          [-1, 256, 50, 50]           6,400
      BatchNorm2d-86          [-1, 256, 50, 50]             512
        Hardswish-87          [-1, 256, 50, 50]               0
      ConvBNLayer-88          [-1, 256, 50, 50]               0
AdaptiveAvgPool2d-89            [-1, 256, 1, 1]               0
           Conv2d-90             [-1, 64, 1, 1]          16,448
             ReLU-91             [-1, 64, 1, 1]               0
           Conv2d-92            [-1, 256, 1, 1]          16,640
      Hardsigmoid-93            [-1, 256, 1, 1]               0
         SEModule-94          [-1, 256, 50, 50]               0
           Conv2d-95          [-1, 256, 50, 50]          65,536
      BatchNorm2d-96          [-1, 256, 50, 50]             512
        Hardswish-97          [-1, 256, 50, 50]               0
      ConvBNLayer-98          [-1, 256, 50, 50]               0
DepthwiseSeparable-99          [-1, 256, 50, 50]               0
          Conv2d-100          [-1, 256, 50, 50]           6,400
     BatchNorm2d-101          [-1, 256, 50, 50]             512
       Hardswish-102          [-1, 256, 50, 50]               0
     ConvBNLayer-103          [-1, 256, 50, 50]               0
AdaptiveAvgPool2d-104            [-1, 256, 1, 1]               0
          Conv2d-105             [-1, 64, 1, 1]          16,448
            ReLU-106             [-1, 64, 1, 1]               0
          Conv2d-107            [-1, 256, 1, 1]          16,640
     Hardsigmoid-108            [-1, 256, 1, 1]               0
        SEModule-109          [-1, 256, 50, 50]               0
          Conv2d-110          [-1, 256, 50, 50]          65,536
     BatchNorm2d-111          [-1, 256, 50, 50]             512
       Hardswish-112          [-1, 256, 50, 50]               0
     ConvBNLayer-113          [-1, 256, 50, 50]               0
DepthwiseSeparable-114          [-1, 256, 50, 50]               0
          Conv2d-115           [-1, 64, 50, 50]          32,768
     BatchNorm2d-116           [-1, 64, 50, 50]             128
     ConvBNLayer-117           [-1, 64, 50, 50]               0
          Conv2d-118           [-1, 64, 50, 50]          32,768
     BatchNorm2d-119           [-1, 64, 50, 50]             128
     ConvBNLayer-120           [-1, 64, 50, 50]               0
          Conv2d-121           [-1, 64, 50, 50]           4,096
     BatchNorm2d-122           [-1, 64, 50, 50]             128
     ConvBNLayer-123           [-1, 64, 50, 50]               0
          Conv2d-124           [-1, 64, 50, 50]          36,864
     BatchNorm2d-125           [-1, 64, 50, 50]             128
     ConvBNLayer-126           [-1, 64, 50, 50]               0
DarknetBottleneck-127           [-1, 64, 50, 50]               0
          Conv2d-128          [-1, 128, 50, 50]          16,384
     BatchNorm2d-129          [-1, 128, 50, 50]             256
     ConvBNLayer-130          [-1, 128, 50, 50]               0
        CSPLayer-131          [-1, 128, 50, 50]               0
          Conv2d-132          [-1, 512, 50, 50]         590,336
     BatchNorm2d-133          [-1, 512, 50, 50]           1,024
            ReLU-134          [-1, 512, 50, 50]               0
    PixelShuffle-135        [-1, 128, 100, 100]               0
DenseUpsamplingConvolution-136        [-1, 128, 100, 100]               0
              up-137        [-1, 128, 100, 100]               0
          Conv2d-138         [-1, 32, 100, 100]           8,192
     BatchNorm2d-139         [-1, 32, 100, 100]              64
     ConvBNLayer-140         [-1, 32, 100, 100]               0
          Conv2d-141         [-1, 32, 100, 100]           8,192
     BatchNorm2d-142         [-1, 32, 100, 100]              64
     ConvBNLayer-143         [-1, 32, 100, 100]               0
          Conv2d-144         [-1, 32, 100, 100]           1,024
     BatchNorm2d-145         [-1, 32, 100, 100]              64
     ConvBNLayer-146         [-1, 32, 100, 100]               0
          Conv2d-147         [-1, 32, 100, 100]           9,216
     BatchNorm2d-148         [-1, 32, 100, 100]              64
     ConvBNLayer-149         [-1, 32, 100, 100]               0
DarknetBottleneck-150         [-1, 32, 100, 100]               0
          Conv2d-151         [-1, 64, 100, 100]           4,096
     BatchNorm2d-152         [-1, 64, 100, 100]             128
     ConvBNLayer-153         [-1, 64, 100, 100]               0
        CSPLayer-154         [-1, 64, 100, 100]               0
          Conv2d-155        [-1, 256, 100, 100]         147,712
     BatchNorm2d-156        [-1, 256, 100, 100]             512
            ReLU-157        [-1, 256, 100, 100]               0
    PixelShuffle-158         [-1, 64, 200, 200]               0
DenseUpsamplingConvolution-159         [-1, 64, 200, 200]               0
              up-160         [-1, 64, 200, 200]               0
          Conv2d-161         [-1, 16, 200, 200]           2,048
     BatchNorm2d-162         [-1, 16, 200, 200]              32
     ConvBNLayer-163         [-1, 16, 200, 200]               0
          Conv2d-164         [-1, 16, 200, 200]           2,048
     BatchNorm2d-165         [-1, 16, 200, 200]              32
     ConvBNLayer-166         [-1, 16, 200, 200]               0
          Conv2d-167         [-1, 16, 200, 200]             256
     BatchNorm2d-168         [-1, 16, 200, 200]              32
     ConvBNLayer-169         [-1, 16, 200, 200]               0
          Conv2d-170         [-1, 16, 200, 200]           2,304
     BatchNorm2d-171         [-1, 16, 200, 200]              32
     ConvBNLayer-172         [-1, 16, 200, 200]               0
DarknetBottleneck-173         [-1, 16, 200, 200]               0
          Conv2d-174         [-1, 32, 200, 200]           1,024
     BatchNorm2d-175         [-1, 32, 200, 200]              64
     ConvBNLayer-176         [-1, 32, 200, 200]               0
        CSPLayer-177         [-1, 32, 200, 200]               0
          Conv2d-178        [-1, 128, 200, 200]          36,992
     BatchNorm2d-179        [-1, 128, 200, 200]             256
            ReLU-180        [-1, 128, 200, 200]               0
    PixelShuffle-181         [-1, 32, 400, 400]               0
DenseUpsamplingConvolution-182         [-1, 32, 400, 400]               0
              up-183         [-1, 32, 400, 400]               0
          Conv2d-184         [-1, 32, 400, 400]           1,024
     BatchNorm2d-185         [-1, 32, 400, 400]              64
            ReLU-186         [-1, 32, 400, 400]               0
          Conv2d-187          [-1, 1, 400, 400]              33
          Conv2d-188          [-1, 1, 400, 400]              33
          Conv2d-189          [-1, 1, 400, 400]              33
          Conv2d-190          [-1, 1, 400, 400]              33
================================================================
Total params: 1,442,788
Trainable params: 1,442,788
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.61
Forward/backward pass size (MB): 1912.86
Params size (MB): 5.50
Estimated Total Size (MB): 1918.97
----------------------------------------------------------------
