----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]          10,400
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 16, 112, 112]           8,208
       BatchNorm2d-4         [-1, 16, 112, 112]              32
            Conv2d-5            [-1, 8, 56, 56]           2,056
       BatchNorm2d-6            [-1, 8, 56, 56]              16
            Conv2d-7            [-1, 8, 56, 56]             584
       BatchNorm2d-8            [-1, 8, 56, 56]              16
            Conv2d-9            [-1, 8, 56, 56]             584
      BatchNorm2d-10            [-1, 8, 56, 56]              16
    ResidualBlock-11            [-1, 8, 56, 56]               0
           Conv2d-12            [-1, 8, 56, 56]             584
      BatchNorm2d-13            [-1, 8, 56, 56]              16
           Conv2d-14            [-1, 8, 56, 56]             584
      BatchNorm2d-15            [-1, 8, 56, 56]              16
    ResidualBlock-16            [-1, 8, 56, 56]               0
           Conv2d-17            [-1, 8, 56, 56]             584
      BatchNorm2d-18            [-1, 8, 56, 56]              16
           Conv2d-19            [-1, 8, 56, 56]             584
      BatchNorm2d-20            [-1, 8, 56, 56]              16
    ResidualBlock-21            [-1, 8, 56, 56]               0
           Conv2d-22            [-1, 8, 56, 56]             584
      BatchNorm2d-23            [-1, 8, 56, 56]              16
           Conv2d-24            [-1, 8, 56, 56]             584
      BatchNorm2d-25            [-1, 8, 56, 56]              16
    ResidualBlock-26            [-1, 8, 56, 56]               0
           Conv2d-27            [-1, 8, 56, 56]             584
      BatchNorm2d-28            [-1, 8, 56, 56]              16
           Conv2d-29            [-1, 8, 56, 56]             584
      BatchNorm2d-30            [-1, 8, 56, 56]              16
    ResidualBlock-31            [-1, 8, 56, 56]               0
  ConvTranspose2d-32         [-1, 16, 113, 113]           2,064
      BatchNorm2d-33         [-1, 16, 113, 113]              32
  ConvTranspose2d-34         [-1, 32, 225, 225]           8,224
      BatchNorm2d-35         [-1, 32, 225, 225]              64
  ConvTranspose2d-36         [-1, 32, 225, 225]          82,976
          Dropout-37         [-1, 32, 225, 225]               0
           Conv2d-38          [-1, 1, 224, 224]             129
          Dropout-39         [-1, 32, 225, 225]               0
           Conv2d-40          [-1, 1, 224, 224]             129
          Dropout-41         [-1, 32, 225, 225]               0
           Conv2d-42          [-1, 1, 224, 224]             129
          Dropout-43         [-1, 32, 225, 225]               0
           Conv2d-44          [-1, 1, 224, 224]             129
================================================================
Total params: 120,652
Trainable params: 120,652
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 123.90
Params size (MB): 0.46
Estimated Total Size (MB): 125.12
----------------------------------------------------------------
