----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 320, 320]             320
       BatchNorm2d-2         [-1, 32, 320, 320]              64
              ReLU-3         [-1, 32, 320, 320]               0
            Conv2d-4         [-1, 64, 160, 160]          18,496
       BatchNorm2d-5         [-1, 64, 160, 160]             128
              ReLU-6         [-1, 64, 160, 160]               0
 AdaptiveAvgPool2d-7             [-1, 64, 1, 1]               0
            Conv1d-8                [-1, 1, 64]               3
           Sigmoid-9             [-1, 64, 1, 1]               0
        eca_block-10         [-1, 64, 160, 160]               0
           inconv-11         [-1, 64, 160, 160]               0
        MaxPool2d-12           [-1, 64, 80, 80]               0
           Conv2d-13          [-1, 128, 80, 80]          73,856
      BatchNorm2d-14          [-1, 128, 80, 80]             256
             ReLU-15          [-1, 128, 80, 80]               0
AdaptiveAvgPool2d-16            [-1, 128, 1, 1]               0
           Conv1d-17               [-1, 1, 128]               3
          Sigmoid-18            [-1, 128, 1, 1]               0
        eca_block-19          [-1, 128, 80, 80]               0
           Conv2d-20          [-1, 128, 80, 80]           8,192
      BatchNorm2d-21          [-1, 128, 80, 80]             256
         conv_att-22          [-1, 128, 80, 80]               0
             down-23          [-1, 128, 80, 80]               0
        MaxPool2d-24          [-1, 128, 40, 40]               0
           Conv2d-25          [-1, 256, 40, 40]         295,168
      BatchNorm2d-26          [-1, 256, 40, 40]             512
             ReLU-27          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-28            [-1, 256, 1, 1]               0
           Conv1d-29               [-1, 1, 256]               5
          Sigmoid-30            [-1, 256, 1, 1]               0
        eca_block-31          [-1, 256, 40, 40]               0
           Conv2d-32          [-1, 256, 40, 40]          32,768
      BatchNorm2d-33          [-1, 256, 40, 40]             512
         conv_att-34          [-1, 256, 40, 40]               0
             down-35          [-1, 256, 40, 40]               0
        MaxPool2d-36          [-1, 256, 20, 20]               0
           Conv2d-37          [-1, 512, 20, 20]       1,180,160
      BatchNorm2d-38          [-1, 512, 20, 20]           1,024
             ReLU-39          [-1, 512, 20, 20]               0
AdaptiveAvgPool2d-40            [-1, 512, 1, 1]               0
           Conv1d-41               [-1, 1, 512]               5
          Sigmoid-42            [-1, 512, 1, 1]               0
        eca_block-43          [-1, 512, 20, 20]               0
           Conv2d-44          [-1, 512, 20, 20]         131,072
      BatchNorm2d-45          [-1, 512, 20, 20]           1,024
         conv_att-46          [-1, 512, 20, 20]               0
             down-47          [-1, 512, 20, 20]               0
        MaxPool2d-48          [-1, 512, 10, 10]               0
           Conv2d-49          [-1, 512, 10, 10]       2,359,808
      BatchNorm2d-50          [-1, 512, 10, 10]           1,024
             ReLU-51          [-1, 512, 10, 10]               0
AdaptiveAvgPool2d-52            [-1, 512, 1, 1]               0
           Conv1d-53               [-1, 1, 512]               5
          Sigmoid-54            [-1, 512, 1, 1]               0
        eca_block-55          [-1, 512, 10, 10]               0
         conv_att-56          [-1, 512, 10, 10]               0
             down-57          [-1, 512, 10, 10]               0
           Conv2d-58          [-1, 128, 10, 10]          65,536
      BatchNorm2d-59          [-1, 128, 10, 10]             256
             ReLU-60          [-1, 128, 10, 10]               0
        BasicConv-61          [-1, 128, 10, 10]               0
           Conv2d-62          [-1, 128, 10, 10]         147,456
      BatchNorm2d-63          [-1, 128, 10, 10]             256
        BasicConv-64          [-1, 128, 10, 10]               0
           Conv2d-65           [-1, 64, 10, 10]          32,768
      BatchNorm2d-66           [-1, 64, 10, 10]             128
             ReLU-67           [-1, 64, 10, 10]               0
        BasicConv-68           [-1, 64, 10, 10]               0
           Conv2d-69          [-1, 128, 10, 10]          73,728
      BatchNorm2d-70          [-1, 128, 10, 10]             256
             ReLU-71          [-1, 128, 10, 10]               0
        BasicConv-72          [-1, 128, 10, 10]               0
           Conv2d-73          [-1, 128, 10, 10]         147,456
      BatchNorm2d-74          [-1, 128, 10, 10]             256
        BasicConv-75          [-1, 128, 10, 10]               0
           Conv2d-76           [-1, 64, 10, 10]          32,768
      BatchNorm2d-77           [-1, 64, 10, 10]             128
             ReLU-78           [-1, 64, 10, 10]               0
        BasicConv-79           [-1, 64, 10, 10]               0
           Conv2d-80           [-1, 96, 10, 10]          55,296
      BatchNorm2d-81           [-1, 96, 10, 10]             192
             ReLU-82           [-1, 96, 10, 10]               0
        BasicConv-83           [-1, 96, 10, 10]               0
           Conv2d-84          [-1, 128, 10, 10]         110,592
      BatchNorm2d-85          [-1, 128, 10, 10]             256
             ReLU-86          [-1, 128, 10, 10]               0
        BasicConv-87          [-1, 128, 10, 10]               0
           Conv2d-88          [-1, 128, 10, 10]         147,456
      BatchNorm2d-89          [-1, 128, 10, 10]             256
        BasicConv-90          [-1, 128, 10, 10]               0
           Conv2d-91           [-1, 64, 10, 10]          32,768
      BatchNorm2d-92           [-1, 64, 10, 10]             128
             ReLU-93           [-1, 64, 10, 10]               0
        BasicConv-94           [-1, 64, 10, 10]               0
           Conv2d-95           [-1, 96, 10, 10]          43,008
      BatchNorm2d-96           [-1, 96, 10, 10]             192
             ReLU-97           [-1, 96, 10, 10]               0
        BasicConv-98           [-1, 96, 10, 10]               0
           Conv2d-99          [-1, 128, 10, 10]          86,016
     BatchNorm2d-100          [-1, 128, 10, 10]             256
            ReLU-101          [-1, 128, 10, 10]               0
       BasicConv-102          [-1, 128, 10, 10]               0
          Conv2d-103          [-1, 128, 10, 10]         147,456
     BatchNorm2d-104          [-1, 128, 10, 10]             256
       BasicConv-105          [-1, 128, 10, 10]               0
          Conv2d-106          [-1, 512, 10, 10]         262,144
     BatchNorm2d-107          [-1, 512, 10, 10]           1,024
       BasicConv-108          [-1, 512, 10, 10]               0
          Conv2d-109          [-1, 512, 10, 10]         262,144
     BatchNorm2d-110          [-1, 512, 10, 10]           1,024
       BasicConv-111          [-1, 512, 10, 10]               0
            ReLU-112          [-1, 512, 10, 10]               0
        BasicRFB-113          [-1, 512, 10, 10]               0
 ConvTranspose2d-114          [-1, 512, 20, 20]       1,049,088
          Conv2d-115          [-1, 256, 20, 20]       2,359,552
     BatchNorm2d-116          [-1, 256, 20, 20]             512
            ReLU-117          [-1, 256, 20, 20]               0
AdaptiveAvgPool2d-118            [-1, 256, 1, 1]               0
          Conv1d-119               [-1, 1, 256]               5
         Sigmoid-120            [-1, 256, 1, 1]               0
       eca_block-121          [-1, 256, 20, 20]               0
          Conv2d-122          [-1, 256, 20, 20]         262,144
     BatchNorm2d-123          [-1, 256, 20, 20]             512
        conv_att-124          [-1, 256, 20, 20]               0
              up-125          [-1, 256, 20, 20]               0
 ConvTranspose2d-126          [-1, 256, 40, 40]         262,400
          Conv2d-127          [-1, 128, 40, 40]         589,952
     BatchNorm2d-128          [-1, 128, 40, 40]             256
            ReLU-129          [-1, 128, 40, 40]               0
AdaptiveAvgPool2d-130            [-1, 128, 1, 1]               0
          Conv1d-131               [-1, 1, 128]               5
         Sigmoid-132            [-1, 128, 1, 1]               0
       eca_block-133          [-1, 128, 40, 40]               0
          Conv2d-134          [-1, 128, 40, 40]          65,536
     BatchNorm2d-135          [-1, 128, 40, 40]             256
        conv_att-136          [-1, 128, 40, 40]               0
              up-137          [-1, 128, 40, 40]               0
 ConvTranspose2d-138          [-1, 128, 80, 80]          65,664
          Conv2d-139           [-1, 64, 80, 80]         147,520
     BatchNorm2d-140           [-1, 64, 80, 80]             128
            ReLU-141           [-1, 64, 80, 80]               0
AdaptiveAvgPool2d-142             [-1, 64, 1, 1]               0
          Conv1d-143                [-1, 1, 64]               5
         Sigmoid-144             [-1, 64, 1, 1]               0
       eca_block-145           [-1, 64, 80, 80]               0
          Conv2d-146           [-1, 64, 80, 80]          16,384
     BatchNorm2d-147           [-1, 64, 80, 80]             128
        conv_att-148           [-1, 64, 80, 80]               0
              up-149           [-1, 64, 80, 80]               0
 ConvTranspose2d-150         [-1, 64, 160, 160]          16,448
          Conv2d-151         [-1, 64, 160, 160]          73,792
     BatchNorm2d-152         [-1, 64, 160, 160]             128
            ReLU-153         [-1, 64, 160, 160]               0
AdaptiveAvgPool2d-154             [-1, 64, 1, 1]               0
          Conv1d-155                [-1, 1, 64]               5
         Sigmoid-156             [-1, 64, 1, 1]               0
       eca_block-157         [-1, 64, 160, 160]               0
          Conv2d-158         [-1, 64, 160, 160]           8,192
     BatchNorm2d-159         [-1, 64, 160, 160]             128
        conv_att-160         [-1, 64, 160, 160]               0
              up-161         [-1, 64, 160, 160]               0
          Conv2d-162         [-1, 16, 160, 160]           1,024
     BatchNorm2d-163         [-1, 16, 160, 160]              32
            ReLU-164         [-1, 16, 160, 160]               0
       BasicConv-165         [-1, 16, 160, 160]               0
          Conv2d-166         [-1, 16, 160, 160]           2,304
     BatchNorm2d-167         [-1, 16, 160, 160]              32
       BasicConv-168         [-1, 16, 160, 160]               0
          Conv2d-169          [-1, 8, 160, 160]             512
     BatchNorm2d-170          [-1, 8, 160, 160]              16
            ReLU-171          [-1, 8, 160, 160]               0
       BasicConv-172          [-1, 8, 160, 160]               0
          Conv2d-173         [-1, 16, 160, 160]           1,152
     BatchNorm2d-174         [-1, 16, 160, 160]              32
            ReLU-175         [-1, 16, 160, 160]               0
       BasicConv-176         [-1, 16, 160, 160]               0
          Conv2d-177         [-1, 16, 160, 160]           2,304
     BatchNorm2d-178         [-1, 16, 160, 160]              32
       BasicConv-179         [-1, 16, 160, 160]               0
          Conv2d-180          [-1, 8, 160, 160]             512
     BatchNorm2d-181          [-1, 8, 160, 160]              16
            ReLU-182          [-1, 8, 160, 160]               0
       BasicConv-183          [-1, 8, 160, 160]               0
          Conv2d-184         [-1, 12, 160, 160]             864
     BatchNorm2d-185         [-1, 12, 160, 160]              24
            ReLU-186         [-1, 12, 160, 160]               0
       BasicConv-187         [-1, 12, 160, 160]               0
          Conv2d-188         [-1, 16, 160, 160]           1,728
     BatchNorm2d-189         [-1, 16, 160, 160]              32
            ReLU-190         [-1, 16, 160, 160]               0
       BasicConv-191         [-1, 16, 160, 160]               0
          Conv2d-192         [-1, 16, 160, 160]           2,304
     BatchNorm2d-193         [-1, 16, 160, 160]              32
       BasicConv-194         [-1, 16, 160, 160]               0
          Conv2d-195          [-1, 8, 160, 160]             512
     BatchNorm2d-196          [-1, 8, 160, 160]              16
            ReLU-197          [-1, 8, 160, 160]               0
       BasicConv-198          [-1, 8, 160, 160]               0
          Conv2d-199         [-1, 12, 160, 160]             672
     BatchNorm2d-200         [-1, 12, 160, 160]              24
            ReLU-201         [-1, 12, 160, 160]               0
       BasicConv-202         [-1, 12, 160, 160]               0
          Conv2d-203         [-1, 16, 160, 160]           1,344
     BatchNorm2d-204         [-1, 16, 160, 160]              32
            ReLU-205         [-1, 16, 160, 160]               0
       BasicConv-206         [-1, 16, 160, 160]               0
          Conv2d-207         [-1, 16, 160, 160]           2,304
     BatchNorm2d-208         [-1, 16, 160, 160]              32
       BasicConv-209         [-1, 16, 160, 160]               0
          Conv2d-210         [-1, 64, 160, 160]           4,096
     BatchNorm2d-211         [-1, 64, 160, 160]             128
       BasicConv-212         [-1, 64, 160, 160]               0
          Conv2d-213         [-1, 64, 160, 160]           4,096
     BatchNorm2d-214         [-1, 64, 160, 160]             128
       BasicConv-215         [-1, 64, 160, 160]               0
            ReLU-216         [-1, 64, 160, 160]               0
        BasicRFB-217         [-1, 64, 160, 160]               0
 ConvTranspose2d-218         [-1, 32, 320, 320]           8,224
     BatchNorm2d-219         [-1, 32, 320, 320]              64
            ReLU-220         [-1, 32, 320, 320]               0
        up_final-221         [-1, 32, 320, 320]               0
         Dropout-222         [-1, 32, 320, 320]               0
          Conv2d-223          [-1, 1, 320, 320]              33
         Dropout-224         [-1, 32, 320, 320]               0
          Conv2d-225          [-1, 1, 320, 320]              33
         Dropout-226         [-1, 32, 320, 320]               0
          Conv2d-227          [-1, 1, 320, 320]              33
         Dropout-228         [-1, 32, 320, 320]               0
          Conv2d-229          [-1, 1, 320, 320]              33
================================================================
Total params: 10,709,613
Trainable params: 10,709,613
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.39
Forward/backward pass size (MB): 835.59
Params size (MB): 40.85
Estimated Total Size (MB): 876.84
----------------------------------------------------------------
