----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]             288
       BatchNorm2d-2         [-1, 32, 224, 224]              64
         Hardswish-3         [-1, 32, 224, 224]               0
       ConvBNLayer-4         [-1, 32, 224, 224]               0
            Conv2d-5         [-1, 64, 112, 112]          18,432
       BatchNorm2d-6         [-1, 64, 112, 112]             128
         Hardswish-7         [-1, 64, 112, 112]               0
       ConvBNLayer-8         [-1, 64, 112, 112]               0
            inconv-9         [-1, 64, 112, 112]               0
           Conv2d-10         [-1, 64, 112, 112]             576
      BatchNorm2d-11         [-1, 64, 112, 112]             128
        Hardswish-12         [-1, 64, 112, 112]               0
      ConvBNLayer-13         [-1, 64, 112, 112]               0
           Conv2d-14         [-1, 64, 112, 112]           4,096
      BatchNorm2d-15         [-1, 64, 112, 112]             128
        Hardswish-16         [-1, 64, 112, 112]               0
      ConvBNLayer-17         [-1, 64, 112, 112]               0
DepthwiseSeparable-18         [-1, 64, 112, 112]               0
           Conv2d-19           [-1, 64, 56, 56]             576
      BatchNorm2d-20           [-1, 64, 56, 56]             128
        Hardswish-21           [-1, 64, 56, 56]               0
      ConvBNLayer-22           [-1, 64, 56, 56]               0
           Conv2d-23          [-1, 128, 56, 56]           8,192
      BatchNorm2d-24          [-1, 128, 56, 56]             256
        Hardswish-25          [-1, 128, 56, 56]               0
      ConvBNLayer-26          [-1, 128, 56, 56]               0
DepthwiseSeparable-27          [-1, 128, 56, 56]               0
     dsc_conv_att-28          [-1, 128, 56, 56]               0
             down-29          [-1, 128, 56, 56]               0
           Conv2d-30          [-1, 128, 56, 56]           1,152
      BatchNorm2d-31          [-1, 128, 56, 56]             256
        Hardswish-32          [-1, 128, 56, 56]               0
      ConvBNLayer-33          [-1, 128, 56, 56]               0
           Conv2d-34          [-1, 128, 56, 56]          16,384
      BatchNorm2d-35          [-1, 128, 56, 56]             256
        Hardswish-36          [-1, 128, 56, 56]               0
      ConvBNLayer-37          [-1, 128, 56, 56]               0
DepthwiseSeparable-38          [-1, 128, 56, 56]               0
           Conv2d-39          [-1, 128, 28, 28]           1,152
      BatchNorm2d-40          [-1, 128, 28, 28]             256
        Hardswish-41          [-1, 128, 28, 28]               0
      ConvBNLayer-42          [-1, 128, 28, 28]               0
           Conv2d-43          [-1, 256, 28, 28]          32,768
      BatchNorm2d-44          [-1, 256, 28, 28]             512
        Hardswish-45          [-1, 256, 28, 28]               0
      ConvBNLayer-46          [-1, 256, 28, 28]               0
DepthwiseSeparable-47          [-1, 256, 28, 28]               0
     dsc_conv_att-48          [-1, 256, 28, 28]               0
             down-49          [-1, 256, 28, 28]               0
           Conv2d-50          [-1, 256, 28, 28]           2,304
      BatchNorm2d-51          [-1, 256, 28, 28]             512
        Hardswish-52          [-1, 256, 28, 28]               0
      ConvBNLayer-53          [-1, 256, 28, 28]               0
           Conv2d-54          [-1, 256, 28, 28]          65,536
      BatchNorm2d-55          [-1, 256, 28, 28]             512
        Hardswish-56          [-1, 256, 28, 28]               0
      ConvBNLayer-57          [-1, 256, 28, 28]               0
DepthwiseSeparable-58          [-1, 256, 28, 28]               0
           Conv2d-59          [-1, 256, 14, 14]           2,304
      BatchNorm2d-60          [-1, 256, 14, 14]             512
        Hardswish-61          [-1, 256, 14, 14]               0
      ConvBNLayer-62          [-1, 256, 14, 14]               0
           Conv2d-63          [-1, 512, 14, 14]         131,072
      BatchNorm2d-64          [-1, 512, 14, 14]           1,024
        Hardswish-65          [-1, 512, 14, 14]               0
      ConvBNLayer-66          [-1, 512, 14, 14]               0
DepthwiseSeparable-67          [-1, 512, 14, 14]               0
     dsc_conv_att-68          [-1, 512, 14, 14]               0
             down-69          [-1, 512, 14, 14]               0
           Conv2d-70          [-1, 512, 14, 14]           4,608
      BatchNorm2d-71          [-1, 512, 14, 14]           1,024
        Hardswish-72          [-1, 512, 14, 14]               0
      ConvBNLayer-73          [-1, 512, 14, 14]               0
           Conv2d-74          [-1, 512, 14, 14]         262,144
      BatchNorm2d-75          [-1, 512, 14, 14]           1,024
        Hardswish-76          [-1, 512, 14, 14]               0
      ConvBNLayer-77          [-1, 512, 14, 14]               0
DepthwiseSeparable-78          [-1, 512, 14, 14]               0
           Conv2d-79            [-1, 512, 7, 7]           4,608
      BatchNorm2d-80            [-1, 512, 7, 7]           1,024
        Hardswish-81            [-1, 512, 7, 7]               0
      ConvBNLayer-82            [-1, 512, 7, 7]               0
           Conv2d-83            [-1, 512, 7, 7]         262,144
      BatchNorm2d-84            [-1, 512, 7, 7]           1,024
        Hardswish-85            [-1, 512, 7, 7]               0
      ConvBNLayer-86            [-1, 512, 7, 7]               0
DepthwiseSeparable-87            [-1, 512, 7, 7]               0
     dsc_conv_att-88            [-1, 512, 7, 7]               0
             down-89            [-1, 512, 7, 7]               0
         Upsample-90          [-1, 512, 14, 14]               0
           Conv2d-91         [-1, 1024, 14, 14]           9,216
      BatchNorm2d-92         [-1, 1024, 14, 14]           2,048
        Hardswish-93         [-1, 1024, 14, 14]               0
      ConvBNLayer-94         [-1, 1024, 14, 14]               0
           Conv2d-95         [-1, 1024, 14, 14]       1,048,576
      BatchNorm2d-96         [-1, 1024, 14, 14]           2,048
        Hardswish-97         [-1, 1024, 14, 14]               0
      ConvBNLayer-98         [-1, 1024, 14, 14]               0
DepthwiseSeparable-99         [-1, 1024, 14, 14]               0
          Conv2d-100         [-1, 1024, 14, 14]           9,216
     BatchNorm2d-101         [-1, 1024, 14, 14]           2,048
       Hardswish-102         [-1, 1024, 14, 14]               0
     ConvBNLayer-103         [-1, 1024, 14, 14]               0
          Conv2d-104          [-1, 256, 14, 14]         262,144
     BatchNorm2d-105          [-1, 256, 14, 14]             512
       Hardswish-106          [-1, 256, 14, 14]               0
     ConvBNLayer-107          [-1, 256, 14, 14]               0
DepthwiseSeparable-108          [-1, 256, 14, 14]               0
    dsc_conv_att-109          [-1, 256, 14, 14]               0
              up-110          [-1, 256, 14, 14]               0
        Upsample-111          [-1, 256, 28, 28]               0
          Conv2d-112          [-1, 512, 28, 28]           4,608
     BatchNorm2d-113          [-1, 512, 28, 28]           1,024
       Hardswish-114          [-1, 512, 28, 28]               0
     ConvBNLayer-115          [-1, 512, 28, 28]               0
          Conv2d-116          [-1, 512, 28, 28]         262,144
     BatchNorm2d-117          [-1, 512, 28, 28]           1,024
       Hardswish-118          [-1, 512, 28, 28]               0
     ConvBNLayer-119          [-1, 512, 28, 28]               0
DepthwiseSeparable-120          [-1, 512, 28, 28]               0
          Conv2d-121          [-1, 512, 28, 28]           4,608
     BatchNorm2d-122          [-1, 512, 28, 28]           1,024
       Hardswish-123          [-1, 512, 28, 28]               0
     ConvBNLayer-124          [-1, 512, 28, 28]               0
          Conv2d-125          [-1, 128, 28, 28]          65,536
     BatchNorm2d-126          [-1, 128, 28, 28]             256
       Hardswish-127          [-1, 128, 28, 28]               0
     ConvBNLayer-128          [-1, 128, 28, 28]               0
DepthwiseSeparable-129          [-1, 128, 28, 28]               0
    dsc_conv_att-130          [-1, 128, 28, 28]               0
              up-131          [-1, 128, 28, 28]               0
        Upsample-132          [-1, 128, 56, 56]               0
          Conv2d-133          [-1, 256, 56, 56]           2,304
     BatchNorm2d-134          [-1, 256, 56, 56]             512
       Hardswish-135          [-1, 256, 56, 56]               0
     ConvBNLayer-136          [-1, 256, 56, 56]               0
          Conv2d-137          [-1, 256, 56, 56]          65,536
     BatchNorm2d-138          [-1, 256, 56, 56]             512
       Hardswish-139          [-1, 256, 56, 56]               0
     ConvBNLayer-140          [-1, 256, 56, 56]               0
DepthwiseSeparable-141          [-1, 256, 56, 56]               0
          Conv2d-142          [-1, 256, 56, 56]           2,304
     BatchNorm2d-143          [-1, 256, 56, 56]             512
       Hardswish-144          [-1, 256, 56, 56]               0
     ConvBNLayer-145          [-1, 256, 56, 56]               0
          Conv2d-146           [-1, 64, 56, 56]          16,384
     BatchNorm2d-147           [-1, 64, 56, 56]             128
       Hardswish-148           [-1, 64, 56, 56]               0
     ConvBNLayer-149           [-1, 64, 56, 56]               0
DepthwiseSeparable-150           [-1, 64, 56, 56]               0
    dsc_conv_att-151           [-1, 64, 56, 56]               0
              up-152           [-1, 64, 56, 56]               0
        Upsample-153         [-1, 64, 112, 112]               0
          Conv2d-154        [-1, 128, 112, 112]           1,152
     BatchNorm2d-155        [-1, 128, 112, 112]             256
       Hardswish-156        [-1, 128, 112, 112]               0
     ConvBNLayer-157        [-1, 128, 112, 112]               0
          Conv2d-158        [-1, 128, 112, 112]          16,384
     BatchNorm2d-159        [-1, 128, 112, 112]             256
       Hardswish-160        [-1, 128, 112, 112]               0
     ConvBNLayer-161        [-1, 128, 112, 112]               0
DepthwiseSeparable-162        [-1, 128, 112, 112]               0
          Conv2d-163        [-1, 128, 112, 112]           1,152
     BatchNorm2d-164        [-1, 128, 112, 112]             256
       Hardswish-165        [-1, 128, 112, 112]               0
     ConvBNLayer-166        [-1, 128, 112, 112]               0
          Conv2d-167         [-1, 64, 112, 112]           8,192
     BatchNorm2d-168         [-1, 64, 112, 112]             128
       Hardswish-169         [-1, 64, 112, 112]               0
     ConvBNLayer-170         [-1, 64, 112, 112]               0
DepthwiseSeparable-171         [-1, 64, 112, 112]               0
    dsc_conv_att-172         [-1, 64, 112, 112]               0
              up-173         [-1, 64, 112, 112]               0
 ConvTranspose2d-174         [-1, 32, 224, 224]           8,224
     BatchNorm2d-175         [-1, 32, 224, 224]              64
            ReLU-176         [-1, 32, 224, 224]               0
        up_final-177         [-1, 32, 224, 224]               0
          Conv2d-178          [-1, 1, 224, 224]              33
          Conv2d-179          [-1, 1, 224, 224]              33
          Conv2d-180          [-1, 1, 224, 224]              33
          Conv2d-181          [-1, 1, 224, 224]              33
================================================================
Total params: 2,627,524
Trainable params: 2,627,524
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 655.57
Params size (MB): 10.02
Estimated Total Size (MB): 665.78
----------------------------------------------------------------
