----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 320, 320]             288
       BatchNorm2d-2         [-1, 32, 320, 320]              64
       ConvBNLayer-3         [-1, 32, 320, 320]               0
            Conv2d-4         [-1, 32, 320, 320]             288
       BatchNorm2d-5         [-1, 32, 320, 320]              64
       ConvBNLayer-6         [-1, 32, 320, 320]               0
 AdaptiveAvgPool2d-7             [-1, 32, 1, 1]               0
            Conv1d-8                [-1, 1, 32]               3
           Sigmoid-9             [-1, 32, 1, 1]               0
        eca_block-10         [-1, 32, 320, 320]               0
           Conv2d-11         [-1, 32, 320, 320]           1,024
      BatchNorm2d-12         [-1, 32, 320, 320]              64
      ConvBNLayer-13         [-1, 32, 320, 320]               0
DepthwiseSeparable-14         [-1, 32, 320, 320]               0
           Conv2d-15         [-1, 32, 160, 160]             288
      BatchNorm2d-16         [-1, 32, 160, 160]              64
      ConvBNLayer-17         [-1, 32, 160, 160]               0
AdaptiveAvgPool2d-18             [-1, 32, 1, 1]               0
           Conv1d-19                [-1, 1, 32]               3
          Sigmoid-20             [-1, 32, 1, 1]               0
        eca_block-21         [-1, 32, 160, 160]               0
           Conv2d-22         [-1, 64, 160, 160]           2,048
      BatchNorm2d-23         [-1, 64, 160, 160]             128
      ConvBNLayer-24         [-1, 64, 160, 160]               0
DepthwiseSeparable-25         [-1, 64, 160, 160]               0
           Conv2d-26         [-1, 64, 160, 160]             576
      BatchNorm2d-27         [-1, 64, 160, 160]             128
      ConvBNLayer-28         [-1, 64, 160, 160]               0
AdaptiveAvgPool2d-29             [-1, 64, 1, 1]               0
           Conv1d-30                [-1, 1, 64]               3
          Sigmoid-31             [-1, 64, 1, 1]               0
        eca_block-32         [-1, 64, 160, 160]               0
           Conv2d-33         [-1, 64, 160, 160]           4,096
      BatchNorm2d-34         [-1, 64, 160, 160]             128
      ConvBNLayer-35         [-1, 64, 160, 160]               0
DepthwiseSeparable-36         [-1, 64, 160, 160]               0
           Conv2d-37           [-1, 64, 80, 80]             576
      BatchNorm2d-38           [-1, 64, 80, 80]             128
      ConvBNLayer-39           [-1, 64, 80, 80]               0
AdaptiveAvgPool2d-40             [-1, 64, 1, 1]               0
           Conv1d-41                [-1, 1, 64]               3
          Sigmoid-42             [-1, 64, 1, 1]               0
        eca_block-43           [-1, 64, 80, 80]               0
           Conv2d-44          [-1, 128, 80, 80]           8,192
      BatchNorm2d-45          [-1, 128, 80, 80]             256
      ConvBNLayer-46          [-1, 128, 80, 80]               0
DepthwiseSeparable-47          [-1, 128, 80, 80]               0
           Conv2d-48          [-1, 128, 80, 80]           1,152
      BatchNorm2d-49          [-1, 128, 80, 80]             256
      ConvBNLayer-50          [-1, 128, 80, 80]               0
AdaptiveAvgPool2d-51            [-1, 128, 1, 1]               0
           Conv1d-52               [-1, 1, 128]               5
          Sigmoid-53            [-1, 128, 1, 1]               0
        eca_block-54          [-1, 128, 80, 80]               0
           Conv2d-55          [-1, 128, 80, 80]          16,384
      BatchNorm2d-56          [-1, 128, 80, 80]             256
      ConvBNLayer-57          [-1, 128, 80, 80]               0
DepthwiseSeparable-58          [-1, 128, 80, 80]               0
           Conv2d-59          [-1, 128, 40, 40]           1,152
      BatchNorm2d-60          [-1, 128, 40, 40]             256
      ConvBNLayer-61          [-1, 128, 40, 40]               0
AdaptiveAvgPool2d-62            [-1, 128, 1, 1]               0
           Conv1d-63               [-1, 1, 128]               5
          Sigmoid-64            [-1, 128, 1, 1]               0
        eca_block-65          [-1, 128, 40, 40]               0
           Conv2d-66          [-1, 256, 40, 40]          32,768
      BatchNorm2d-67          [-1, 256, 40, 40]             512
      ConvBNLayer-68          [-1, 256, 40, 40]               0
DepthwiseSeparable-69          [-1, 256, 40, 40]               0
           Conv2d-70          [-1, 256, 40, 40]           6,400
      BatchNorm2d-71          [-1, 256, 40, 40]             512
      ConvBNLayer-72          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-73            [-1, 256, 1, 1]               0
           Conv1d-74               [-1, 1, 256]               5
          Sigmoid-75            [-1, 256, 1, 1]               0
        eca_block-76          [-1, 256, 40, 40]               0
           Conv2d-77          [-1, 256, 40, 40]          65,536
      BatchNorm2d-78          [-1, 256, 40, 40]             512
      ConvBNLayer-79          [-1, 256, 40, 40]               0
DepthwiseSeparable-80          [-1, 256, 40, 40]               0
           Conv2d-81          [-1, 256, 40, 40]           6,400
      BatchNorm2d-82          [-1, 256, 40, 40]             512
      ConvBNLayer-83          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-84            [-1, 256, 1, 1]               0
           Conv1d-85               [-1, 1, 256]               5
          Sigmoid-86            [-1, 256, 1, 1]               0
        eca_block-87          [-1, 256, 40, 40]               0
           Conv2d-88          [-1, 256, 40, 40]          65,536
      BatchNorm2d-89          [-1, 256, 40, 40]             512
      ConvBNLayer-90          [-1, 256, 40, 40]               0
DepthwiseSeparable-91          [-1, 256, 40, 40]               0
           Conv2d-92          [-1, 256, 40, 40]           6,400
      BatchNorm2d-93          [-1, 256, 40, 40]             512
      ConvBNLayer-94          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-95            [-1, 256, 1, 1]               0
           Conv1d-96               [-1, 1, 256]               5
          Sigmoid-97            [-1, 256, 1, 1]               0
        eca_block-98          [-1, 256, 40, 40]               0
           Conv2d-99          [-1, 256, 40, 40]          65,536
     BatchNorm2d-100          [-1, 256, 40, 40]             512
     ConvBNLayer-101          [-1, 256, 40, 40]               0
DepthwiseSeparable-102          [-1, 256, 40, 40]               0
          Conv2d-103          [-1, 256, 40, 40]           6,400
     BatchNorm2d-104          [-1, 256, 40, 40]             512
     ConvBNLayer-105          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-106            [-1, 256, 1, 1]               0
          Conv1d-107               [-1, 1, 256]               5
         Sigmoid-108            [-1, 256, 1, 1]               0
       eca_block-109          [-1, 256, 40, 40]               0
          Conv2d-110          [-1, 256, 40, 40]          65,536
     BatchNorm2d-111          [-1, 256, 40, 40]             512
     ConvBNLayer-112          [-1, 256, 40, 40]               0
DepthwiseSeparable-113          [-1, 256, 40, 40]               0
          Conv2d-114          [-1, 256, 40, 40]           6,400
     BatchNorm2d-115          [-1, 256, 40, 40]             512
     ConvBNLayer-116          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-117            [-1, 256, 1, 1]               0
          Conv1d-118               [-1, 1, 256]               5
         Sigmoid-119            [-1, 256, 1, 1]               0
       eca_block-120          [-1, 256, 40, 40]               0
          Conv2d-121          [-1, 256, 40, 40]          65,536
     BatchNorm2d-122          [-1, 256, 40, 40]             512
     ConvBNLayer-123          [-1, 256, 40, 40]               0
DepthwiseSeparable-124          [-1, 256, 40, 40]               0
          Conv2d-125           [-1, 64, 40, 40]          32,768
     BatchNorm2d-126           [-1, 64, 40, 40]             128
     ConvBNLayer-127           [-1, 64, 40, 40]               0
          Conv2d-128           [-1, 64, 40, 40]          32,768
     BatchNorm2d-129           [-1, 64, 40, 40]             128
     ConvBNLayer-130           [-1, 64, 40, 40]               0
          Conv2d-131           [-1, 64, 40, 40]           4,096
     BatchNorm2d-132           [-1, 64, 40, 40]             128
     ConvBNLayer-133           [-1, 64, 40, 40]               0
          Conv2d-134           [-1, 64, 40, 40]          36,864
     BatchNorm2d-135           [-1, 64, 40, 40]             128
     ConvBNLayer-136           [-1, 64, 40, 40]               0
DarknetBottleneck-137           [-1, 64, 40, 40]               0
          Conv2d-138          [-1, 128, 40, 40]          16,384
     BatchNorm2d-139          [-1, 128, 40, 40]             256
     ConvBNLayer-140          [-1, 128, 40, 40]               0
        CSPLayer-141          [-1, 128, 40, 40]               0
        Upsample-142          [-1, 128, 80, 80]               0
              up-143          [-1, 128, 80, 80]               0
          Conv2d-144           [-1, 32, 80, 80]           8,192
     BatchNorm2d-145           [-1, 32, 80, 80]              64
     ConvBNLayer-146           [-1, 32, 80, 80]               0
          Conv2d-147           [-1, 32, 80, 80]           8,192
     BatchNorm2d-148           [-1, 32, 80, 80]              64
     ConvBNLayer-149           [-1, 32, 80, 80]               0
          Conv2d-150           [-1, 32, 80, 80]           1,024
     BatchNorm2d-151           [-1, 32, 80, 80]              64
     ConvBNLayer-152           [-1, 32, 80, 80]               0
          Conv2d-153           [-1, 32, 80, 80]           9,216
     BatchNorm2d-154           [-1, 32, 80, 80]              64
     ConvBNLayer-155           [-1, 32, 80, 80]               0
DarknetBottleneck-156           [-1, 32, 80, 80]               0
          Conv2d-157           [-1, 64, 80, 80]           4,096
     BatchNorm2d-158           [-1, 64, 80, 80]             128
     ConvBNLayer-159           [-1, 64, 80, 80]               0
        CSPLayer-160           [-1, 64, 80, 80]               0
        Upsample-161         [-1, 64, 160, 160]               0
              up-162         [-1, 64, 160, 160]               0
          Conv2d-163         [-1, 16, 160, 160]           2,048
     BatchNorm2d-164         [-1, 16, 160, 160]              32
     ConvBNLayer-165         [-1, 16, 160, 160]               0
          Conv2d-166         [-1, 16, 160, 160]           2,048
     BatchNorm2d-167         [-1, 16, 160, 160]              32
     ConvBNLayer-168         [-1, 16, 160, 160]               0
          Conv2d-169         [-1, 16, 160, 160]             256
     BatchNorm2d-170         [-1, 16, 160, 160]              32
     ConvBNLayer-171         [-1, 16, 160, 160]               0
          Conv2d-172         [-1, 16, 160, 160]           2,304
     BatchNorm2d-173         [-1, 16, 160, 160]              32
     ConvBNLayer-174         [-1, 16, 160, 160]               0
DarknetBottleneck-175         [-1, 16, 160, 160]               0
          Conv2d-176         [-1, 32, 160, 160]           1,024
     BatchNorm2d-177         [-1, 32, 160, 160]              64
     ConvBNLayer-178         [-1, 32, 160, 160]               0
        CSPLayer-179         [-1, 32, 160, 160]               0
        Upsample-180         [-1, 32, 320, 320]               0
              up-181         [-1, 32, 320, 320]               0
         Dropout-182         [-1, 32, 320, 320]               0
          Conv2d-183          [-1, 1, 320, 320]              33
         Dropout-184         [-1, 32, 320, 320]               0
          Conv2d-185          [-1, 1, 320, 320]              33
         Dropout-186         [-1, 32, 320, 320]               0
          Conv2d-187          [-1, 1, 320, 320]              33
         Dropout-188         [-1, 32, 320, 320]               0
          Conv2d-189          [-1, 1, 320, 320]              33
================================================================
Total params: 598,739
Trainable params: 598,739
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.39
Forward/backward pass size (MB): 986.76
Params size (MB): 2.28
Estimated Total Size (MB): 989.43
----------------------------------------------------------------
