----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 320, 320]             640
       BatchNorm2d-2         [-1, 64, 320, 320]             128
              ReLU-3         [-1, 64, 320, 320]               0
            Conv2d-4         [-1, 64, 320, 320]          36,928
       BatchNorm2d-5         [-1, 64, 320, 320]             128
              ReLU-6         [-1, 64, 320, 320]               0
            inconv-7         [-1, 64, 320, 320]               0
         MaxPool2d-8         [-1, 64, 160, 160]               0
            Conv2d-9        [-1, 128, 160, 160]          73,856
      BatchNorm2d-10        [-1, 128, 160, 160]             256
             ReLU-11        [-1, 128, 160, 160]               0
AdaptiveAvgPool2d-12            [-1, 128, 1, 1]               0
           Conv1d-13               [-1, 1, 128]               3
          Sigmoid-14            [-1, 128, 1, 1]               0
        eca_block-15        [-1, 128, 160, 160]               0
           Conv2d-16        [-1, 128, 160, 160]           8,192
      BatchNorm2d-17        [-1, 128, 160, 160]             256
         conv_att-18        [-1, 128, 160, 160]               0
             down-19        [-1, 128, 160, 160]               0
        MaxPool2d-20          [-1, 128, 80, 80]               0
           Conv2d-21          [-1, 256, 80, 80]         295,168
      BatchNorm2d-22          [-1, 256, 80, 80]             512
             ReLU-23          [-1, 256, 80, 80]               0
AdaptiveAvgPool2d-24            [-1, 256, 1, 1]               0
           Conv1d-25               [-1, 1, 256]               5
          Sigmoid-26            [-1, 256, 1, 1]               0
        eca_block-27          [-1, 256, 80, 80]               0
           Conv2d-28          [-1, 256, 80, 80]          32,768
      BatchNorm2d-29          [-1, 256, 80, 80]             512
         conv_att-30          [-1, 256, 80, 80]               0
             down-31          [-1, 256, 80, 80]               0
        MaxPool2d-32          [-1, 256, 40, 40]               0
           Conv2d-33          [-1, 512, 40, 40]       1,180,160
      BatchNorm2d-34          [-1, 512, 40, 40]           1,024
             ReLU-35          [-1, 512, 40, 40]               0
AdaptiveAvgPool2d-36            [-1, 512, 1, 1]               0
           Conv1d-37               [-1, 1, 512]               5
          Sigmoid-38            [-1, 512, 1, 1]               0
        eca_block-39          [-1, 512, 40, 40]               0
           Conv2d-40          [-1, 512, 40, 40]         131,072
      BatchNorm2d-41          [-1, 512, 40, 40]           1,024
         conv_att-42          [-1, 512, 40, 40]               0
             down-43          [-1, 512, 40, 40]               0
        MaxPool2d-44          [-1, 512, 20, 20]               0
           Conv2d-45          [-1, 512, 20, 20]       2,359,808
      BatchNorm2d-46          [-1, 512, 20, 20]           1,024
             ReLU-47          [-1, 512, 20, 20]               0
AdaptiveAvgPool2d-48            [-1, 512, 1, 1]               0
           Conv1d-49               [-1, 1, 512]               5
          Sigmoid-50            [-1, 512, 1, 1]               0
        eca_block-51          [-1, 512, 20, 20]               0
         conv_att-52          [-1, 512, 20, 20]               0
             down-53          [-1, 512, 20, 20]               0
         Upsample-54          [-1, 512, 40, 40]               0
           Conv2d-55          [-1, 256, 40, 40]       2,359,552
      BatchNorm2d-56          [-1, 256, 40, 40]             512
             ReLU-57          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-58            [-1, 256, 1, 1]               0
           Conv1d-59               [-1, 1, 256]               5
          Sigmoid-60            [-1, 256, 1, 1]               0
        eca_block-61          [-1, 256, 40, 40]               0
           Conv2d-62          [-1, 256, 40, 40]         262,144
      BatchNorm2d-63          [-1, 256, 40, 40]             512
         conv_att-64          [-1, 256, 40, 40]               0
               up-65          [-1, 256, 40, 40]               0
         Upsample-66          [-1, 256, 80, 80]               0
           Conv2d-67          [-1, 128, 80, 80]         589,952
      BatchNorm2d-68          [-1, 128, 80, 80]             256
             ReLU-69          [-1, 128, 80, 80]               0
AdaptiveAvgPool2d-70            [-1, 128, 1, 1]               0
           Conv1d-71               [-1, 1, 128]               5
          Sigmoid-72            [-1, 128, 1, 1]               0
        eca_block-73          [-1, 128, 80, 80]               0
           Conv2d-74          [-1, 128, 80, 80]          65,536
      BatchNorm2d-75          [-1, 128, 80, 80]             256
         conv_att-76          [-1, 128, 80, 80]               0
               up-77          [-1, 128, 80, 80]               0
         Upsample-78        [-1, 128, 160, 160]               0
           Conv2d-79         [-1, 64, 160, 160]         147,520
      BatchNorm2d-80         [-1, 64, 160, 160]             128
             ReLU-81         [-1, 64, 160, 160]               0
AdaptiveAvgPool2d-82             [-1, 64, 1, 1]               0
           Conv1d-83                [-1, 1, 64]               5
          Sigmoid-84             [-1, 64, 1, 1]               0
        eca_block-85         [-1, 64, 160, 160]               0
           Conv2d-86         [-1, 64, 160, 160]          16,384
      BatchNorm2d-87         [-1, 64, 160, 160]             128
         conv_att-88         [-1, 64, 160, 160]               0
               up-89         [-1, 64, 160, 160]               0
         Upsample-90         [-1, 64, 320, 320]               0
           Conv2d-91         [-1, 32, 320, 320]          36,896
      BatchNorm2d-92         [-1, 32, 320, 320]              64
             ReLU-93         [-1, 32, 320, 320]               0
AdaptiveAvgPool2d-94             [-1, 32, 1, 1]               0
           Conv1d-95                [-1, 1, 32]               5
          Sigmoid-96             [-1, 32, 1, 1]               0
        eca_block-97         [-1, 32, 320, 320]               0
           Conv2d-98         [-1, 32, 320, 320]           4,096
      BatchNorm2d-99         [-1, 32, 320, 320]              64
        conv_att-100         [-1, 32, 320, 320]               0
              up-101         [-1, 32, 320, 320]               0
         Dropout-102         [-1, 32, 320, 320]               0
          Conv2d-103          [-1, 1, 320, 320]              33
         Dropout-104         [-1, 32, 320, 320]               0
          Conv2d-105          [-1, 1, 320, 320]              33
         Dropout-106         [-1, 32, 320, 320]               0
          Conv2d-107          [-1, 1, 320, 320]              33
         Dropout-108         [-1, 32, 320, 320]               0
          Conv2d-109          [-1, 1, 320, 320]              33
================================================================
Total params: 7,607,626
Trainable params: 7,607,626
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.39
Forward/backward pass size (MB): 1304.73
Params size (MB): 29.02
Estimated Total Size (MB): 1334.14
----------------------------------------------------------------
