----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 320, 320]           2,624
       BatchNorm2d-2         [-1, 32, 320, 320]              64
            Conv2d-3         [-1, 64, 160, 160]          32,832
       BatchNorm2d-4         [-1, 64, 160, 160]             128
            Conv2d-5          [-1, 128, 80, 80]         131,200
       BatchNorm2d-6          [-1, 128, 80, 80]             256
            Conv2d-7          [-1, 128, 80, 80]         147,584
       BatchNorm2d-8          [-1, 128, 80, 80]             256
            Conv2d-9          [-1, 128, 80, 80]         147,584
      BatchNorm2d-10          [-1, 128, 80, 80]             256
    ResidualBlock-11          [-1, 128, 80, 80]               0
           Conv2d-12          [-1, 128, 80, 80]         147,584
      BatchNorm2d-13          [-1, 128, 80, 80]             256
           Conv2d-14          [-1, 128, 80, 80]         147,584
      BatchNorm2d-15          [-1, 128, 80, 80]             256
    ResidualBlock-16          [-1, 128, 80, 80]               0
           Conv2d-17          [-1, 128, 80, 80]         147,584
      BatchNorm2d-18          [-1, 128, 80, 80]             256
           Conv2d-19          [-1, 128, 80, 80]         147,584
      BatchNorm2d-20          [-1, 128, 80, 80]             256
    ResidualBlock-21          [-1, 128, 80, 80]               0
           Conv2d-22          [-1, 128, 80, 80]         147,584
      BatchNorm2d-23          [-1, 128, 80, 80]             256
           Conv2d-24          [-1, 128, 80, 80]         147,584
      BatchNorm2d-25          [-1, 128, 80, 80]             256
    ResidualBlock-26          [-1, 128, 80, 80]               0
           Conv2d-27          [-1, 128, 80, 80]         147,584
      BatchNorm2d-28          [-1, 128, 80, 80]             256
           Conv2d-29          [-1, 128, 80, 80]         147,584
      BatchNorm2d-30          [-1, 128, 80, 80]             256
    ResidualBlock-31          [-1, 128, 80, 80]               0
  ConvTranspose2d-32         [-1, 64, 161, 161]         131,136
      BatchNorm2d-33         [-1, 64, 161, 161]             128
  ConvTranspose2d-34         [-1, 32, 321, 321]          32,800
      BatchNorm2d-35         [-1, 32, 321, 321]              64
  ConvTranspose2d-36         [-1, 32, 321, 321]          82,976
          Dropout-37         [-1, 32, 321, 321]               0
           Conv2d-38          [-1, 1, 320, 320]             129
          Dropout-39         [-1, 32, 321, 321]               0
           Conv2d-40          [-1, 1, 320, 320]             129
          Dropout-41         [-1, 32, 321, 321]               0
           Conv2d-42          [-1, 1, 320, 320]             129
          Dropout-43         [-1, 32, 321, 321]               0
           Conv2d-44          [-1, 1, 320, 320]             129
================================================================
Total params: 1,893,124
Trainable params: 1,893,124
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.39
Forward/backward pass size (MB): 448.28
Params size (MB): 7.22
Estimated Total Size (MB): 455.90
----------------------------------------------------------------
