----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 300, 300]           2,624
       BatchNorm2d-2         [-1, 32, 300, 300]              64
            Conv2d-3         [-1, 32, 150, 150]             288
       BatchNorm2d-4         [-1, 32, 150, 150]              64
         Hardswish-5         [-1, 32, 150, 150]               0
       ConvBNLayer-6         [-1, 32, 150, 150]               0
            Conv2d-7         [-1, 64, 150, 150]           2,048
       BatchNorm2d-8         [-1, 64, 150, 150]             128
         Hardswish-9         [-1, 64, 150, 150]               0
      ConvBNLayer-10         [-1, 64, 150, 150]               0
DepthwiseSeparable-11         [-1, 64, 150, 150]               0
           Conv2d-12           [-1, 64, 75, 75]             576
      BatchNorm2d-13           [-1, 64, 75, 75]             128
        Hardswish-14           [-1, 64, 75, 75]               0
      ConvBNLayer-15           [-1, 64, 75, 75]               0
           Conv2d-16          [-1, 128, 75, 75]           8,192
      BatchNorm2d-17          [-1, 128, 75, 75]             256
        Hardswish-18          [-1, 128, 75, 75]               0
      ConvBNLayer-19          [-1, 128, 75, 75]               0
DepthwiseSeparable-20          [-1, 128, 75, 75]               0
           Conv2d-21          [-1, 128, 75, 75]         147,584
      BatchNorm2d-22          [-1, 128, 75, 75]             256
           Conv2d-23          [-1, 128, 75, 75]         147,584
      BatchNorm2d-24          [-1, 128, 75, 75]             256
AdaptiveAvgPool2d-25            [-1, 128, 1, 1]               0
           Conv1d-26               [-1, 1, 128]               5
          Sigmoid-27            [-1, 128, 1, 1]               0
        eca_block-28          [-1, 128, 75, 75]               0
    ResidualBlock-29          [-1, 128, 75, 75]               0
           Conv2d-30          [-1, 128, 75, 75]         147,584
      BatchNorm2d-31          [-1, 128, 75, 75]             256
           Conv2d-32          [-1, 128, 75, 75]         147,584
      BatchNorm2d-33          [-1, 128, 75, 75]             256
AdaptiveAvgPool2d-34            [-1, 128, 1, 1]               0
           Conv1d-35               [-1, 1, 128]               5
          Sigmoid-36            [-1, 128, 1, 1]               0
        eca_block-37          [-1, 128, 75, 75]               0
    ResidualBlock-38          [-1, 128, 75, 75]               0
           Conv2d-39          [-1, 128, 75, 75]         147,584
      BatchNorm2d-40          [-1, 128, 75, 75]             256
           Conv2d-41          [-1, 128, 75, 75]         147,584
      BatchNorm2d-42          [-1, 128, 75, 75]             256
AdaptiveAvgPool2d-43            [-1, 128, 1, 1]               0
           Conv1d-44               [-1, 1, 128]               5
          Sigmoid-45            [-1, 128, 1, 1]               0
        eca_block-46          [-1, 128, 75, 75]               0
    ResidualBlock-47          [-1, 128, 75, 75]               0
           Conv2d-48          [-1, 128, 75, 75]         147,584
      BatchNorm2d-49          [-1, 128, 75, 75]             256
           Conv2d-50          [-1, 128, 75, 75]         147,584
      BatchNorm2d-51          [-1, 128, 75, 75]             256
AdaptiveAvgPool2d-52            [-1, 128, 1, 1]               0
           Conv1d-53               [-1, 1, 128]               5
          Sigmoid-54            [-1, 128, 1, 1]               0
        eca_block-55          [-1, 128, 75, 75]               0
    ResidualBlock-56          [-1, 128, 75, 75]               0
           Conv2d-57          [-1, 128, 75, 75]         147,584
      BatchNorm2d-58          [-1, 128, 75, 75]             256
           Conv2d-59          [-1, 128, 75, 75]         147,584
      BatchNorm2d-60          [-1, 128, 75, 75]             256
AdaptiveAvgPool2d-61            [-1, 128, 1, 1]               0
           Conv1d-62               [-1, 1, 128]               5
          Sigmoid-63            [-1, 128, 1, 1]               0
        eca_block-64          [-1, 128, 75, 75]               0
    ResidualBlock-65          [-1, 128, 75, 75]               0
           Conv2d-66           [-1, 64, 75, 75]          16,384
      BatchNorm2d-67           [-1, 64, 75, 75]             128
      ConvBNLayer-68           [-1, 64, 75, 75]               0
           Conv2d-69           [-1, 64, 75, 75]          16,384
      BatchNorm2d-70           [-1, 64, 75, 75]             128
      ConvBNLayer-71           [-1, 64, 75, 75]               0
           Conv2d-72           [-1, 64, 75, 75]           4,096
      BatchNorm2d-73           [-1, 64, 75, 75]             128
      ConvBNLayer-74           [-1, 64, 75, 75]               0
           Conv2d-75           [-1, 64, 75, 75]          36,864
      BatchNorm2d-76           [-1, 64, 75, 75]             128
      ConvBNLayer-77           [-1, 64, 75, 75]               0
DarknetBottleneck-78           [-1, 64, 75, 75]               0
           Conv2d-79          [-1, 128, 75, 75]          16,384
      BatchNorm2d-80          [-1, 128, 75, 75]             256
      ConvBNLayer-81          [-1, 128, 75, 75]               0
         CSPLayer-82          [-1, 128, 75, 75]               0
AdaptiveAvgPool2d-83            [-1, 128, 1, 1]               0
           Conv2d-84             [-1, 16, 1, 1]           2,048
             ReLU-85             [-1, 16, 1, 1]               0
           Conv2d-86            [-1, 128, 1, 1]           2,048
AdaptiveMaxPool2d-87            [-1, 128, 1, 1]               0
           Conv2d-88             [-1, 16, 1, 1]           2,048
             ReLU-89             [-1, 16, 1, 1]               0
           Conv2d-90            [-1, 128, 1, 1]           2,048
          Sigmoid-91            [-1, 128, 1, 1]               0
 ChannelAttention-92            [-1, 128, 1, 1]               0
           Conv2d-93            [-1, 1, 75, 75]              18
          Sigmoid-94            [-1, 1, 75, 75]               0
 SpatialAttention-95            [-1, 1, 75, 75]               0
       cbam_block-96          [-1, 128, 75, 75]               0
  ConvTranspose2d-97         [-1, 64, 150, 150]         131,136
      BatchNorm2d-98         [-1, 64, 150, 150]             128
           Conv2d-99         [-1, 32, 150, 150]           4,096
     BatchNorm2d-100         [-1, 32, 150, 150]              64
     ConvBNLayer-101         [-1, 32, 150, 150]               0
          Conv2d-102         [-1, 32, 150, 150]           4,096
     BatchNorm2d-103         [-1, 32, 150, 150]              64
     ConvBNLayer-104         [-1, 32, 150, 150]               0
          Conv2d-105         [-1, 32, 150, 150]           1,024
     BatchNorm2d-106         [-1, 32, 150, 150]              64
     ConvBNLayer-107         [-1, 32, 150, 150]               0
          Conv2d-108         [-1, 32, 150, 150]           9,216
     BatchNorm2d-109         [-1, 32, 150, 150]              64
     ConvBNLayer-110         [-1, 32, 150, 150]               0
DarknetBottleneck-111         [-1, 32, 150, 150]               0
          Conv2d-112         [-1, 64, 150, 150]           4,096
     BatchNorm2d-113         [-1, 64, 150, 150]             128
     ConvBNLayer-114         [-1, 64, 150, 150]               0
        CSPLayer-115         [-1, 64, 150, 150]               0
AdaptiveAvgPool2d-116             [-1, 64, 1, 1]               0
          Conv2d-117              [-1, 8, 1, 1]             512
            ReLU-118              [-1, 8, 1, 1]               0
          Conv2d-119             [-1, 64, 1, 1]             512
AdaptiveMaxPool2d-120             [-1, 64, 1, 1]               0
          Conv2d-121              [-1, 8, 1, 1]             512
            ReLU-122              [-1, 8, 1, 1]               0
          Conv2d-123             [-1, 64, 1, 1]             512
         Sigmoid-124             [-1, 64, 1, 1]               0
ChannelAttention-125             [-1, 64, 1, 1]               0
          Conv2d-126          [-1, 1, 150, 150]              18
         Sigmoid-127          [-1, 1, 150, 150]               0
SpatialAttention-128          [-1, 1, 150, 150]               0
      cbam_block-129         [-1, 64, 150, 150]               0
 ConvTranspose2d-130         [-1, 32, 300, 300]          32,800
     BatchNorm2d-131         [-1, 32, 300, 300]              64
          Conv2d-132         [-1, 16, 300, 300]           1,024
     BatchNorm2d-133         [-1, 16, 300, 300]              32
     ConvBNLayer-134         [-1, 16, 300, 300]               0
          Conv2d-135         [-1, 16, 300, 300]           1,024
     BatchNorm2d-136         [-1, 16, 300, 300]              32
     ConvBNLayer-137         [-1, 16, 300, 300]               0
          Conv2d-138         [-1, 16, 300, 300]             256
     BatchNorm2d-139         [-1, 16, 300, 300]              32
     ConvBNLayer-140         [-1, 16, 300, 300]               0
          Conv2d-141         [-1, 16, 300, 300]           2,304
     BatchNorm2d-142         [-1, 16, 300, 300]              32
     ConvBNLayer-143         [-1, 16, 300, 300]               0
DarknetBottleneck-144         [-1, 16, 300, 300]               0
          Conv2d-145         [-1, 32, 300, 300]           1,024
     BatchNorm2d-146         [-1, 32, 300, 300]              64
     ConvBNLayer-147         [-1, 32, 300, 300]               0
        CSPLayer-148         [-1, 32, 300, 300]               0
AdaptiveAvgPool2d-149             [-1, 32, 1, 1]               0
          Conv2d-150              [-1, 4, 1, 1]             128
            ReLU-151              [-1, 4, 1, 1]               0
          Conv2d-152             [-1, 32, 1, 1]             128
AdaptiveMaxPool2d-153             [-1, 32, 1, 1]               0
          Conv2d-154              [-1, 4, 1, 1]             128
            ReLU-155              [-1, 4, 1, 1]               0
          Conv2d-156             [-1, 32, 1, 1]             128
         Sigmoid-157             [-1, 32, 1, 1]               0
ChannelAttention-158             [-1, 32, 1, 1]               0
          Conv2d-159          [-1, 1, 300, 300]              18
         Sigmoid-160          [-1, 1, 300, 300]               0
SpatialAttention-161          [-1, 1, 300, 300]               0
      cbam_block-162         [-1, 32, 300, 300]               0
 ConvTranspose2d-163         [-1, 32, 300, 300]          82,976
          Conv2d-164          [-1, 1, 300, 300]              33
          Conv2d-165          [-1, 1, 300, 300]              33
          Conv2d-166          [-1, 1, 300, 300]              33
          Conv2d-167          [-1, 1, 300, 300]              33
================================================================
Total params: 1,870,451
Trainable params: 1,870,451
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.34
Forward/backward pass size (MB): 859.66
Params size (MB): 7.14
Estimated Total Size (MB): 867.14
----------------------------------------------------------------
