----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 300, 300]             320
       BatchNorm2d-2         [-1, 32, 300, 300]              64
            Conv2d-3         [-1, 64, 150, 150]          18,496
       BatchNorm2d-4         [-1, 64, 150, 150]             128
         MaxPool2d-5           [-1, 64, 75, 75]               0
            Conv2d-6          [-1, 128, 75, 75]          73,856
       BatchNorm2d-7          [-1, 128, 75, 75]             256
              ReLU-8          [-1, 128, 75, 75]               0
 AdaptiveAvgPool2d-9            [-1, 128, 1, 1]               0
           Conv1d-10               [-1, 1, 128]               5
          Sigmoid-11            [-1, 128, 1, 1]               0
        eca_block-12          [-1, 128, 75, 75]               0
           Conv2d-13          [-1, 128, 75, 75]           8,192
      BatchNorm2d-14          [-1, 128, 75, 75]             256
      double_conv-15          [-1, 128, 75, 75]               0
             down-16          [-1, 128, 75, 75]               0
        MaxPool2d-17          [-1, 128, 37, 37]               0
           Conv2d-18          [-1, 256, 37, 37]         295,168
      BatchNorm2d-19          [-1, 256, 37, 37]             512
             ReLU-20          [-1, 256, 37, 37]               0
AdaptiveAvgPool2d-21            [-1, 256, 1, 1]               0
           Conv1d-22               [-1, 1, 256]               5
          Sigmoid-23            [-1, 256, 1, 1]               0
        eca_block-24          [-1, 256, 37, 37]               0
           Conv2d-25          [-1, 256, 37, 37]          32,768
      BatchNorm2d-26          [-1, 256, 37, 37]             512
      double_conv-27          [-1, 256, 37, 37]               0
             down-28          [-1, 256, 37, 37]               0
        MaxPool2d-29          [-1, 256, 18, 18]               0
           Conv2d-30          [-1, 512, 18, 18]       1,180,160
      BatchNorm2d-31          [-1, 512, 18, 18]           1,024
             ReLU-32          [-1, 512, 18, 18]               0
AdaptiveAvgPool2d-33            [-1, 512, 1, 1]               0
           Conv1d-34               [-1, 1, 512]               5
          Sigmoid-35            [-1, 512, 1, 1]               0
        eca_block-36          [-1, 512, 18, 18]               0
           Conv2d-37          [-1, 512, 18, 18]         131,072
      BatchNorm2d-38          [-1, 512, 18, 18]           1,024
      double_conv-39          [-1, 512, 18, 18]               0
             down-40          [-1, 512, 18, 18]               0
        MaxPool2d-41            [-1, 512, 9, 9]               0
           Conv2d-42            [-1, 512, 9, 9]       2,359,808
      BatchNorm2d-43            [-1, 512, 9, 9]           1,024
             ReLU-44            [-1, 512, 9, 9]               0
AdaptiveAvgPool2d-45            [-1, 512, 1, 1]               0
           Conv1d-46               [-1, 1, 512]               5
          Sigmoid-47            [-1, 512, 1, 1]               0
        eca_block-48            [-1, 512, 9, 9]               0
      double_conv-49            [-1, 512, 9, 9]               0
             down-50            [-1, 512, 9, 9]               0
  ConvTranspose2d-51          [-1, 512, 18, 18]       1,049,088
           Conv2d-52          [-1, 256, 18, 18]       2,359,552
      BatchNorm2d-53          [-1, 256, 18, 18]             512
             ReLU-54          [-1, 256, 18, 18]               0
AdaptiveAvgPool2d-55            [-1, 256, 1, 1]               0
           Conv1d-56               [-1, 1, 256]               5
          Sigmoid-57            [-1, 256, 1, 1]               0
        eca_block-58          [-1, 256, 18, 18]               0
           Conv2d-59          [-1, 256, 18, 18]         262,144
      BatchNorm2d-60          [-1, 256, 18, 18]             512
      double_conv-61          [-1, 256, 18, 18]               0
               up-62          [-1, 256, 18, 18]               0
  ConvTranspose2d-63          [-1, 256, 36, 36]         262,400
           Conv2d-64          [-1, 128, 37, 37]         589,952
      BatchNorm2d-65          [-1, 128, 37, 37]             256
             ReLU-66          [-1, 128, 37, 37]               0
AdaptiveAvgPool2d-67            [-1, 128, 1, 1]               0
           Conv1d-68               [-1, 1, 128]               5
          Sigmoid-69            [-1, 128, 1, 1]               0
        eca_block-70          [-1, 128, 37, 37]               0
           Conv2d-71          [-1, 128, 37, 37]          65,536
      BatchNorm2d-72          [-1, 128, 37, 37]             256
      double_conv-73          [-1, 128, 37, 37]               0
               up-74          [-1, 128, 37, 37]               0
  ConvTranspose2d-75          [-1, 128, 74, 74]          65,664
           Conv2d-76           [-1, 64, 75, 75]         147,520
      BatchNorm2d-77           [-1, 64, 75, 75]             128
             ReLU-78           [-1, 64, 75, 75]               0
AdaptiveAvgPool2d-79             [-1, 64, 1, 1]               0
           Conv1d-80                [-1, 1, 64]               3
          Sigmoid-81             [-1, 64, 1, 1]               0
        eca_block-82           [-1, 64, 75, 75]               0
           Conv2d-83           [-1, 64, 75, 75]          16,384
      BatchNorm2d-84           [-1, 64, 75, 75]             128
      double_conv-85           [-1, 64, 75, 75]               0
               up-86           [-1, 64, 75, 75]               0
  ConvTranspose2d-87         [-1, 64, 150, 150]          16,448
           Conv2d-88         [-1, 64, 150, 150]          73,792
      BatchNorm2d-89         [-1, 64, 150, 150]             128
             ReLU-90         [-1, 64, 150, 150]               0
AdaptiveAvgPool2d-91             [-1, 64, 1, 1]               0
           Conv1d-92                [-1, 1, 64]               3
          Sigmoid-93             [-1, 64, 1, 1]               0
        eca_block-94         [-1, 64, 150, 150]               0
           Conv2d-95         [-1, 64, 150, 150]           8,192
      BatchNorm2d-96         [-1, 64, 150, 150]             128
      double_conv-97         [-1, 64, 150, 150]               0
               up-98         [-1, 64, 150, 150]               0
         Upsample-99         [-1, 64, 300, 300]               0
 ConvTranspose2d-100         [-1, 32, 300, 300]          18,464
     BatchNorm2d-101         [-1, 32, 300, 300]              64
          Conv2d-102          [-1, 1, 300, 300]              33
          Conv2d-103          [-1, 1, 300, 300]              33
          Conv2d-104          [-1, 1, 300, 300]              33
          Conv2d-105          [-1, 1, 300, 300]              33
================================================================
Total params: 9,042,056
Trainable params: 9,042,056
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.34
Forward/backward pass size (MB): 384.74
Params size (MB): 34.49
Estimated Total Size (MB): 419.58
----------------------------------------------------------------
