----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]           1,184
       BatchNorm2d-2         [-1, 32, 224, 224]              64
            Conv2d-3         [-1, 64, 112, 112]          18,496
       BatchNorm2d-4         [-1, 64, 112, 112]             128
         MaxPool2d-5           [-1, 64, 56, 56]               0
            Conv2d-6          [-1, 128, 56, 56]          73,856
       BatchNorm2d-7          [-1, 128, 56, 56]             256
              ReLU-8          [-1, 128, 56, 56]               0
 AdaptiveAvgPool2d-9            [-1, 128, 1, 1]               0
           Linear-10                   [-1, 42]           5,376
             ReLU-11                   [-1, 42]               0
           Linear-12                  [-1, 128]           5,376
          Sigmoid-13                  [-1, 128]               0
          SELayer-14          [-1, 128, 56, 56]               0
           Conv2d-15          [-1, 128, 56, 56]           8,192
      BatchNorm2d-16          [-1, 128, 56, 56]             256
      double_conv-17          [-1, 128, 56, 56]               0
             down-18          [-1, 128, 56, 56]               0
        MaxPool2d-19          [-1, 128, 28, 28]               0
           Conv2d-20          [-1, 256, 28, 28]         295,168
      BatchNorm2d-21          [-1, 256, 28, 28]             512
             ReLU-22          [-1, 256, 28, 28]               0
AdaptiveAvgPool2d-23            [-1, 256, 1, 1]               0
           Linear-24                   [-1, 85]          21,760
             ReLU-25                   [-1, 85]               0
           Linear-26                  [-1, 256]          21,760
          Sigmoid-27                  [-1, 256]               0
          SELayer-28          [-1, 256, 28, 28]               0
           Conv2d-29          [-1, 256, 28, 28]          32,768
      BatchNorm2d-30          [-1, 256, 28, 28]             512
      double_conv-31          [-1, 256, 28, 28]               0
             down-32          [-1, 256, 28, 28]               0
        MaxPool2d-33          [-1, 256, 14, 14]               0
           Conv2d-34          [-1, 512, 14, 14]       1,180,160
      BatchNorm2d-35          [-1, 512, 14, 14]           1,024
             ReLU-36          [-1, 512, 14, 14]               0
AdaptiveAvgPool2d-37            [-1, 512, 1, 1]               0
           Linear-38                  [-1, 170]          87,040
             ReLU-39                  [-1, 170]               0
           Linear-40                  [-1, 512]          87,040
          Sigmoid-41                  [-1, 512]               0
          SELayer-42          [-1, 512, 14, 14]               0
           Conv2d-43          [-1, 512, 14, 14]         131,072
      BatchNorm2d-44          [-1, 512, 14, 14]           1,024
      double_conv-45          [-1, 512, 14, 14]               0
             down-46          [-1, 512, 14, 14]               0
        MaxPool2d-47            [-1, 512, 7, 7]               0
           Conv2d-48            [-1, 512, 7, 7]       2,359,808
      BatchNorm2d-49            [-1, 512, 7, 7]           1,024
             ReLU-50            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-51            [-1, 512, 1, 1]               0
           Linear-52                  [-1, 170]          87,040
             ReLU-53                  [-1, 170]               0
           Linear-54                  [-1, 512]          87,040
          Sigmoid-55                  [-1, 512]               0
          SELayer-56            [-1, 512, 7, 7]               0
      double_conv-57            [-1, 512, 7, 7]               0
             down-58            [-1, 512, 7, 7]               0
  ConvTranspose2d-59          [-1, 512, 14, 14]       1,049,088
           Conv2d-60          [-1, 256, 14, 14]       2,359,552
      BatchNorm2d-61          [-1, 256, 14, 14]             512
             ReLU-62          [-1, 256, 14, 14]               0
AdaptiveAvgPool2d-63            [-1, 256, 1, 1]               0
           Linear-64                   [-1, 85]          21,760
             ReLU-65                   [-1, 85]               0
           Linear-66                  [-1, 256]          21,760
          Sigmoid-67                  [-1, 256]               0
          SELayer-68          [-1, 256, 14, 14]               0
           Conv2d-69          [-1, 256, 14, 14]         262,144
      BatchNorm2d-70          [-1, 256, 14, 14]             512
      double_conv-71          [-1, 256, 14, 14]               0
               up-72          [-1, 256, 14, 14]               0
  ConvTranspose2d-73          [-1, 256, 28, 28]         262,400
           Conv2d-74          [-1, 128, 28, 28]         589,952
      BatchNorm2d-75          [-1, 128, 28, 28]             256
             ReLU-76          [-1, 128, 28, 28]               0
AdaptiveAvgPool2d-77            [-1, 128, 1, 1]               0
           Linear-78                   [-1, 42]           5,376
             ReLU-79                   [-1, 42]               0
           Linear-80                  [-1, 128]           5,376
          Sigmoid-81                  [-1, 128]               0
          SELayer-82          [-1, 128, 28, 28]               0
           Conv2d-83          [-1, 128, 28, 28]          65,536
      BatchNorm2d-84          [-1, 128, 28, 28]             256
      double_conv-85          [-1, 128, 28, 28]               0
               up-86          [-1, 128, 28, 28]               0
  ConvTranspose2d-87          [-1, 128, 56, 56]          65,664
           Conv2d-88           [-1, 64, 56, 56]         147,520
      BatchNorm2d-89           [-1, 64, 56, 56]             128
             ReLU-90           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-91             [-1, 64, 1, 1]               0
           Linear-92                   [-1, 21]           1,344
             ReLU-93                   [-1, 21]               0
           Linear-94                   [-1, 64]           1,344
          Sigmoid-95                   [-1, 64]               0
          SELayer-96           [-1, 64, 56, 56]               0
           Conv2d-97           [-1, 64, 56, 56]          16,384
      BatchNorm2d-98           [-1, 64, 56, 56]             128
      double_conv-99           [-1, 64, 56, 56]               0
              up-100           [-1, 64, 56, 56]               0
 ConvTranspose2d-101         [-1, 64, 112, 112]          16,448
          Conv2d-102         [-1, 64, 112, 112]          73,792
     BatchNorm2d-103         [-1, 64, 112, 112]             128
            ReLU-104         [-1, 64, 112, 112]               0
AdaptiveAvgPool2d-105             [-1, 64, 1, 1]               0
          Linear-106                   [-1, 21]           1,344
            ReLU-107                   [-1, 21]               0
          Linear-108                   [-1, 64]           1,344
         Sigmoid-109                   [-1, 64]               0
         SELayer-110         [-1, 64, 112, 112]               0
          Conv2d-111         [-1, 64, 112, 112]           8,192
     BatchNorm2d-112         [-1, 64, 112, 112]             128
     double_conv-113         [-1, 64, 112, 112]               0
              up-114         [-1, 64, 112, 112]               0
        Upsample-115         [-1, 64, 224, 224]               0
 ConvTranspose2d-116         [-1, 32, 224, 224]          18,464
     BatchNorm2d-117         [-1, 32, 224, 224]              64
         Dropout-118         [-1, 32, 224, 224]               0
          Conv2d-119          [-1, 1, 224, 224]              33
         Dropout-120         [-1, 32, 224, 224]               0
          Conv2d-121          [-1, 1, 224, 224]              33
         Dropout-122         [-1, 32, 224, 224]               0
          Conv2d-123          [-1, 1, 224, 224]              33
         Dropout-124         [-1, 32, 224, 224]               0
          Conv2d-125          [-1, 1, 224, 224]              33
================================================================
Total params: 9,504,964
Trainable params: 9,504,964
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 265.15
Params size (MB): 36.26
Estimated Total Size (MB): 302.18
----------------------------------------------------------------
