----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 320, 320]             288
       BatchNorm2d-2         [-1, 32, 320, 320]              64
       ConvBNLayer-3         [-1, 32, 320, 320]               0
            Conv2d-4         [-1, 32, 320, 320]             288
       BatchNorm2d-5         [-1, 32, 320, 320]              64
       ConvBNLayer-6         [-1, 32, 320, 320]               0
 AdaptiveAvgPool2d-7           [-1, 32, 320, 1]               0
 AdaptiveAvgPool2d-8           [-1, 32, 1, 320]               0
            Conv2d-9            [-1, 8, 640, 1]             264
      BatchNorm2d-10            [-1, 8, 640, 1]              16
            ReLU6-11            [-1, 8, 640, 1]               0
        h_sigmoid-12            [-1, 8, 640, 1]               0
          h_swish-13            [-1, 8, 640, 1]               0
           Conv2d-14           [-1, 32, 320, 1]             288
           Conv2d-15           [-1, 32, 1, 320]             288
         CoordAtt-16         [-1, 32, 320, 320]               0
           Conv2d-17         [-1, 32, 320, 320]           1,024
      BatchNorm2d-18         [-1, 32, 320, 320]              64
      ConvBNLayer-19         [-1, 32, 320, 320]               0
DepthwiseSeparable-20         [-1, 32, 320, 320]               0
           Conv2d-21         [-1, 32, 160, 160]             288
      BatchNorm2d-22         [-1, 32, 160, 160]              64
      ConvBNLayer-23         [-1, 32, 160, 160]               0
AdaptiveAvgPool2d-24           [-1, 32, 160, 1]               0
AdaptiveAvgPool2d-25           [-1, 32, 1, 160]               0
           Conv2d-26            [-1, 8, 320, 1]             264
      BatchNorm2d-27            [-1, 8, 320, 1]              16
            ReLU6-28            [-1, 8, 320, 1]               0
        h_sigmoid-29            [-1, 8, 320, 1]               0
          h_swish-30            [-1, 8, 320, 1]               0
           Conv2d-31           [-1, 32, 160, 1]             288
           Conv2d-32           [-1, 32, 1, 160]             288
         CoordAtt-33         [-1, 32, 160, 160]               0
           Conv2d-34         [-1, 64, 160, 160]           2,048
      BatchNorm2d-35         [-1, 64, 160, 160]             128
      ConvBNLayer-36         [-1, 64, 160, 160]               0
DepthwiseSeparable-37         [-1, 64, 160, 160]               0
           Conv2d-38         [-1, 64, 160, 160]             576
      BatchNorm2d-39         [-1, 64, 160, 160]             128
      ConvBNLayer-40         [-1, 64, 160, 160]               0
AdaptiveAvgPool2d-41           [-1, 64, 160, 1]               0
AdaptiveAvgPool2d-42           [-1, 64, 1, 160]               0
           Conv2d-43            [-1, 8, 320, 1]             520
      BatchNorm2d-44            [-1, 8, 320, 1]              16
            ReLU6-45            [-1, 8, 320, 1]               0
        h_sigmoid-46            [-1, 8, 320, 1]               0
          h_swish-47            [-1, 8, 320, 1]               0
           Conv2d-48           [-1, 64, 160, 1]             576
           Conv2d-49           [-1, 64, 1, 160]             576
         CoordAtt-50         [-1, 64, 160, 160]               0
           Conv2d-51         [-1, 64, 160, 160]           4,096
      BatchNorm2d-52         [-1, 64, 160, 160]             128
      ConvBNLayer-53         [-1, 64, 160, 160]               0
DepthwiseSeparable-54         [-1, 64, 160, 160]               0
           Conv2d-55           [-1, 64, 80, 80]             576
      BatchNorm2d-56           [-1, 64, 80, 80]             128
      ConvBNLayer-57           [-1, 64, 80, 80]               0
AdaptiveAvgPool2d-58            [-1, 64, 80, 1]               0
AdaptiveAvgPool2d-59            [-1, 64, 1, 80]               0
           Conv2d-60            [-1, 8, 160, 1]             520
      BatchNorm2d-61            [-1, 8, 160, 1]              16
            ReLU6-62            [-1, 8, 160, 1]               0
        h_sigmoid-63            [-1, 8, 160, 1]               0
          h_swish-64            [-1, 8, 160, 1]               0
           Conv2d-65            [-1, 64, 80, 1]             576
           Conv2d-66            [-1, 64, 1, 80]             576
         CoordAtt-67           [-1, 64, 80, 80]               0
           Conv2d-68          [-1, 128, 80, 80]           8,192
      BatchNorm2d-69          [-1, 128, 80, 80]             256
      ConvBNLayer-70          [-1, 128, 80, 80]               0
DepthwiseSeparable-71          [-1, 128, 80, 80]               0
           Conv2d-72          [-1, 128, 80, 80]           1,152
      BatchNorm2d-73          [-1, 128, 80, 80]             256
      ConvBNLayer-74          [-1, 128, 80, 80]               0
AdaptiveAvgPool2d-75           [-1, 128, 80, 1]               0
AdaptiveAvgPool2d-76           [-1, 128, 1, 80]               0
           Conv2d-77            [-1, 8, 160, 1]           1,032
      BatchNorm2d-78            [-1, 8, 160, 1]              16
            ReLU6-79            [-1, 8, 160, 1]               0
        h_sigmoid-80            [-1, 8, 160, 1]               0
          h_swish-81            [-1, 8, 160, 1]               0
           Conv2d-82           [-1, 128, 80, 1]           1,152
           Conv2d-83           [-1, 128, 1, 80]           1,152
         CoordAtt-84          [-1, 128, 80, 80]               0
           Conv2d-85          [-1, 128, 80, 80]          16,384
      BatchNorm2d-86          [-1, 128, 80, 80]             256
      ConvBNLayer-87          [-1, 128, 80, 80]               0
DepthwiseSeparable-88          [-1, 128, 80, 80]               0
           Conv2d-89          [-1, 128, 40, 40]           1,152
      BatchNorm2d-90          [-1, 128, 40, 40]             256
      ConvBNLayer-91          [-1, 128, 40, 40]               0
AdaptiveAvgPool2d-92           [-1, 128, 40, 1]               0
AdaptiveAvgPool2d-93           [-1, 128, 1, 40]               0
           Conv2d-94             [-1, 8, 80, 1]           1,032
      BatchNorm2d-95             [-1, 8, 80, 1]              16
            ReLU6-96             [-1, 8, 80, 1]               0
        h_sigmoid-97             [-1, 8, 80, 1]               0
          h_swish-98             [-1, 8, 80, 1]               0
           Conv2d-99           [-1, 128, 40, 1]           1,152
          Conv2d-100           [-1, 128, 1, 40]           1,152
        CoordAtt-101          [-1, 128, 40, 40]               0
          Conv2d-102          [-1, 256, 40, 40]          32,768
     BatchNorm2d-103          [-1, 256, 40, 40]             512
     ConvBNLayer-104          [-1, 256, 40, 40]               0
DepthwiseSeparable-105          [-1, 256, 40, 40]               0
          Conv2d-106          [-1, 256, 40, 40]           6,400
     BatchNorm2d-107          [-1, 256, 40, 40]             512
     ConvBNLayer-108          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-109           [-1, 256, 40, 1]               0
AdaptiveAvgPool2d-110           [-1, 256, 1, 40]               0
          Conv2d-111             [-1, 8, 80, 1]           2,056
     BatchNorm2d-112             [-1, 8, 80, 1]              16
           ReLU6-113             [-1, 8, 80, 1]               0
       h_sigmoid-114             [-1, 8, 80, 1]               0
         h_swish-115             [-1, 8, 80, 1]               0
          Conv2d-116           [-1, 256, 40, 1]           2,304
          Conv2d-117           [-1, 256, 1, 40]           2,304
        CoordAtt-118          [-1, 256, 40, 40]               0
          Conv2d-119          [-1, 256, 40, 40]          65,536
     BatchNorm2d-120          [-1, 256, 40, 40]             512
     ConvBNLayer-121          [-1, 256, 40, 40]               0
DepthwiseSeparable-122          [-1, 256, 40, 40]               0
          Conv2d-123          [-1, 256, 40, 40]           6,400
     BatchNorm2d-124          [-1, 256, 40, 40]             512
     ConvBNLayer-125          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-126           [-1, 256, 40, 1]               0
AdaptiveAvgPool2d-127           [-1, 256, 1, 40]               0
          Conv2d-128             [-1, 8, 80, 1]           2,056
     BatchNorm2d-129             [-1, 8, 80, 1]              16
           ReLU6-130             [-1, 8, 80, 1]               0
       h_sigmoid-131             [-1, 8, 80, 1]               0
         h_swish-132             [-1, 8, 80, 1]               0
          Conv2d-133           [-1, 256, 40, 1]           2,304
          Conv2d-134           [-1, 256, 1, 40]           2,304
        CoordAtt-135          [-1, 256, 40, 40]               0
          Conv2d-136          [-1, 256, 40, 40]          65,536
     BatchNorm2d-137          [-1, 256, 40, 40]             512
     ConvBNLayer-138          [-1, 256, 40, 40]               0
DepthwiseSeparable-139          [-1, 256, 40, 40]               0
          Conv2d-140          [-1, 256, 40, 40]           6,400
     BatchNorm2d-141          [-1, 256, 40, 40]             512
     ConvBNLayer-142          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-143           [-1, 256, 40, 1]               0
AdaptiveAvgPool2d-144           [-1, 256, 1, 40]               0
          Conv2d-145             [-1, 8, 80, 1]           2,056
     BatchNorm2d-146             [-1, 8, 80, 1]              16
           ReLU6-147             [-1, 8, 80, 1]               0
       h_sigmoid-148             [-1, 8, 80, 1]               0
         h_swish-149             [-1, 8, 80, 1]               0
          Conv2d-150           [-1, 256, 40, 1]           2,304
          Conv2d-151           [-1, 256, 1, 40]           2,304
        CoordAtt-152          [-1, 256, 40, 40]               0
          Conv2d-153          [-1, 256, 40, 40]          65,536
     BatchNorm2d-154          [-1, 256, 40, 40]             512
     ConvBNLayer-155          [-1, 256, 40, 40]               0
DepthwiseSeparable-156          [-1, 256, 40, 40]               0
          Conv2d-157          [-1, 256, 40, 40]           6,400
     BatchNorm2d-158          [-1, 256, 40, 40]             512
     ConvBNLayer-159          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-160           [-1, 256, 40, 1]               0
AdaptiveAvgPool2d-161           [-1, 256, 1, 40]               0
          Conv2d-162             [-1, 8, 80, 1]           2,056
     BatchNorm2d-163             [-1, 8, 80, 1]              16
           ReLU6-164             [-1, 8, 80, 1]               0
       h_sigmoid-165             [-1, 8, 80, 1]               0
         h_swish-166             [-1, 8, 80, 1]               0
          Conv2d-167           [-1, 256, 40, 1]           2,304
          Conv2d-168           [-1, 256, 1, 40]           2,304
        CoordAtt-169          [-1, 256, 40, 40]               0
          Conv2d-170          [-1, 256, 40, 40]          65,536
     BatchNorm2d-171          [-1, 256, 40, 40]             512
     ConvBNLayer-172          [-1, 256, 40, 40]               0
DepthwiseSeparable-173          [-1, 256, 40, 40]               0
          Conv2d-174          [-1, 256, 40, 40]           6,400
     BatchNorm2d-175          [-1, 256, 40, 40]             512
     ConvBNLayer-176          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-177           [-1, 256, 40, 1]               0
AdaptiveAvgPool2d-178           [-1, 256, 1, 40]               0
          Conv2d-179             [-1, 8, 80, 1]           2,056
     BatchNorm2d-180             [-1, 8, 80, 1]              16
           ReLU6-181             [-1, 8, 80, 1]               0
       h_sigmoid-182             [-1, 8, 80, 1]               0
         h_swish-183             [-1, 8, 80, 1]               0
          Conv2d-184           [-1, 256, 40, 1]           2,304
          Conv2d-185           [-1, 256, 1, 40]           2,304
        CoordAtt-186          [-1, 256, 40, 40]               0
          Conv2d-187          [-1, 256, 40, 40]          65,536
     BatchNorm2d-188          [-1, 256, 40, 40]             512
     ConvBNLayer-189          [-1, 256, 40, 40]               0
DepthwiseSeparable-190          [-1, 256, 40, 40]               0
          Conv2d-191           [-1, 64, 40, 40]          32,768
     BatchNorm2d-192           [-1, 64, 40, 40]             128
     ConvBNLayer-193           [-1, 64, 40, 40]               0
          Conv2d-194           [-1, 64, 40, 40]          32,768
     BatchNorm2d-195           [-1, 64, 40, 40]             128
     ConvBNLayer-196           [-1, 64, 40, 40]               0
          Conv2d-197           [-1, 64, 40, 40]           4,096
     BatchNorm2d-198           [-1, 64, 40, 40]             128
     ConvBNLayer-199           [-1, 64, 40, 40]               0
          Conv2d-200           [-1, 64, 40, 40]          36,864
     BatchNorm2d-201           [-1, 64, 40, 40]             128
     ConvBNLayer-202           [-1, 64, 40, 40]               0
DarknetBottleneck-203           [-1, 64, 40, 40]               0
          Conv2d-204           [-1, 64, 40, 40]           4,096
     BatchNorm2d-205           [-1, 64, 40, 40]             128
     ConvBNLayer-206           [-1, 64, 40, 40]               0
          Conv2d-207           [-1, 64, 40, 40]          36,864
     BatchNorm2d-208           [-1, 64, 40, 40]             128
     ConvBNLayer-209           [-1, 64, 40, 40]               0
DarknetBottleneck-210           [-1, 64, 40, 40]               0
          Conv2d-211           [-1, 64, 40, 40]           4,096
     BatchNorm2d-212           [-1, 64, 40, 40]             128
     ConvBNLayer-213           [-1, 64, 40, 40]               0
          Conv2d-214           [-1, 64, 40, 40]          36,864
     BatchNorm2d-215           [-1, 64, 40, 40]             128
     ConvBNLayer-216           [-1, 64, 40, 40]               0
DarknetBottleneck-217           [-1, 64, 40, 40]               0
          Conv2d-218          [-1, 128, 40, 40]          16,384
     BatchNorm2d-219          [-1, 128, 40, 40]             256
     ConvBNLayer-220          [-1, 128, 40, 40]               0
        CSPLayer-221          [-1, 128, 40, 40]               0
        Upsample-222          [-1, 128, 80, 80]               0
              up-223          [-1, 128, 80, 80]               0
          Conv2d-224           [-1, 32, 80, 80]           8,192
     BatchNorm2d-225           [-1, 32, 80, 80]              64
     ConvBNLayer-226           [-1, 32, 80, 80]               0
          Conv2d-227           [-1, 32, 80, 80]           8,192
     BatchNorm2d-228           [-1, 32, 80, 80]              64
     ConvBNLayer-229           [-1, 32, 80, 80]               0
          Conv2d-230           [-1, 32, 80, 80]           1,024
     BatchNorm2d-231           [-1, 32, 80, 80]              64
     ConvBNLayer-232           [-1, 32, 80, 80]               0
          Conv2d-233           [-1, 32, 80, 80]           9,216
     BatchNorm2d-234           [-1, 32, 80, 80]              64
     ConvBNLayer-235           [-1, 32, 80, 80]               0
DarknetBottleneck-236           [-1, 32, 80, 80]               0
          Conv2d-237           [-1, 32, 80, 80]           1,024
     BatchNorm2d-238           [-1, 32, 80, 80]              64
     ConvBNLayer-239           [-1, 32, 80, 80]               0
          Conv2d-240           [-1, 32, 80, 80]           9,216
     BatchNorm2d-241           [-1, 32, 80, 80]              64
     ConvBNLayer-242           [-1, 32, 80, 80]               0
DarknetBottleneck-243           [-1, 32, 80, 80]               0
          Conv2d-244           [-1, 64, 80, 80]           4,096
     BatchNorm2d-245           [-1, 64, 80, 80]             128
     ConvBNLayer-246           [-1, 64, 80, 80]               0
        CSPLayer-247           [-1, 64, 80, 80]               0
        Upsample-248         [-1, 64, 160, 160]               0
              up-249         [-1, 64, 160, 160]               0
          Conv2d-250         [-1, 16, 160, 160]           2,048
     BatchNorm2d-251         [-1, 16, 160, 160]              32
     ConvBNLayer-252         [-1, 16, 160, 160]               0
          Conv2d-253         [-1, 16, 160, 160]           2,048
     BatchNorm2d-254         [-1, 16, 160, 160]              32
     ConvBNLayer-255         [-1, 16, 160, 160]               0
          Conv2d-256         [-1, 16, 160, 160]             256
     BatchNorm2d-257         [-1, 16, 160, 160]              32
     ConvBNLayer-258         [-1, 16, 160, 160]               0
          Conv2d-259         [-1, 16, 160, 160]           2,304
     BatchNorm2d-260         [-1, 16, 160, 160]              32
     ConvBNLayer-261         [-1, 16, 160, 160]               0
DarknetBottleneck-262         [-1, 16, 160, 160]               0
          Conv2d-263         [-1, 16, 160, 160]             256
     BatchNorm2d-264         [-1, 16, 160, 160]              32
     ConvBNLayer-265         [-1, 16, 160, 160]               0
          Conv2d-266         [-1, 16, 160, 160]           2,304
     BatchNorm2d-267         [-1, 16, 160, 160]              32
     ConvBNLayer-268         [-1, 16, 160, 160]               0
DarknetBottleneck-269         [-1, 16, 160, 160]               0
          Conv2d-270         [-1, 32, 160, 160]           1,024
     BatchNorm2d-271         [-1, 32, 160, 160]              64
     ConvBNLayer-272         [-1, 32, 160, 160]               0
        CSPLayer-273         [-1, 32, 160, 160]               0
        Upsample-274         [-1, 32, 320, 320]               0
              up-275         [-1, 32, 320, 320]               0
         Dropout-276         [-1, 32, 320, 320]               0
          Conv2d-277          [-1, 1, 320, 320]              33
         Dropout-278         [-1, 32, 320, 320]               0
          Conv2d-279          [-1, 1, 320, 320]              33
         Dropout-280         [-1, 32, 320, 320]               0
          Conv2d-281          [-1, 1, 320, 320]              33
         Dropout-282         [-1, 32, 320, 320]               0
          Conv2d-283          [-1, 1, 320, 320]              33
================================================================
Total params: 739,308
Trainable params: 739,308
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.39
Forward/backward pass size (MB): 1034.07
Params size (MB): 2.82
Estimated Total Size (MB): 1037.28
----------------------------------------------------------------
