----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 320, 320]           1,568
       BatchNorm2d-2         [-1, 32, 320, 320]              64
       ConvBNLayer-3         [-1, 32, 320, 320]               0
            Conv2d-4         [-1, 32, 160, 160]             288
       BatchNorm2d-5         [-1, 32, 160, 160]              64
       ConvBNLayer-6         [-1, 32, 160, 160]               0
 AdaptiveAvgPool2d-7           [-1, 32, 160, 1]               0
 AdaptiveAvgPool2d-8           [-1, 32, 1, 160]               0
            Conv2d-9            [-1, 8, 320, 1]             264
      BatchNorm2d-10            [-1, 8, 320, 1]              16
            ReLU6-11            [-1, 8, 320, 1]               0
        h_sigmoid-12            [-1, 8, 320, 1]               0
          h_swish-13            [-1, 8, 320, 1]               0
           Conv2d-14           [-1, 32, 160, 1]             288
           Conv2d-15           [-1, 32, 1, 160]             288
         CoordAtt-16         [-1, 32, 160, 160]               0
           Conv2d-17         [-1, 64, 160, 160]           2,048
      BatchNorm2d-18         [-1, 64, 160, 160]             128
      ConvBNLayer-19         [-1, 64, 160, 160]               0
DepthwiseSeparable-20         [-1, 64, 160, 160]               0
           Conv2d-21         [-1, 64, 160, 160]             576
      BatchNorm2d-22         [-1, 64, 160, 160]             128
      ConvBNLayer-23         [-1, 64, 160, 160]               0
AdaptiveAvgPool2d-24           [-1, 64, 160, 1]               0
AdaptiveAvgPool2d-25           [-1, 64, 1, 160]               0
           Conv2d-26            [-1, 8, 320, 1]             520
      BatchNorm2d-27            [-1, 8, 320, 1]              16
            ReLU6-28            [-1, 8, 320, 1]               0
        h_sigmoid-29            [-1, 8, 320, 1]               0
          h_swish-30            [-1, 8, 320, 1]               0
           Conv2d-31           [-1, 64, 160, 1]             576
           Conv2d-32           [-1, 64, 1, 160]             576
         CoordAtt-33         [-1, 64, 160, 160]               0
           Conv2d-34         [-1, 64, 160, 160]           4,096
      BatchNorm2d-35         [-1, 64, 160, 160]             128
      ConvBNLayer-36         [-1, 64, 160, 160]               0
DepthwiseSeparable-37         [-1, 64, 160, 160]               0
           Conv2d-38           [-1, 64, 80, 80]             576
      BatchNorm2d-39           [-1, 64, 80, 80]             128
      ConvBNLayer-40           [-1, 64, 80, 80]               0
AdaptiveAvgPool2d-41            [-1, 64, 80, 1]               0
AdaptiveAvgPool2d-42            [-1, 64, 1, 80]               0
           Conv2d-43            [-1, 8, 160, 1]             520
      BatchNorm2d-44            [-1, 8, 160, 1]              16
            ReLU6-45            [-1, 8, 160, 1]               0
        h_sigmoid-46            [-1, 8, 160, 1]               0
          h_swish-47            [-1, 8, 160, 1]               0
           Conv2d-48            [-1, 64, 80, 1]             576
           Conv2d-49            [-1, 64, 1, 80]             576
         CoordAtt-50           [-1, 64, 80, 80]               0
           Conv2d-51          [-1, 128, 80, 80]           8,192
      BatchNorm2d-52          [-1, 128, 80, 80]             256
      ConvBNLayer-53          [-1, 128, 80, 80]               0
DepthwiseSeparable-54          [-1, 128, 80, 80]               0
           Conv2d-55          [-1, 128, 80, 80]           1,152
      BatchNorm2d-56          [-1, 128, 80, 80]             256
      ConvBNLayer-57          [-1, 128, 80, 80]               0
AdaptiveAvgPool2d-58           [-1, 128, 80, 1]               0
AdaptiveAvgPool2d-59           [-1, 128, 1, 80]               0
           Conv2d-60            [-1, 8, 160, 1]           1,032
      BatchNorm2d-61            [-1, 8, 160, 1]              16
            ReLU6-62            [-1, 8, 160, 1]               0
        h_sigmoid-63            [-1, 8, 160, 1]               0
          h_swish-64            [-1, 8, 160, 1]               0
           Conv2d-65           [-1, 128, 80, 1]           1,152
           Conv2d-66           [-1, 128, 1, 80]           1,152
         CoordAtt-67          [-1, 128, 80, 80]               0
           Conv2d-68          [-1, 128, 80, 80]          16,384
      BatchNorm2d-69          [-1, 128, 80, 80]             256
      ConvBNLayer-70          [-1, 128, 80, 80]               0
DepthwiseSeparable-71          [-1, 128, 80, 80]               0
           Conv2d-72          [-1, 128, 40, 40]           1,152
      BatchNorm2d-73          [-1, 128, 40, 40]             256
      ConvBNLayer-74          [-1, 128, 40, 40]               0
AdaptiveAvgPool2d-75           [-1, 128, 40, 1]               0
AdaptiveAvgPool2d-76           [-1, 128, 1, 40]               0
           Conv2d-77             [-1, 8, 80, 1]           1,032
      BatchNorm2d-78             [-1, 8, 80, 1]              16
            ReLU6-79             [-1, 8, 80, 1]               0
        h_sigmoid-80             [-1, 8, 80, 1]               0
          h_swish-81             [-1, 8, 80, 1]               0
           Conv2d-82           [-1, 128, 40, 1]           1,152
           Conv2d-83           [-1, 128, 1, 40]           1,152
         CoordAtt-84          [-1, 128, 40, 40]               0
           Conv2d-85          [-1, 256, 40, 40]          32,768
      BatchNorm2d-86          [-1, 256, 40, 40]             512
      ConvBNLayer-87          [-1, 256, 40, 40]               0
DepthwiseSeparable-88          [-1, 256, 40, 40]               0
           Conv2d-89          [-1, 256, 40, 40]           2,304
      BatchNorm2d-90          [-1, 256, 40, 40]             512
      ConvBNLayer-91          [-1, 256, 40, 40]               0
AdaptiveAvgPool2d-92           [-1, 256, 40, 1]               0
AdaptiveAvgPool2d-93           [-1, 256, 1, 40]               0
           Conv2d-94             [-1, 8, 80, 1]           2,056
      BatchNorm2d-95             [-1, 8, 80, 1]              16
            ReLU6-96             [-1, 8, 80, 1]               0
        h_sigmoid-97             [-1, 8, 80, 1]               0
          h_swish-98             [-1, 8, 80, 1]               0
           Conv2d-99           [-1, 256, 40, 1]           2,304
          Conv2d-100           [-1, 256, 1, 40]           2,304
        CoordAtt-101          [-1, 256, 40, 40]               0
          Conv2d-102          [-1, 256, 40, 40]          65,536
     BatchNorm2d-103          [-1, 256, 40, 40]             512
     ConvBNLayer-104          [-1, 256, 40, 40]               0
DepthwiseSeparable-105          [-1, 256, 40, 40]               0
          Conv2d-106          [-1, 256, 20, 20]           6,400
     BatchNorm2d-107          [-1, 256, 20, 20]             512
     ConvBNLayer-108          [-1, 256, 20, 20]               0
AdaptiveAvgPool2d-109           [-1, 256, 20, 1]               0
AdaptiveAvgPool2d-110           [-1, 256, 1, 20]               0
          Conv2d-111             [-1, 8, 40, 1]           2,056
     BatchNorm2d-112             [-1, 8, 40, 1]              16
           ReLU6-113             [-1, 8, 40, 1]               0
       h_sigmoid-114             [-1, 8, 40, 1]               0
         h_swish-115             [-1, 8, 40, 1]               0
          Conv2d-116           [-1, 256, 20, 1]           2,304
          Conv2d-117           [-1, 256, 1, 20]           2,304
        CoordAtt-118          [-1, 256, 20, 20]               0
          Conv2d-119          [-1, 512, 20, 20]         131,072
     BatchNorm2d-120          [-1, 512, 20, 20]           1,024
     ConvBNLayer-121          [-1, 512, 20, 20]               0
DepthwiseSeparable-122          [-1, 512, 20, 20]               0
          Conv2d-123          [-1, 512, 20, 20]          12,800
     BatchNorm2d-124          [-1, 512, 20, 20]           1,024
     ConvBNLayer-125          [-1, 512, 20, 20]               0
AdaptiveAvgPool2d-126           [-1, 512, 20, 1]               0
AdaptiveAvgPool2d-127           [-1, 512, 1, 20]               0
          Conv2d-128            [-1, 16, 40, 1]           8,208
     BatchNorm2d-129            [-1, 16, 40, 1]              32
           ReLU6-130            [-1, 16, 40, 1]               0
       h_sigmoid-131            [-1, 16, 40, 1]               0
         h_swish-132            [-1, 16, 40, 1]               0
          Conv2d-133           [-1, 512, 20, 1]           8,704
          Conv2d-134           [-1, 512, 1, 20]           8,704
        CoordAtt-135          [-1, 512, 20, 20]               0
          Conv2d-136          [-1, 512, 20, 20]         262,144
     BatchNorm2d-137          [-1, 512, 20, 20]           1,024
     ConvBNLayer-138          [-1, 512, 20, 20]               0
DepthwiseSeparable-139          [-1, 512, 20, 20]               0
          Conv2d-140          [-1, 256, 20, 20]         131,072
     BatchNorm2d-141          [-1, 256, 20, 20]             512
     ConvBNLayer-142          [-1, 256, 20, 20]               0
        Upsample-143          [-1, 256, 40, 40]               0
              up-144          [-1, 256, 40, 40]               0
          Conv2d-145          [-1, 128, 40, 40]          32,768
     BatchNorm2d-146          [-1, 128, 40, 40]             256
     ConvBNLayer-147          [-1, 128, 40, 40]               0
        Upsample-148          [-1, 128, 80, 80]               0
              up-149          [-1, 128, 80, 80]               0
          Conv2d-150           [-1, 64, 80, 80]           8,192
     BatchNorm2d-151           [-1, 64, 80, 80]             128
     ConvBNLayer-152           [-1, 64, 80, 80]               0
        Upsample-153         [-1, 64, 160, 160]               0
              up-154         [-1, 64, 160, 160]               0
          Conv2d-155         [-1, 32, 160, 160]           2,048
     BatchNorm2d-156         [-1, 32, 160, 160]              64
     ConvBNLayer-157         [-1, 32, 160, 160]               0
          Conv2d-158         [-1, 32, 160, 160]           2,048
     BatchNorm2d-159         [-1, 32, 160, 160]              64
     ConvBNLayer-160         [-1, 32, 160, 160]               0
          Conv2d-161         [-1, 32, 160, 160]           1,024
     BatchNorm2d-162         [-1, 32, 160, 160]              64
     ConvBNLayer-163         [-1, 32, 160, 160]               0
          Conv2d-164         [-1, 32, 160, 160]           9,216
     BatchNorm2d-165         [-1, 32, 160, 160]              64
     ConvBNLayer-166         [-1, 32, 160, 160]               0
DarknetBottleneck-167         [-1, 32, 160, 160]               0
          Conv2d-168         [-1, 64, 160, 160]           4,096
     BatchNorm2d-169         [-1, 64, 160, 160]             128
     ConvBNLayer-170         [-1, 64, 160, 160]               0
        CSPLayer-171         [-1, 64, 160, 160]               0
          Conv2d-172           [-1, 32, 80, 80]           4,096
     BatchNorm2d-173           [-1, 32, 80, 80]              64
     ConvBNLayer-174           [-1, 32, 80, 80]               0
          Conv2d-175           [-1, 32, 80, 80]           4,096
     BatchNorm2d-176           [-1, 32, 80, 80]              64
     ConvBNLayer-177           [-1, 32, 80, 80]               0
          Conv2d-178           [-1, 32, 80, 80]           1,024
     BatchNorm2d-179           [-1, 32, 80, 80]              64
     ConvBNLayer-180           [-1, 32, 80, 80]               0
          Conv2d-181           [-1, 32, 80, 80]           9,216
     BatchNorm2d-182           [-1, 32, 80, 80]              64
     ConvBNLayer-183           [-1, 32, 80, 80]               0
DarknetBottleneck-184           [-1, 32, 80, 80]               0
          Conv2d-185           [-1, 64, 80, 80]           4,096
     BatchNorm2d-186           [-1, 64, 80, 80]             128
     ConvBNLayer-187           [-1, 64, 80, 80]               0
        CSPLayer-188           [-1, 64, 80, 80]               0
          Conv2d-189           [-1, 32, 40, 40]           8,192
     BatchNorm2d-190           [-1, 32, 40, 40]              64
     ConvBNLayer-191           [-1, 32, 40, 40]               0
          Conv2d-192           [-1, 32, 40, 40]           8,192
     BatchNorm2d-193           [-1, 32, 40, 40]              64
     ConvBNLayer-194           [-1, 32, 40, 40]               0
          Conv2d-195           [-1, 32, 40, 40]           1,024
     BatchNorm2d-196           [-1, 32, 40, 40]              64
     ConvBNLayer-197           [-1, 32, 40, 40]               0
          Conv2d-198           [-1, 32, 40, 40]           9,216
     BatchNorm2d-199           [-1, 32, 40, 40]              64
     ConvBNLayer-200           [-1, 32, 40, 40]               0
DarknetBottleneck-201           [-1, 32, 40, 40]               0
          Conv2d-202           [-1, 64, 40, 40]           4,096
     BatchNorm2d-203           [-1, 64, 40, 40]             128
     ConvBNLayer-204           [-1, 64, 40, 40]               0
        CSPLayer-205           [-1, 64, 40, 40]               0
          Conv2d-206           [-1, 32, 20, 20]          16,384
     BatchNorm2d-207           [-1, 32, 20, 20]              64
     ConvBNLayer-208           [-1, 32, 20, 20]               0
          Conv2d-209           [-1, 32, 20, 20]          16,384
     BatchNorm2d-210           [-1, 32, 20, 20]              64
     ConvBNLayer-211           [-1, 32, 20, 20]               0
          Conv2d-212           [-1, 32, 20, 20]           1,024
     BatchNorm2d-213           [-1, 32, 20, 20]              64
     ConvBNLayer-214           [-1, 32, 20, 20]               0
          Conv2d-215           [-1, 32, 20, 20]           9,216
     BatchNorm2d-216           [-1, 32, 20, 20]              64
     ConvBNLayer-217           [-1, 32, 20, 20]               0
DarknetBottleneck-218           [-1, 32, 20, 20]               0
          Conv2d-219           [-1, 64, 20, 20]           4,096
     BatchNorm2d-220           [-1, 64, 20, 20]             128
     ConvBNLayer-221           [-1, 64, 20, 20]               0
        CSPLayer-222           [-1, 64, 20, 20]               0
          Conv2d-223         [-1, 32, 160, 160]          73,728
     BatchNorm2d-224         [-1, 32, 160, 160]              64
     ConvBNLayer-225         [-1, 32, 160, 160]               0
      transition-226         [-1, 32, 320, 320]               0
         Dropout-227         [-1, 32, 320, 320]               0
          Conv2d-228          [-1, 1, 320, 320]              33
         Dropout-229         [-1, 32, 320, 320]               0
          Conv2d-230          [-1, 1, 320, 320]              33
         Dropout-231         [-1, 32, 320, 320]               0
          Conv2d-232          [-1, 1, 320, 320]              33
         Dropout-233         [-1, 32, 320, 320]               0
          Conv2d-234          [-1, 1, 320, 320]              33
================================================================
Total params: 972,956
Trainable params: 972,956
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.39
Forward/backward pass size (MB): 786.73
Params size (MB): 3.71
Estimated Total Size (MB): 790.83
----------------------------------------------------------------
